import React, { useState } from 'react';
import Creatable from "react-select/creatable";
import Select from 'react-select';
import { components } from "react-select";
import './App.css';

const entypedata = {
  "tech" : [
    {
      label: "Программирование на Scratch",
      value: "Программирование на Scratch"
    },
    {
      label: "Программирование на Python",
      value: "Программирование на Python"
    },
    {
      label: "Управление беспилотными летательными аппаратами",
      value: "БПЛА"
    },
    {
      label: "Робототехника Lego WeDo",
      value: "Робототехника Lego WeDo"
    },
    {
      label: "Робототехника Lego EV",
      value: "Робототехника Lego EV"
    },
    {
      label: "3D моделирование и 3D печать",
      value: "3D моделирование и 3D печать"
    },
    {
      label: "VR/AR",
      value: "VR/AR"
    },
  ],
  "sci" : [
    {
      label: "Экология",
      value: "Экология"
    },
    {
      label: "Физиология",
      value: "Физиология"
    },
    {
      label: "Биохимия",
      value: "Биохимия"
    },
    {
      label: "Биотехнолгии",
      value: "Биотехнолгии"
    }
  ],
  "art" : [
    {
      label: "Театр",
      value: "Театр"
    }
  ],
  "adv" : [
    {
      label: "Основы туризма",
      value: "baseadv"
    },
    {
      label: "Краеведение",
      value: "lendadv"
    },
    {
      label: "Школа безопасности",
      value: "schooldanger"
    },
    {
      label: "Музейное дело",
      value: "Музейное дело"
    }
  ],
  "sport" : [
    {
      label: "Вольная борьба",
      value: "Вольная борьба"
    },
    {
      label: "Баскетбол",
      value: "Баскетбол"
    },
    {
      label: "Лёгкая отлетика",
      value: "Лёгкая отлетика"
    },
    {
      label: "Киокушинкай",
      value: "Киокушинкай"
    }
  ],
  "soc" : [
        {
      label: "Финансоваая грамотность",
      value: "Финансоваая грамотность"
    },
    // {
    //   label: "Журналистика",
    //   value: "Журналистика"
    // },
    {
      label: "Медиацентр",
      value: "Медиацентр"
    },
  ],
  "" : [
  ],
}

const en_form_data = [
  {
    label: "очная",
    value: "очная"
  },
  {
    label: "дистанционная",
    value: "дистанционная"
  },
  {
    label: "заочная",
    value: "заочная"
  }
]

const en_subject_tasks = {
  "Музейное дело": [
    {
      label: "Изучить основы музейного дела",
      value: "Изучить основы музейного дела"
    },
    {
      label: "Познакомить с правилами комплектования и работы с музейными фондами",
      value: "Познакомить с правилами комплектования и работы с музейными фондами"
    },
    {
      label: "Научить основам экскурсионной работы",
      value: "Научить основам экскурсионной работы"
    },
    {
      label: "Организовать исследовательскую деятельность в школьном музее",
      value: "Организовать исследовательскую деятельность в школьном музее"
    }
  ],
  "VR/AR": [
    {
      label: "Сформировать представление о технологии дополненной и виртуальной реальности.",
      value: "Сформировать представление о технологии дополненной и виртуальной реальности."
    },
    {
      label: "Научить основам 3D-моделирования.",
      value: "Научить основам 3D-моделирования."
    },
    {
      label: "Сформировать ключевые компетенции в разработке дополненной реальности",
      value: "Сформировать ключевые компетенции в разработке дополненной реальности"
    },
    {
      label: "Совершенствовать ключевые компетенции в разработки виртуальной реальности",
      value: "Совершенствовать ключевые компетенции в разработки виртуальной реальности"
    },
    {
      label: "Сформировать навык разработки проектов VR/AR",
      value: "Сформировать навык разработки проектов VR/AR"
    }
  ],
  "Финансоваая грамотность":[
    {
      label: "Сформировать представление о семейном бюджете и основах его планирования",
      value: "Сформировать представление о семейном бюджете и основах его планирования"
    },
    {
      label: "Сформировать представление о роли банков в финансовом благополучии человека",
      value: "Сформировать представление о роли банков в финансовом благополучии человека"
    },
    {
      label: "Сформировать знания в области налогообложения и социальных выплат для физических лиц",
      value: "Сформировать знания в области налогообложения и социальных выплат для физических лиц"
    },
    {
      label: "Сформировать знания по основам финансовой безопасности",
      value: "Сформировать знания по основам финансовой безопасности"
    }
  ],
  "Программирование на Python": [
    {
      label: "Сформировать интерес к программированию.",
      value: "Сформировать интерес к программированию."
    },
    {
      label: "Научить основам программирования на Python.",
      value: "Научить основам программирования на Python."
    },
    {
      label: "Сформировать навык разработки проектов на  Python",
      value: "Сформировать навык разработки проектов на  Python"
    },
    {
      label: "Совершенствовать ключевые компетенции   программирования на Python",
      value: "Совершенствовать ключевые компетенции   программирования на Python"
    }
  ],
  "baseadv" : [
    {
      label: "Научить основам туристской подготовки",
      value: "Научить основам туристской подготовки"
    },
    {
      label: "Научить основам гигиены и первой доврачебной помощи",
      value: "Научить основам гигиены и первой доврачебной помощи"
    },
    {
      label: "Научить основам топографии и ориентирования",
      value: "Научить основам топографии и ориентирования"
    },
    {
      label: "Научить основам краеведения",
      value: "Научить основам краеведения"
    }
  ],
  "lendadv" : [
    {
      label: "Изучить историю Хабаровского края",
      value: "Изучить историю Хабаровского края"
    },
    {
      label: "Познакомить с этнографией коренных малых народов севера, проживающих в Хабаровском крае",
      value: "Познакомить с этнографией коренных малых народов севера, проживающих в Хабаровском крае"
    },
    {
      label: "Познакомить с флорой и фауной Хабаровского края",
      value: "Познакомить с флорой и фауной Хабаровского края"
    },
    {
      label: "Изучить географию Хабаровского края",
      value: "Изучить географию Хабаровского края"
    }
  ],
  "schooldanger" : [
    {
      label: "Научить основам безопасности жизнедеятельности",
      value: "Научить основам безопасности жизнедеятельности"
    },
    {
      label: "Научить правильному поведению в чрезвычайных ситуациях",
      value: "Научить правильному поведению в чрезвычайных ситуациях"
    },
    {
      label: "Сформировать первичные умения по оказанию первой доврачебной помощи",
      value: "Сформировать первичные умения по оказанию первой доврачебной помощи"
    },
    {
      label: "Научить основам пожарно-прикладного и спасательного спорта (ППС)",
      value: "Научить основам пожарно-прикладного и спасательного спорта (ППС)"
    }
  ],
  "Вольная борьба": [
    {
      label: "Научить основам вольной борьбы",
      value: "Научить основам вольной борьбы"
    },
    {
      label: "Способствовать развитию общей физической подготовки",
      value: "Способствовать развитию общей физической подготовки"
    },
    {
      label: "Обучить основам специальной физической подготовки",
      value: "Обучить основам специальной физической подготовки"
    },
    {
      label: "Обучить навыкам техники и тактики ведения схватки на соревнованиях",
      value: "Обучить навыкам техники и тактики ведения схватки на соревнованиях"
    }
  ],
  "Баскетбол": [
    {
      label: "Познакомить учащихся с видом спорта «Баскетбол», правилами игры, техникой, тактикой, правилами судейства и организацией проведения соревнований, мерами безопасности на занятиях",
      value: "Познакомить учащихся с видом спорта «Баскетбол», правилами игры, техникой, тактикой, правилами судейства и организацией проведения соревнований, мерами безопасности на занятиях"
    },
    {
      label: "Способствовать развитию физических качеств, необходимых для успешной игры в баскетбол",
      value: "Способствовать развитию физических качеств, необходимых для успешной игры в баскетбол"
    },
    {
      label: "Познакомить с техническими и тактическими приемами баскетбола",
      value: "Познакомить с техническими и тактическими приемами баскетбола"
    },
    {
      label: "Способствовать формированию соревновательного опыта",
      value: "Способствовать формированию соревновательного опыта"
    }
  ],
  "Лёгкая отлетика": [
    {
      label: "Обучить необходимым понятиям и теоретическим сведениям по физической культуре и спорту",
      value: "Обучить необходимым понятиям и теоретическим сведениям по физической культуре и спорту"
    },
    {
      label: "Развивать основные физические качества",
      value: "Развивать основные физические качества"
    },
    {
      label: "Развивать физические качества, специальные двигательные навыки",
      value: "Развивать физические качества, специальные двигательные навыки"
    },
    {
      label: "Повысить техническую подготовленность в данном виде спорта",
      value: "Повысить техническую подготовленность в данном виде спорта"
    }
  ],
  "Киокушинкай": [
    {
      label: "Познакомить с терминами, общими понятиями, техникой безопасности, историей, основными направлениями и техниками киокусинкай",
      value: "Познакомить с терминами, общими понятиями, техникой безопасности, историей, основными направлениями и техниками киокусинкай"
    },
    {
      label: "Способствовать развитию общей физической подготовки (ОФП)",
      value: "Способствовать развитию общей физической подготовки (ОФП)"
    },
    {
      label: "Научить основам специальной физической подготовки (СФП)",
      value: "Научить основам специальной физической подготовки (СФП)"
    },
    {
      label: "Научить базовым техникам киокусинкай",
      value: "Научить базовым техникам киокусинкай"
    }
  ],
  "БПЛА": [
    {
      label: "Научить основам пилотирования БПЛА",
      value: "Научить основам пилотирования БПЛА"
    },
    {
      label: "Научить основам FPV пилотирования и обслуживания БПЛА на практике",
      value: "Научить основам FPV пилотирования и обслуживания БПЛА на практике"
    },
    {
      label: "Научить основам аэрофотосъёмки и фотограмметрии",
      value: "Научить основам аэрофотосъёмки и фотограмметрии"
    },
    {
      label: "Научить основам автономного пилотирования БПЛА",
      value: "Научить основам автономного пилотирования БПЛА"
    },
    {
      label: "Развивать навык  пилотирования  и эксплуатации БПЛА",
      value: "Развивать навык  пилотирования  и эксплуатации БПЛА"
    }
  ],
  "Театр": [
    {
      label: "Сформировать общее представление о театре",
      value: "Сформировать общее представление о театре"
    },
    {
      label: "Научить основам актерского мастерства",
      value: "Научить основам актерского мастерства"
    },
    {
      label: "Научить практическим навыкам сценической речи и работы с художественным текстом",
      value: "Научить практическим навыкам сценической речи и работы с художественным текстом"
    },
    {
      label: "Обучить основам сценического движения",
      value: "Обучить основам сценического движения"
    },
    {
      label: "Сформировать навыки театрально-исполнительской деятельности",
      value: "Сформировать навыки театрально-исполнительской деятельности"
    },
    {
      label: "Научить основам сценографии",
      value: "Научить основам сценографии"
    },
    {
      label: "Научить основам кукловождения и способам изготовления кукол",
      value: "Научить основам кукловождения и способам изготовления кукол"
    },
    {
      label: "Вовлечь в социально-значимую деятельность",
      value: "Вовлечь в социально-значимую деятельность"
    }
  ],
  "Медиацентр": [
    {
      label: "Сформировать общее представление о журналистике и особенностях профессии «журналист»",
      value: "Сформировать общее представление о журналистике и особенностях профессии «журналист»"
    },
    {
      label: "Познакомить с направлением журналистики «периодическая печать»",
      value: "Познакомить с направлением журналистики «периодическая печать»"
    },
    {
      label: "Научить основам фотожурналистики",
      value: "Научить основам фотожурналистики"
    },
    {
      label: "Научить основам тележурналистики",
      value: "Научить основам тележурналистики"
    },
    {
      label: "Научить основам операторского мастерства и видеомонтажа",
      value: "Научить основам операторского мастерства и видеомонтажа"
    },
    {
      label: "Научить основам радиожурналистики",
      value: "Научить основам радиожурналистики"
    },
    {
      label: "Познакомить с формами интернет-журналистики",
      value: "Познакомить с формами интернет-журналистики"
    },
    {
      label: "Познакомить с основами организации работы медиацентра в школе",
      value: "Познакомить с основами организации работы медиацентра в школе"
    }
  ],
  "Программирование на Scratch": [
    {
      label: "Сформировать интерес к программированию",
      value: "Сформировать интерес к программированию"
    },
    {
      label: "Научить основам алгоритмизации  и языка программирования Scratch",
      value: "Научить основам алгоритмизации  и языка программирования Scratch"
    },
    {
      label: "Сформировать навык разработки проектов в среде Scratch",
      value: "Сформировать навык разработки проектов в среде Scratch"
    },
    {
      label: "Совершенствовать ключевые компетенции программирования в Scratch",
      value: "Совершенствовать ключевые компетенции программирования в Scratch"
    }
  ],
  "Робототехника Lego WeDo": [
    {
      label: "Сформировать интерес к робототехнике",
      value: "Сформировать интерес к робототехнике"
    },
    {
      label: "Научить основам алгоритмизации и программирования робототехнических устройств",
      value: "Научить основам алгоритмизации и программирования робототехнических устройств"
    },
    {
      label: "Научить проектировать и создавать робототехнические устройства",
      value: "Научить проектировать и создавать робототехнические устройства"
    },
    {
      label: "Совершенствовать ключевые компетенции по созданию робототехнических проектов",
      value: "Совершенствовать ключевые компетенции по созданию робототехнических проектов"
    },
  ],
  "Робототехника Lego EV": [
    {
      label: "Сформировать интерес  к робототехнике",
      value: "Сформировать интерес  к робототехнике"
    },
    {
      label: "Научить основам алгоритмизации  и программирования робототехнических устройств",
      value: "Научить основам алгоритмизации  и программирования робототехнических устройств"
    },
    {
      label: "Сформировать навык разработки робототехнических проектов",
      value: "Сформировать навык разработки робототехнических проектов"
    },
    {
      label: "Совершенствовать ключевые компетенции  по созданию робототехнических проектов",
      value: "Совершенствовать ключевые компетенции  по созданию робототехнических проектов"
    },
  ],
  "3D моделирование и 3D печать": [
    {
      label: "Сформировать интерес к 3D моделированию.",
      value: "Сформировать интерес к 3D моделированию."
    },
    {
      label: "Научить основам 3D моделирования.",
      value: "Научить основам 3D моделирования."
    },
    {
      label: "Сформировать базовые знания и умения в трехмерной графике.",
      value: "Сформировать базовые знания и умения в трехмерной графике."
    },
    {
      label: "Сформировать начальные умения в трехмерной печати.",
      value: "Сформировать начальные умения в трехмерной печати."
    },
  ],
}

let select_limit = 0;
let selected_count = 0;

const Menu = (props) => {
  return (
    <components.Menu {...props}>
      { selected_count < select_limit / 18 ? (props.children) : (<div style={{ margin: 15 }}>Max limit achieved</div>)}
    </components.Menu>
  );
};

const Menu1 = (props) => {
  return (
    <components.Menu {...props}>
      {props.getValue().length || 0 <= 2 ? (props.children) : (<div style={{ margin: 15 }}>Max limit achieved</div>)}
    </components.Menu>
  );
};

const check_select = (p1) => {
  selected_count = p1.length;
}

const change_time = (param1, param2, param3) => {
  select_limit = (Number(param1) * Number(param2) * Number(param3));
}

const en_meta_data = [
  {
    label: "Сформировать начальные умения в проектной деятельности",
    value: "Сформировать начальные умения в проектной деятельности"
  },
  {
    label: "Научить основам исследовательской деятельности",
    value: "Научить основам исследовательской деятельности"
  }
]

const en_meta_data_no = [
    {
    label: "Научить основам кооперации",
    value: "Научить основам кооперации"
  },
  {
    label: "Развить коммуникативные навыки",
    value: "Развить коммуникативные навыки"
  },
  {
    label: "Сформировать начальные умения в проектной деятельности",
    value: "Сформировать начальные умения в проектной деятельности"
  },
  {
    label: "Научить основам исследовательской деятельности",
    value: "Научить основам исследовательской деятельности"
  }
]

const en_person_data = {
  "": [],
  "tech": [],
  "sci": [],
  "art": [
    {
      label: "Воспитывать культуру поведения",
      value: "Воспитывать культуру поведения"
    },
    {
      label: "Способствовать освоению социальных норм, правил поведения",
      value: "Способствовать освоению социальных норм, правил поведения"
    },
    { 
      label: "Формировать навыки поведения и совместной деятельности в творческом коллективе",
      value: "Формировать навыки поведения и совместной деятельности в творческом коллективе"
    },
    {
      label: "Воспитывать уважительное отношение между членами коллектива",
      value: "Воспитывать уважительное отношение между членами коллектива"
    },
    {
      label: "Воспитывать культуру общения",
      value: "Воспитывать культуру общения"
    },
    {
      label: "Формировать ценностное отношение к социально-значимой деятельности",
      value: "Формировать ценностное отношение к социально-значимой деятельности"
    }
  ],
  "adv": [
    {
      label: "Приобщить к физической культуре и здоровому образу жизни",
      value: "Приобщить к физической культуре и здоровому образу жизни"
    },
    {
      label: "Сформировать стремление к здоровому образу жизни, отвращение к вредным привычкам",
      value: "Сформировать стремление к здоровому образу жизни, отвращение к вредным привычкам"
    },
    {
      label: "Способствовать формированию осознанного и бережного отношения к природе",
      value: "Способствовать формированию осознанного и бережного отношения к природе"
    },
    {
      label: "Мотивировать к самостоятельной общественно-значимой деятельности",
      value: "Мотивировать к самостоятельной общественно-значимой деятельности"
    },
    {
      label: "Способствовать формированию чувства коллективизма",
      value: "Способствовать формированию чувства коллективизма"
    },
    {
      label: "Способствовать формированию уважительного отношения к малой Родине",
      value: "Способствовать формированию уважительного отношения к малой Родине"
    }
  ],
  "sport": [
    {
      label: "Сформировать устойчивую мотивацию к занятиям физической культурой и активному отдыху",
      value: "Сформировать устойчивую мотивацию к занятиям физической культурой и активному отдыху"
    },
    {
      label: "Мотивировать к ведению здорового образа жизни",
      value: "Мотивировать к ведению здорового образа жизни"
    },
    {
      label: "Сформировать ценностное отношение к своему здоровью",
      value: "Сформировать ценностное отношение к своему здоровью"
    },
    {
      label: "Сформировать ценностное отношение к своему здоровью",
      value: "Сформировать ценностное отношение к своему здоровью"
    },
  ],
  "soc": [],
  "Медиацентр": [
    {
      label: "Воспитывать культуру поведения",
      value: "Воспитывать культуру поведения"
    },
    {
      label: "Способствовать освоению социальных норм, правил поведения",
      value: "Способствовать освоению социальных норм, правил поведения"
    },
    {
      label: "Воспитывать уважительное отношение между членами коллектива",
      value: "Воспитывать уважительное отношение между членами коллектива"
    },
    {
      label: "Формировать ценностное отношение к социально-значимой деятельности",
      value: "Формировать ценностное отношение к социально-значимой деятельности"
    }
  ],
  "Театр": [
    {
      label: "Воспитывать культуру поведения",
      value: "Воспитывать культуру поведения"
    },
    {
      label: "Способствовать освоению социальных норм, правил поведения",
      value: "Способствовать освоению социальных норм, правил поведения"
    },
    {
      label: "Формировать навыки поведения и совместной деятельности в творческом коллективе",
      value: "Формировать навыки поведения и совместной деятельности в творческом коллективе"
    },
    {
      label: "Воспитывать уважительное отношение между членами коллектива",
      value: "Воспитывать уважительное отношение между членами коллектива"
    },
    {
      label: "Воспитывать культуру общения",
      value: "Воспитывать культуру общения"
    },
    {
      label: "Формировать ценностное отношение к социально-значимой деятельности",
      value: "Формировать ценностное отношение к социально-значимой деятельности"
    }
  ],
  "Финансоваая грамотность": [
    {
      label: "Способствовать формированию осознанного и ответственного поведения в области личных финансов",
      value: "Способствовать формированию осознанного и ответственного поведения в области личных финансов"
    },
    {
      label: "Формировать у обучающихся финансовую культуру",
      value: "Формировать у обучающихся финансовую культуру"
    }
  ]
}

function App (){
  const [value_0, setValue_0] = useState('');
  const [value_1, setValue_1] = useState('');

  const [param_limit_1, setParam_1_Limit] = useState('');
  const [param_limit_2, setParam_2_Limit] = useState('');
  const [param_limit_3, setParam_3_Limit] = useState('');

  const [param_limit_4, setParam_4_Limit] = useState('');

  const [select_list1, setSelect_list1] = useState('');

  const selfun = (p1, p2, p3, p4) => {
    if (p1 === "36"){
      if (p4 === "1") change_time(p1, 1, 2)
      else if (p4 === "2") change_time(p1, 2, 1)
      else if (p4 === "3") change_time(p1, 1, 1)
      else change_time(p1, 0, 0)
    }
    else change_time(p1, p2, p3)
  }

  const funalert = () =>{
    if (selected_count > select_limit / 18 - 1 && selected_count !== 0) {
      return <label className='alertMessege'>!часы за метапредметные задачи учитываться не будут!</label>
    }
  }

  const fun = () => {
    // console.log(select_limit);
    if (param_limit_1 === "36")
      return <div onClick={selfun(param_limit_1, param_limit_2, param_limit_3, param_limit_4)}>
        <p>Выберите план </p>
        <select type="text" name="en_duration_lesson_choice" value={param_limit_4} onChange={(event)=>{setParam_4_Limit(event.target.value)}}>
          <option value="0"></option>
          <option value="1">продолжительность занятия - 1 час; 2 занятия в неделю</option>
          <option value="2">продолжительность занятия - 2 час; 1 занятие в неделю</option>
          <option value="3">продолжительность занятия - 1 час; 1 занятие в неделю</option>
        </select><br/>
        </div>
    else if (param_limit_1 === "18") return <div onClick={selfun(param_limit_1, param_limit_2, param_limit_3, param_limit_4)}><p>Продолжительность  занятия  в академических  часах </p>
    <select type="text" name="en_duration_lesson" value={param_limit_2} onChange={(event)=>{setParam_2_Limit(event.target.value)}}>
      <option value="0">0</option>
      <option value="1">1</option>
      <option value="2">2</option>
    </select><br/>
    <p>Кол-во занятий в неделю </p>
    <select type="text" name="en_number_classes" value={param_limit_3} onChange={(event)=>{setParam_3_Limit(event.target.value)}}>
      <option value="0">0</option>
      <option value="1">1</option>
      <option value="2">2</option>
    </select><br/>
    </div>
    else return <div></div>
  }
  
  const get_personal_tasks = () =>{
    if (['art', 'adv', 'sport'].includes(value_0)) return en_person_data[value_0];
    else return en_person_data[value_1];
  }

  const spec_equipment = {
    "adv": [
          {
            label: "карабин",
            value: "карабин"
          },
          {
            label: "жумар",
            value: "жумар"
          },
          {
            label: 'спусковое устройство "восьмерка"',
            value: 'спусковое устройство "восьмерка"'
          },
          {
            label: "веревка динамика",
            value: "веревка динамика"
          },
          {
            label: "веревка статика",
            value: "веревка статика"
          },
          {
            label: "спальный мешок",
            value: "спальный мешок"
          },
          {
            label: "костровое оборудование",
            value: "костровое оборудование"
          },
          {
            label: "палатка",
            value: "палатка"
          },
          {
            label: "каремат",
            value: "каремат"
          },
          {
            label: "тент",
            value: "тент"
          },
          {
            label: "кухонное оборудование",
            value: "кухонное оборудование"
          },
          {
            label: "аптечка медицинская",
            value: "аптечка медицинская"
          },
          {
            label: "шины",
            value: "шины"
          },
          {
            label: "жгуты",
            value: "жгуты"
          }
        ],
    "VR/AR": [
      {
        label: "Стационарный компьютер тип 1",
        value: "Стационарный компьютер тип 1"
      },
      {
        label: "Стационарный компьютер тип 2",
        value: "Стационарный компьютер тип 2"
      },
      {
        label: "Шлем виртуальной реальности полупрофессиональный",
        value: "Шлем виртуальной реальности полупрофессиональный"
      },
      {
        label: "Шлем виртуальной реальности любительский",
        value: "Шлем виртуальной реальности любительский"
      },
      {
        label: "Очки дополненной реальности",
        value: "Очки дополненной реальности"
      },
      {
        label: "Смартфон на платформе Android",
        value: "Смартфон на платформе Android"
      },
      {
        label: "Планшет на платформе Android",
        value: "Планшет на платформе Android"
      },
      {
        label: "Шлем виртуальной реальности, профессиональный",
        value: "Шлем виртуальной реальности, профессиональный"
      },
      {
        label: "Штатив для базовых станций",
        value: "Штатив для базовых станций"
      },
      {
        label: "Доступ к сети интернет",
        value: "Доступ к сети интернет"
      }
    ],
    "Вольная борьба": [
      {
        label: "тренировочный спортивный зал",
        value: "тренировочный спортивный зал"
      },
      {
        label: "тренажерный зал",
        value: "тренажерный зал"
      },
      {
        label: "раздевалки и душевые",
        value: "раздевалки и душевые"
      },
      {
        label: "медицинский кабинет",
        value: "медицинский кабинет"
      },
      {
        label: "борцовский ковер",
        value: "борцовский ковер"
      },
      {
        label: "тренировочный мешок-чучело",
        value: "тренировочный мешок-чучело"
      },
      {
        label: "настенные блоки",
        value: "настенные блоки"
      },
      {
        label: "станок для развития силы кисти",
        value: "станок для развития силы кисти"
      },
      {
        label: "шест",
        value: "шест"
      },
      {
        label: "набивные мячи",
        value: "набивные мячи"
      },
      {
        label: "скакалки",
        value: "скакалки"
      },
      {
        label: "гантели",
        value: "гантели"
      },
      {
        label: "гири",
        value: "гири"
      },
      {
        label: "штанги",
        value: "штанги"
      },
      {
        label: "гимнастические кольца",
        value: "гимнастические кольца"
      },
      {
        label: "канат",
        value: "канат"
      },
      {
        label: "гимнастическая стенка",
        value: "гимнастическая стенка"
      }
    ],
    "Киокушинкай": [
      {
        label: "напольное покрытие татами",
        value: "напольное покрытие татами"
      },
      {
        label: "мешки боксёрские",
        value: "мешки боксёрские"
      },
      {
        label: "лапы боксерские",
        value: "лапы боксерские"
      },
      {
        label: "перчатки боксёрские",
        value: "перчатки боксёрские"
      },
      {
        label: "макивары ручные, для отработки ударов ногами",
        value: "макивары ручные, для отработки ударов ногами"
      },
      {
        label: "гири",
        value: "гири"
      },
      {
        label: "гантели",
        value: "гантели"
      },
      {
        label: "мячи футбольные, баскетбольные, волейбольные, теннисные, набивныемячи футбольные, баскетбольные, волейбольные, теннисные, набивные",
        value: "мячи футбольные, баскетбольные, волейбольные, теннисные, набивные"
      },
      {
        label: "секундомер",
        value: "секундомер"
      },
      {
        label: "скакалка гимнастическая",
        value: "скакалка гимнастическая"
      },
      {
        label: "скамейка гимнастическая",
        value: "скамейка гимнастическая"
      },
      {
        label: "турник навесной на гимнастическую стенку",
        value: "турник навесной на гимнастическую стенку"
      },
      {
        label: "паховые и грудные щитки",
        value: "паховые и грудные щитки"
      },
      {
        label: "щитки, шлем, капа, боксёрские и снарядные перчатки;",
        value: "щитки, шлем, капа, боксёрские и снарядные перчатки;"
      },
      {
        label: "средства промывки полости рта по время поединка",
        value: "средства промывки полости рта по время поединка"
      },
    ],
    "Лёгкая отлетика": [
      {
        label: "секундомер",
        value: "секундомер"
      },
      {
        label: "набивные мячи",
        value: "набивные мячи"
      },
      {
        label: "перекладины для подтягивания в висе",
        value: "перекладины для подтягивания в висе"
      },
      {
        label: "гимнастические скакалки для прыжков",
        value: "гимнастические скакалки для прыжков"
      },
      {
        label: "фишки, кубики",
        value: "фишки, кубики"
      },
      {
        label: "гимнастические маты",
        value: "гимнастические маты"
      },
      {
        label: "баскетбольные мячи",
        value: "баскетбольные мячи"
      },
      {
        label: "теннисные мячи",
        value: "теннисные мячи"
      },
      {
        label: "гимнастическая стенка",
        value: "гимнастическая стенка"
      },
      {
        label: "гимнастические скамейки",
        value: "гимнастические скамейки"
      }
    ],
    "Баскетбол": [
      {
        label: "спортивный зал с баскетбольной разметкой площадки",
        value: "спортивный зал с баскетбольной разметкой площадки"
      },
      {
        label: "спортивная площадка",
        value: "спортивная площадка"
      },
      {
        label: "щитки",
        value: "щитки"
      },
      {
        label: "корзины",
        value: "корзины"
      },
      {
        label: "баскетбольные стойки",
        value: "баскетбольные стойки"
      },
      {
        label: "баскетбольные мячи",
        value: "баскетбольные мячи"
      },
      {
        label: "набивные мячи",
        value: "набивные мячи"
      },
      {
        label: "стойки для обводки",
        value: "стойки для обводки"
      },
      {
        label: "гимнастические маты",
        value: "гимнастические маты"
      },
      {
        label: "гимнастические скакалки",
        value: "гимнастические скакалки"
      },
      {
        label: "гантели",
        value: "гантели"
      },
      {
        label: "футбольные, волейбольные мячи",
        value: "футбольные, волейбольные мячи"
      },
      {
        label: "журналы и справочники",
        value: "журналы и справочники"
      },
      {
        label: "фото и видеоаппаратура",
        value: "фото и видеоаппаратура"
      },
    ],
    "Театр": [
      {
        label: "зеркала",
        value: "зеркала"
      },
      {
        label: "набор грима",
        value: "набор грима"
      },
      {
        label: "костюмы",
        value: "костюмы"
      },
      {
        label: "ширма",
        value: "ширма"
      },
      {
        label: "звуковое оборудование (музыкальный центр, микшер, колонки)",
        value: "звуковое оборудование (музыкальный центр, микшер, колонки)"
      },
      {
        label: "видеокамера",
        value: "видеокамера"
      },
      {
        label: "световое оборудование",
        value: "световое оборудование"
      },
      {
        label: "инвентарь и материалы для изготовления кукол",
        value: "инвентарь и материалы для изготовления кукол"
      },
      {
        label: "компьютер",
        value: "компьютер"
      },
      {
        label: "проектор",
        value: "проектор"
      },
      {
        label: "экран",
        value: "экран"
      }
      
    ],
    "БПЛА": [
      {
        label: "набор для сборки без пайки",
        value: "набор для сборки без пайки"
      },
      {
        label: "моторы коллекторные",
        value: "моторы коллекторные"
      },
      {
        label: "канал связи управления квадрокоптером",
        value: "канал связи управления квадрокоптером"
      },
      {
        label: "полетный контроллер",
        value: "полетный контроллер"
      },
      {
        label: "оптическая система навигации в помещении",
        value: "оптическая система навигации в помещении"
      },
      {
        label: "модуль Wi-Fi видеокамеры",
        value: "модуль Wi-Fi видеокамеры"
      },
      {
        label: "вычислитель с поддержкой ROS",
        value: "вычислитель с поддержкой ROS"
      },
      {
        label: "модуль фото/видеокамеры разрешением не менее 4K со сменными объективами и сменными светофильтрами, в том числе с ИК-светофильтром",
        value: "модуль фото/видеокамеры разрешением не менее 4K со сменными объективами и сменными светофильтрами, в том числе с ИК-светофильтром"
      },
      {
        label: "модуль навигации GPS/ГЛОНАСС",
        value: "модуль навигации GPS/ГЛОНАСС"
      },
      {
        label: "пульт управления",
        value: "пульт управления"
      },
      {
        label: "аккумуляторная батарея с зарядным устройством",
        value: "аккумуляторная батарея с зарядным устройством"
      },
      {
        label: "программное приложение для программирования и управления квадрокоптером, в том числе для смартфонов",
        value: "программное приложение для программирования и управления квадрокоптером, в том числе для смартфонов"
      },
      {
        label: "Компьютер (ОС, офисное ПО, мышь, оперативная память не менее 8 ГБ, объем накопителя SSD/eMMC не менее 128 ГБ)",
        value: "Компьютер (ОС, офисное ПО, мышь, оперативная память не менее 8 ГБ, объем накопителя SSD/eMMC не менее 128 ГБ)"
      },
      {
        label: "учебный набор квадрокоптера по компетенции Эксплуатация Беспилотных Авиационных Систем «COEX Клевер 4 World Skills Russia», либо близкий к нему по характеристикам и квадрокоптер с телевизором для мониторинга рекомендуемый «COEX Пеликан Mini», либо близкий к нему по характеристикам.",
        value: "учебный набор квадрокоптера по компетенции Эксплуатация Беспилотных Авиационных Систем «COEX Клевер 4 World Skills Russia», либо близкий к нему по характеристикам и квадрокоптер с телевизором для мониторинга рекомендуемый «COEX Пеликан Mini», либо близкий к нему по характеристикам."
      }
    ],
    "Программирование на Scratch": [
      {
        label: "Компьютер (ОС, офисное ПО, мышь, оперативная память не менее 8 ГБ, объем накопителя SSD/eMMC не менее 128 ГБ)",
        value: "Компьютер (ОС, офисное ПО, мышь, оперативная память не менее 8 ГБ, объем накопителя SSD/eMMC не менее 128 ГБ)"
      },
      {
        label: "доступ к сети интернет",
        value: "доступ к сети интернет"
      },
    ],
    "Программирование на Python": [
      {
        label: "Компьютер (ОС, офисное ПО, мышь, оперативная память не менее 8 ГБ, объем накопителя SSD/eMMC не менее 128 ГБ)",
        value: "Компьютер (ОС, офисное ПО, мышь, оперативная память не менее 8 ГБ, объем накопителя SSD/eMMC не менее 128 ГБ)"
      },
      {
        label: "доступ к сети интернет",
        value: "доступ к сети интернет"
      },
    ],
    "Робототехника Lego WeDo": [
      {
        label: "Наборы обучающих конструкторов Lego Education WeDo 2.0 арт. 45300",
        value: "Наборы обучающих конструкторов Lego Education WeDo 2.0 арт. 45300"
      },
      {
        label: "Планшетные компьютеры с поддержкой протокола беспроводной связи Bluetooth 4.0 и выше",
        value: "Планшетные компьютеры с поддержкой протокола беспроводной связи Bluetooth 4.0 и выше"
      },
    ]
    ,
    "Робототехника Lego EV": [
      {
        label: "Наборы обучающих конструкторов Lego Mindstorms EV3 арт. 45544",
        value: "Наборы обучающих конструкторов Lego Mindstorms EV3 арт. 45544"
      },
      {
        label: "Компьютер (ОС, офисное ПО, мышь, оперативная память не менее 8 ГБ, объем накопителя SSD/eMMC не менее 128 ГБ)",
        value: "Компьютер (ОС, офисное ПО, мышь, оперативная память не менее 8 ГБ, объем накопителя SSD/eMMC не менее 128 ГБ)"
      },
    ]
    ,
    '3D моделирование и 3D печать': [
      {
        label: "Компьютер (ОС, офисное ПО, мышь, оперативная память не менее 8 ГБ, объем накопителя SSD/eMMC не менее 128 ГБ);",
        value: "Компьютер (ОС, офисное ПО, мышь, оперативная память не менее 8 ГБ, объем накопителя SSD/eMMC не менее 128 ГБ);"
      },
      {
        label: "3D-ручки;",
        value: "3D-ручки;"
      },
      {
        label: "3D-принтер с комплектом расходных материалов;",
        value: "3D-принтер с комплектом расходных материалов;"
      },
      {
        label: "доступ к сети интернет",
        value: "доступ к сети интернет"
      },      
    ],
    "": []
  }

  const get_equipment = () => {
    if (value_0 === "adv") return spec_equipment[value_0];
    else return spec_equipment[value_1];
  }

  return (
    <div className="App">
      <form action='http://khv2022.pythonanywhere.com/constructor/get_mrt' method='POST'>
      <button type='submit'>!!!Скачать файл с методическими рекомендациями!!!</button>
      </form>
      <form action="http://khv2022.pythonanywhere.com/constructor/test" method = "POST">
        <div className="forms">
          <h2>Титульный лист</h2>
          <p>Учредитель образовательной организации</p>
          <input type="text" name="tp_founder_eo"/>
          <p>Полное название образовательной организации (по уставу)</p>
          <input type="text" name="tp_fullname_eo"/>
          <p>Сокращенное название образовательной организации (по уставу)</p>
          <input type="text" name="tp_shortname_eo"/>
          <p>Рассмотрено на </p>
          <select type="text" name="tp_expert_advisory_org">
            <option value="НМС">НМС (Научно-методический совет)</option>
            <option value="ПС">ПС (педагогический совет)</option>
          </select>
          <p>№ протокола</p>
          <input type="text" name="tp_protocol_number"/>
          <p>Дата заседания НМС, ПС</p>
          <input type="date" name="tp_meeting_date_smc"/>
          <p>Дата утверждения программы руководителем</p>
          <h5>(в соответствии с приказом образовательной организации реализующей программу)</h5>
          <input type="date" name="tp_date_approval_program"/>
          <p>Фамилия, иннициалы руководителя образовательной организации</p>
          <input type="text" name="tp_surname_head_eo"/>
          <p>Должность руководителя образовательной организации</p>
          <input type="text" name="tp_eo_lvl"/>
          <p>Дополнительная общеобразовательная общеразвивающая программа (укажите название)</p>
          <input type="text" name="tp_program_name"/>
          <p>Программа имеет направленность </p>
          <select type="text" name="en_orientation" value={value_0} onChange={(event) => setValue_0(event.target.value)}>
            <option value=""></option>
            <option value="tech">Техническая</option>
            <option value="sci">Естественнонаучная</option>
            <option value="art">Художественная</option>
            <option value="adv">Туристско-краеведческая</option>
            <option value="sport">Физкультурно-спортивная</option>
            <option value="soc">Социально-гуманитарная</option>
          </select><br/>
          <p>Адресат программы (возраст в границах  от 6 до 18 лет)</p>
          <input type="text" name="tp_addressee_program"/>
          <p>Дополнительные требования к обучающемуся (необязательно к заполнению)</p>
          <textarea name="tp_addressee_lvl"/>
          <p>Место реализации программы (город, поселок)</p>
          <input type="text" name="tp_implementation_place"/>
          <p>Год утверждения программы</p>
          <h5>(программы утверждаются ежегодно перед началом реализации)</h5>
          <select type="text" name="tp_approval_year">
            <option value="2022">2022</option>
            <option value="2023">2023</option>
            <option value="2024">2024</option>
            <option value="2025">2025</option>
            <option value="2026">2026</option>
            <option value="2027">2027</option>
            <option value="2028">2028</option>
            <option value="2029">2029</option>
            <option value="2029">2030</option>
          </select>
          <p>Фамилия, иннициалы, должность составителя программы</p>
          <h5>Например, Иванов С.И., педагог дополнительного образования</h5>
          <input type="text" name="tp_surname_originator"/>
          <h2>Пояснительная записка</h2>
          <p>Вид деятельности </p>
          <select type="text" name="en_type_activity" value={value_1} onChange={(event) => setValue_1(event.target.value)}>
            <option value=""></option>
            {entypedata[value_0].map(({ value, label }) => <option value={value}>{label}</option>)}
          </select>
          <div>
            <p>Актуальность</p>
            <h5>— это ответ на вопрос, зачем современным детям в современных условиях нужна конкретная программа (своевременность, современность). 
            Актуальность отражает:<br/>
            1. актуальность для общества (как ребёнок с приобретёнными компетенциями будет востребован в современном обществе),<br/>
            2. актуальность для ребёнка (что ребёнок приобретет и как изменится).
            (не более 1000 знаков)
            </h5>
          </div>
          <textarea name="en_relevance"/>
          <p>Цели программы</p>
          <textarea name='en_program_objectives '/>
          <div>
            <p>Новизна</p>
            <h5>
          указать, имеются ли аналогичные программы других авторов, чем от них отличается данная программа. Отличие может быть в том, как расставлены акценты, какие новые педагогические технологии, формы диагностики использованы и т. п. 
           </h5>
          <h4>
            Если новизны нет, не нужно ее выдумывать!
          </h4>
          </div>
          <textarea name="en_new_exp"/>
          <div onClick={selfun(param_limit_1, param_limit_2, param_limit_3, param_limit_4)}/>
          <p>Период обучения в неделях</p>
          <select type="text" name="en_training_periodn" value={param_limit_1} onChange={(event)=>{setParam_1_Limit(event.target.value)}}>
            <option value="0">0</option>
            <option value="18">18</option>
            <option value="36">36</option>
          </select>
          {fun()}
          <p>программа расчитана на { select_limit } часа(ов)</p>
          <p>Форма обучения</p>
          <Select
            components={{ Menu1 }}
            name='en_form_edu'
            isMulti
            options={en_form_data}
          />
          <p>Задачи предметные (каждая задача выдаёт содержательный модуль, расчитанный на 18 часов)</p>
          <Select
            value={select_list1}
            components={{ Menu }}
            name='en_subject_taskss'
            isMulti
            options={en_subject_tasks[value_1]}
            onChange={setSelect_list1}
          />
          {funalert()}
          <p>Задачи метапредметные (с часами)</p>
          <Select
            name='en_metasubject_tasks'
            isMulti
            options={en_meta_data}
          />
          <div onClick={check_select(select_list1)}/>
          <p>Задачи метапредметные (без часов)</p>
          <Select
            components={{ Menu1 }}
            name='en_metasubject_tasks_no'
            isMulti
            options={en_meta_data_no}
          />
          <p>Задачи личностные</p>
          {/* <Select
            name='en_personal_tasks'
            isMulti
            components={{ Menu1 }}
            options={get_personal_tasks()}
          /> */}
          <div>
            <p>Формы организации занятий</p>
            <h5>пример: групповые, индивидуальные, парные; круглые столы, практические занятия, лабораторные работы, экспериментальные и проектные площадки, открытые занятии, экскурсии и т. п. (не более 500 знаков)</h5>
          </div>
          <textarea name='en_form_education'/>
          <h2>Учебный план</h2>
          <p>Настройка таблицы происходит в документе</p>
          <h2>Комплекс организационно – педагогических условий</h2>
          <h3>Материально-техническое обеспечение</h3>
          <p>Общее оборудование</p>
          <Creatable
            name='cop_material_support_1'
            isMulti
            options={[
              {
                label: "компьютер",
                value: "компьютер"
              },
              {
                label: "проектор",
                value: "проектор"
              },
              {
                label: "флип-чарт",
                value: "флип-чарт"
              },
              {
                label: "доска",
                value: "доска"
              },
              {
                label: "звуковое оборудование (усилитель,микрофоны, наушники)",
                value: "звуковое оборудование (усилитель,микрофоны, наушники)"
              }
            ]}
          />
          <p>Специальное оборудование</p>
          <Creatable
            name='cop_material_support_2'
            isMulti
            options={get_equipment()}
          />
          <h3>Информационно-методическое обеспечение</h3>
          <p>Информационные ресурсы</p>
          <textarea name='cop_technical_support_1'/>
          <p>Методическое обеспечение</p>
          <textarea name='cop_technical_support_2'/>
          <div>
            <p>Формы представления результатов</p>
            <h5>(соревнования, сдача нормативов, участие в выставках, конкурсах, фестивалях, презентация проекта, отчетное занятие, отчетный концерт, спектакль и т.п).</h5>
          </div>
          <textarea name='cop_form_visual'/>
          <p>Формы контроля по отдельным разделам программы,  по итогам учебного года,  по итогам освоения программы (если программа более чем на один год).</p>
          <textarea name='cop_form_control'/>
          <div>
            <p>Оценочные материалы</p>
            <h5> это пакет диагностических методик, позволяющих определить достижение учащимися планируемых результатов. Это могут быть: контрольные нормативы, протокол и итоги соревнований, тест, психолого-педагогическая диагностика, диагностическая карта, протокол  конкурса.
            Оценочные материалы должны отслеживать и оценивать только те результаты, которые перечислены в разделе ожидаемые результаты.
            Для каждой программы разрабатываются свои, характерные для нее, параметры, критерии, оценочные материалы и диагностики. Оценочные материалы могут использоваться как готовые, разработанные другими авторами, так и разработанными самостоятельно. При использовании готовых методик обязательно указываются их авторы, даются ссылки на источники информации. Если автор программы самостоятельно разработал диагностические материалы, перечни и описания заданий помещаются в Приложении к программе. 
            </h5>
          </div>
          <textarea name='cop_materials_edu'/>
          <h2>СПИСОК ИСТОЧНИКОВ</h2>
          <p>Литература для детей (*необязательно для заполнения)</p>
          <textarea name='cop_list_sourse_2'/>
          <p>Литература для родителей (*необязательно для заполнения)</p>
          <textarea name='cop_list_sourse_3'/>
          <p>Литература для педагогов</p>
          <textarea name='cop_list_sourse_1'/>
          <label className='alertMessege'>Выдаваемый файл требует проверки и редактирования!</label>
        </div>
        <div className = "button">
          <input type="submit" id="hidden-button"/>
        </div>
      </form>
    </div>
  );
}

export default App;
