{
    "local_data": {
        
    },
    "global_data": {
        "metasubject_with_watch": {
            "Сформировать начальные умения в проектной деятельности": {
                "duration": 9,
                "module": "Основы проектной деятельности",
                "theory": "Что такое проект, его структурные элементы. Сроки и планирование работы над проектом. Представление проекта и его результатов.Интерфейс и правила создания презентации в программе PowerPoint. Защита проекта. Культура речи при защите проекта.",
                "practice": "Работа над проектом. Подготовка защиты под руководством педагога, составление текста. Создание презентации в программе PowerPoint для защиты проекта.",
                "result": "\n- знает, что такое проект, его структурные элементы;\n- соблюдает план и сроки выполнения проекта;\n- может сделать 6-8 слайдов к тексту защиты проекта;\n- может ответить на вопросы по сути созданного им проекта."
            },
            "Научить основам исследовательской деятельности": {
                "duration": 9,
                "module": "Основы исследовательской деятельности.",
                "theory": "Исследование и проект, отличия и сходства. Методы исследования. Эксперимент.Методы описания и представления результатов исследования. Диаграммы. Графики. Анализ результатов.",
                "practice": "Исследовательская работа. Составление описания и защиты исследования. Составление графиков, диаграмм.",
                "result": "\n- знает и умеет применять методы исследования;\n- может составить диаграмму, график;\n- может провести эксперимент в рамках своей темы;\n- может представить результаты исследования."
            }
        },
        "metasubject": {
            "Научить основам кооперации": {
                "duration": 9,
                "module": "",
                "theory": "",
                "practice": "",
                "result": "\n- умеют слушать и слышать друг друга;\n- принимает и выполняет возложенные обязанности, поручения при участии в разных формах групповой работы;\n- понимает свою ответственность за общий результат;\n- работает на результат, не смотря на межличностные отношения в группе."
            },
            "Развить коммуникативные навыки": {
                "duration": 9,
                "module": "",
                "theory": "",
                "practice": "",
                "result": "\n- общается с большинством обучающихся в группе;\n- проявляет уважение к другим обучающимся, к педагогу;\n- может вербализовать свои вопросы, пожелания, задает вопросы и просит помощи в затруднительных ситуциях;\n- способен делиться (материалами, инструментами, знаниями, и т.д.);\n- проявляет эмпатию по отношению к другим обучающимся в группе;"
            }
        },
        "provision": [
            "компьютер",
            "проектор",
            "флип-чарт",
            "доска",
            "звуковое оборудование (усилитель, микрофоны, наушники)"
        ]
    }
}