
# A very simple Flask Hello World app for you to get started with...

from flask import Flask, request, send_file, jsonify, redirect
from docxtpl import DocxTemplate
import json

# dict_person = json.load(open('dict_person.json', 'r'))
# dict_params = json.load(open('dict_params.json', 'r'))
# time_limit_dict = json.load(open('time_limit_dict.json', 'r'))
# result_dict = json.load(open('result_dict.json', 'r'))
# quest_data_dict = json.load(open('quest_data_dict.json', 'r'))
app = Flask(__name__)


# @app.route('/')
# def hello_world():
#     return 'Hello from Flask!'


@app.route('/get_programs_count')
def get_programs_count():
    with open("data_file.json", "r") as data_file_read:
        data = json.load(data_file_read)
    return data


@app.route('/constructor/get_mrt', methods=['GET', 'POST'])
def get_mrt():
    return send_file('Метод.рек.  Конструктор.docx')


@app.route('/constructor/test', methods=['GET', 'POST'])
def test():
    global dict_person, dict_params, time_limit_dict, result_dict, quest_data_dict
    try:
        with open("data_file.json", "r") as data_file_read:
            data = json.load(data_file_read)
        data["files_count"] += 1
        with open("data_file.json", "w") as data_file_write:
            json.dump(data, data_file_write)
        count = data["files_count"]
        dict_person = {
            'Способствовать формированию осознанного и ответственного поведения в области личных финансов':'- осознанное и ответственное отношение к собственным поступкам и ценностно-смысловым установкам в области финансов;\n- возникновение установки и осознанной привычки к анализу и оценке различной финансовой информации, финансовых решений разных людей, ценностно-смысловым предпочтениям в сфере финансов, в том числе в различных культурно-исторических контекстах;\n- осознание значения семьи в экономической жизни человека и общества\n- осознание личного (семейного) финансового планирования как важнейшего условия повышения личного и семейного благосостояния.',
            'Формировать у обучающихся финансовую культуру':'- владеют базовыми представлениями о товарно-денежных отношениях, \n- понимают необходимость бережного отношения к материальным вещам, ресурсам семьи (жилью, еде, одежде, воде, электричеству и др.), \n- понимают ограниченность денежных ресурсов семьи, школы, государства;\n- владеют базовыми представлениями в области финансовой безопасности;\n- будут осознавать необходимость ограничивать свои желания и выбирать товар или услугу в соответствии с реальными финансовыми возможностями.',
            "Сформировать устойчивую мотивацию к занятиям физической культурой и активному отдыху": "\n- с желанием принимает участие в активных видах досуга, в спортивных соревнованиях;\n- любит подвижные игры;\n- проявляет инициативу в организации активного отдыха ",
            "Мотивировать к ведению здорового образа жизни": "\n- знает влияние вредных привычек на физическое и психическое здоровье;\n- соблюдает режим дня;\n- соблюдает гигиену тренировок;\n- предпочитает активный отдых",
            "Сформировать ценностное отношение к своему здоровью": "\n- одевается на тренировки в соответствии с погодными условиями;\n- контролирует свое физическое состояние по первичным показателям (пульс, дыхание, сердцебиение), разумно распределяет нагрузку на тренировке;\n- соблюдает режим дня;\n- соблюдает гигиену тренировок;\n- живет по принципу движение - это жизнь.",
            "Сформировать ценностное отношение к своему здоровью ": "\n- ставит общественные интересы выше личных;\n- оказывает помощь в условиях похода тем, кто физически слабее;\n- принимает решения исходя из условий безопасности, а не личного желания;\n- может принять на себя нежелательные роли, функции, способствующие достижению общего результата",
            "Воспитывать культуру поведения": "\n- знает и соблюдает правила поведения, в том числе в театре, и других общественных местах;\n- проявляет зрительскую культуру;\n- уважительно относится к старшим;\n- грамотно выражает свои мысли;\n- понимает уместность того или иного поведения, в зависимости от того в каком месте общественном он находится. ",
            "Способствовать освоению социальных норм, правил поведения": "\n- следует общепринятым правилам и нормам поведения; \n- осознанно и ответственно относятся к собственным поступкам;",
            "Формировать навыки поведения и совместной деятельности в творческом коллективе": "\n- проявляет эмпатию, готовность вести диалог с другими людьми и достигать в нем взаимопонимания;\n- демонстрирует адекватную самооценку в рамках профиля деятельности.",
            "Воспитывать уважительное отношение между членами коллектива": "\n- демонстрирует умение работать в паре и в команде;\n- способен к сотрудничеству, конструктивному взаимодействию с другими членами коллектива и взрослыми в совместной творческой работе;\n- может открыто выражать своё эмоциональное состояние, при этом проявляя уважение к чувствам других; \n- проявляет доброжелательное и терпеливое отношение к другим членам коллектива.",
            "Воспитывать культуру общения": "\n- грамотная речь, отсутствие в речи ненормативной лексики;\n- уважительное отношение к людям другой национальности, культуры;\n- соблюдает общепринятые нормы поведения, нравственные нормы;\n- проявляет нетерпимость в отношении хамства, нецензурной брани.",
            "Формировать ценностное отношение к социально-значимой деятельности": "\n- инициирует, принимает участие в общественно-значимых мероприятиях;\n- участвует в волонтерском движении;\n- выбирает репертуар с точки зрения социальной значимости;\n- проявляет участие не только эмоционально, но и помогает делом тем, кто находится в сложной социальной и другой ситуации.",
            "Задача	Приобщить к физической культуре и здоровому образу жизни": "\n- с желанием принимает участие в активных видах досуга,"
                                                                                " в спортивных соревнованиях;"
                                                                                "\n- редко болеет;"
                                                                                "\n- проявляет инициативу в организации активного отдыха",
            "Сформировать стремление к здоровому образу жизни, отвращение к вредным привычкам": "\n- не имеет вредных привычек;"
                                                                                                "\n- соблюдает режим дня;"
                                                                                                "\n- соблюдает гигиену тренировок;"
                                                                                                "\n- предпочитает активный отдых",
            "Способствовать формированию осознанного и бережного отношения к природе": "\n- понимает важность сохранения природы;"
                                                                                    "\n- осознанно относится к природе, зря не вредит"
                                                                                    " растениям, а только в случае крайней необходимости;"
                                                                                    "\n- убирает за собой мусор в условиях природы, похода, улицы;"
                                                                                    "\n- правильно утилизирует мусор в условиях похода;"
                                                                                    "\n- спокойно ведет себя в лесу, старается не навредить его обитателям.",
            "Мотивировать к самостоятельной общественно-значимой деятельности": "\n- старается привести в порядок место стоянки;"
                                                                                "\n- инициирует различные природоохранные мероприятия;"
                                                                                "\n- принимает участие в природоохранных акциях, конкурсах;",
            "Способствовать формированию уважительного отношения к малой Родине": "\n- имеет представление об уникальности флоры\фауны своего края;"
                                                                "\n- знает историю края, значимых для истории края личностей и их вклад в развитие региона;"
                                                                "\n- уважительно отзывается о том месте, в котором живет;"
                                                                "\n- стремиться внести свой вклад в развитие своего класса, школы, двора, поселка\села;"
                                                                "\n- бережно относится к природным, архитектурным, историческим местам, памятникам;"
                                                                "\n- знает и уважительно относится к символике края."
        }
        dict_params = {
            "tech": "Техническая",
            "sci": "Естественнонаучная",
            "art": "Художественная",
            "adv": "Туристско-краеведческая",
            "sport": "Физкультурно-спортивный",
            "soc": "Социально-гуманитарное",
            "baseadv": "Основы туризма",
            "lendadv": "Краеведение",
            "schooldanger": "школа безопасности"
        }
        time_limit_dict = {
            'Сформировать представление о технологии дополненной и виртуальной реальности.': 18,
            'Научить основам 3D-моделирования.': 18,
            'Сформировать ключевые компетенции в разработке дополненной реальности': 18,
            'Совершенствовать ключевые компетенции в разработки виртуальной реальности': 18,
            'Сформировать навык разработки проектов VR/AR': 18,

            'Сформировать представление о семейном бюджете и основах его планирования':18,

            'Сформировать представление о роли банков в финансовом благополучии человека':18,

            'Сформировать знания в области налогообложения и социальных выплат для физических лиц':18,

            'Сформировать знания по основам финансовой безопасности':18,

            'Сформировать интерес к 3D моделированию.': 18,
            'Научить основам 3D моделирования.': 18,
            'Сформировать базовые знания и умения в трехмерной графике.': 18,
            'Сформировать начальные умения в трехмерной печати.': 18,
            "Сформировать интерес  к робототехнике": 18,
            "Научить основам алгоритмизации  и программирования робототехнических устройств": 18,
            "Сформировать навык разработки робототехнических проектов": 18,
            "Совершенствовать ключевые компетенции  по созданию робототехнических проектов": 18,
            "Сформировать интерес к робототехнике": 18,
            "Научить основам алгоритмизации и программирования робототехнических устройств": 18,
            "Научить проектировать и создавать робототехнические устройства": 18,
            "Совершенствовать ключевые компетенции по созданию робототехнических проектов": 18,
            "Изучить основы музейного дела": 18,
            "Познакомить с правилами комплектования и работы с музейными фондами": 18,
            "Научить основам экскурсионной работы": 18,
            "Организовать исследовательскую деятельность в школьном музее": 18,
            "Сформировать интерес к программированию.": 18,
            "Научить основам программирования на Python.": 18,
            "Сформировать навык разработки проектов на  Python": 18,
            "Совершенствовать ключевые компетенции   программирования на Python": 18,
            "Сформировать общее представление о журналистике и особенностях профессии «журналист»": 18,
            "Познакомить с направлением журналистики «периодическая печать»": 18,
            "Научить основам фотожурналистики": 18,
            "Научить основам тележурналистики": 18,
            "Научить основам операторского мастерства и видеомонтажа": 18,
            "Научить основам радиожурналистики": 18,
            "Познакомить с формами интернет-журналистики": 18,
            "Познакомить с основами организации работы медиацентра в школе": 18,
            "Сформировать интерес к программированию":18,
            "Совершенствовать ключевые компетенции программирования в Scratch":18,
            "Научить основам алгоритмизации  и языка программирования Scratch":18,
            "Сформировать навык разработки проектов в среде Scratch":18,
            'Научить основам пилотирования БПЛА': 18,
            'Научить основам FPV пилотирования и обслуживания БПЛА на практике': 18,
            'Научить основам аэрофотосъёмки и фотограмметрии': 18,
            'Научить основам автономного пилотирования БПЛА': 18,
            'Развивать навык  пилотирования  и эксплуатации БПЛА': 18,
            'Сформировать общее представление о театре': 18,
            'Научить основам актерского мастерства': 18,
            'Научить практическим навыкам сценической речи и работы с художественным текстом': 18,
            'Обучить основам сценического движения': 18,
            'Сформировать навыки театрально-исполнительской деятельности': 18,
            'Научить основам сценографии': 18,
            'Научить основам кукловождения и способам изготовления кукол': 18,
            'Вовлечь в социально-значимую деятельность': 18,
            'Научить основам вольной борьбы': 18,
            'Способствовать развитию общей физической подготовки': 18,
            'Обучить основам специальной физической подготовки': 18,
            'Обучить навыкам техники и тактики ведения схватки на соревнованиях': 18,
            'Познакомить учащихся с видом спорта «Баскетбол», правилами'
            ' игры, техникой, тактикой, правилами судейства и организацией проведения'
            ' соревнований, мерами безопасности на занятиях': 18,
            'Способствовать развитию физических качеств, необходимых для успешной игры в баскетбол': 18,
            'Познакомить с техническими и тактическими приемами баскетбола': 18,
            'Способствовать формированию соревновательного опыта': 18,
            'Обучить необходимым понятиям и теоретическим сведениям по физической культуре и спорту': 18,
            'Развивать основные физические качества': 18,
            'Развивать физические качества, специальные двигательные навыки': 18,
            'Повысить техническую подготовленность в данном виде спорта': 18,
            'Познакомить с терминами, общими понятиями, техникой безопасности,'
            ' историей, основными направлениями и техниками киокусинкай': 18,
            'Способствовать развитию общей физической подготовки (ОФП)': 18,
            'Научить основам специальной физической подготовки (СФП).': 18,
            'Научить базовым техникам киокусинкай.': 18,
            'Изучить историю Хабаровского края': 18,
            'Познакомить с этнографией коренных малых народов севера, проживающих в Хабаровском крае': 18,
            'Познакомить с флорой и фауной Хабаровского края': 18,
            'Изучить географию Хабаровского края': 18,
            'Научить основам туристской подготовки': 18,
            'Научить основам гигиены и первой доврачебной помощи': 18,
            'Научить основам топографии и ориентирования': 18,
            'Научить основам краеведения': 18,
            'Научить основам безопасности жизнедеятельности': 18,
            'Научить правильному поведению в чрезвычайных ситуациях': 18,
            'Сформировать первичные умения по оказанию первой доврачебной помощи': 18,
            'Научить основам пожарно-прикладного и спасательного спорта (ППС)': 18,
            'Сформировать начальные умения в проектной деятельности': 9,
            'Научить основам исследовательской деятельности': 9,
        }
        result_dict = {
            'Сформировать представление о технологии дополненной и виртуальной реальности.': "- умеют создавать презентации;\n- знают правила поведения в компьютерном классе, основные правила техники безопасности и гигиены при работе на ПК;\n- знает и может объяснить, что такое виртуальная реальность;\n- имеет навык калибровки межзрачкового расстояния шлема виртуальной реальности;\n-осмысленно следуют инструкциям. ",
            'Научить основам 3D-моделирования.': "- знают основные понятия трехмерного моделирования;\n- умеют создавать 3D-модели с помощью объектного и полигонального 3D-моделирования;\n-смогут самостоятельно искать и обрабатывать информацию, в том числе в сети интернет;\n- умеют эффективно использовать инструменты программы, пользоваться горячими клавишами;\n- разовьют познавательный интерес, внимание, память;\n- разовьют коммуникативные навыки, умение взаимодействовать в группе.",
            'Сформировать ключевые компетенции в разработке дополненной реальности': "- владеет основными понятиями изучаемой области: дополненная реальность, смешанная реальность, оптический трекинг; маркерная и безмаркерная технологии, реперные точки и т.д.\n-знает устройство работы пользовательского интерфейса профильного ПО, базовых объектов инструментария;\n- умеет активировать запуск приложений дополненной реальности на AR очках, устанавливать их на устройство и тестировать;  \n-умеет создавать несложные AR-приложения.",
            'Совершенствовать ключевые компетенции в разработки виртуальной реальности': "-знает сходства, различия, возможности различных VR устройств;\n- умеет снимать и монтировать видео 360;\n- умеет строить трехмерные модели объектов;\n-умеет создавать несложные VR приложения; \n-имеют опыт участия в соревнованиях по разработке VR/AR краевого/всероссийского уровня.",
            'Сформировать навык разработки проектов VR/AR': "- знает особенности работы в различных средах разработки;\n-владеет навыками работы со средами разработки;\n-владеет навыками работы с различными техническими VR/AR-устройствами;\n-знают принципы организации проектной деятельности (составление планов работ, создание схем взаимодействия объектов, разбиение задач на подзадачи, распределение ролей объектов и т.д.);\n-умеют составлять план проекта;\n- получат навыки ведения проектной деятельности;\n- будут уметь работать в группе, в паре над совместным проектом;\n-умеют планировать свои действия с учётом фактора времени;\n-имеют опыт участия в соревнованиях по разработке VR/AR краевого/всероссийского уровня;\n-умеют публично презентовать результат своей работы.",

            'Сформировать представление о семейном бюджете и основах его планирования':'- будут иметь представление о роли денег в жизни общества и семьи;\n- будут владеть финансовыми терминами;\n- будут разбираться в источниках доходов и расходов;\n- будут понимать суть и инструменты планирования семейного и личного бюджета;\n- будут иметь представление о различных видах личных доходов и способах их повышения, предлагать варианты собственного заработка;\n- смогут применить не менее одного современного инструмента контроля и планирования личного бюджета.',

            'Сформировать представление о роли банков в финансовом благополучии человека':'- будут иметь представление о банковской системе; \n- будут понимать права и обязанности в сфере финансов;\n- будут знать основные виды финансовых услуг и продуктов, предназначенных для физических лиц, правила взаимодействия с кредитными организациями; \n- будут уметь давать собственную оценку рискам по банковским вкладам;\n- будут понимать плюсы и минусы, риски при использовании кредитных продуктов;\n- научатся анализировать и сравнивать условия по кредиту в различных банках;\n- будут знать права и обязанности кредитополучателя;\n- будут знать правила пользования банкоматами, мобильными банками, онлайн-банками.',

            'Сформировать знания в области налогообложения и социальных выплат для физических лиц':'- будут знать виды налогов, историю налогообложения, принципы;\n- будут знать виды налоговых вычетов и условия их получения;\n- будут знать виды социальных выплат в РФ и ХК, условия их получения;\n- смогут произвести расчёт налога и налогового вычета по заданным условиям.',

            'Сформировать знания по основам финансовой безопасности':'- будут понимать, какие существуют риски потери денег, и необходимость обеспечения финансовой безопасности разными средствами;\n- будут знать и применять правила поведения при телефонной «атаке» мошенников;\n- будут знать виды страхования, основные задачи и принципы страхования, виды страховых продуктов и условия страховых выплат в случае наступления страхового случая;\n- будут уметь выбирать страховые продукты и страховые компании.',

            'Сформировать интерес к 3D моделированию.': '- знают правила поведения в компьютерном классе, основные правила техники безопасности и гигиены при работе с 3D ручкой;\n- знают принципы работы с 3D ручкой;\n- знают способы и приемы моделирования;\n- знают закономерности симметрии и равновесия;\n- умеют создавать эскизы, шаблоны для моделирования;\n- умеют создавать трехмерные изделия реального объекта различной сложности и композиции из пластика;\n- умеют пользоваться измерительными приборами;\n- осмысленно следуют инструкциям.',

            'Научить основам 3D моделирования.': '- знают основные понятия трехмерного моделирования;\n- умеют создавать виртуальные 3D-объекты в программе Tinkercad;\n- умеют эффективно использовать инструменты программы, пользоваться горячими клавишами;',

            'Сформировать базовые знания и умения в трехмерной графике.': '-знают основы трехмерной графики;\n- знают основные элементы, инструменты и операции для работы в on-line-средах 3D-моделирование;\n- смогут самостоятельно искать и обрабатывать информацию, в том числе в сети интернет.',

            'Сформировать начальные умения в трехмерной печати.': '- знают, как устроен 3D-принтер;\n- знают, что такое gcode и как его создавать;\n-умеют создавать элементы для печати на 3D-принтере;\n-имеют опыт участия в соревнованиях и олимпиадах по 3D моделированию и прототипированию муниципальных/краевых/всероссийских уровней.',

            "Сформировать интерес к программированию.": '\n- знают правила поведения в компьютерном классе, основные правила техники безопасности и гигиены при работе на ПК;\n- умеют писать на языке Python простейшие программы, связанные с числовыми и символьными данными;\n- умеют работать с вычислительной техникой;\n-осмысленно следуют инструкциям.',

            "Научить основам программирования на Python.": '\n- имеют уверенного пользователя ПК;\n- знают синтаксис языка программирования Python;\n- знают базовые конструкции языка Python и основные принципы создания программ на компьютере;\n- знают, как создавать и использовать блок-схемы;\n- умеют составлять блок-схемы задач;\n- умею разбивать решение задачи на подзадачи, то есть составлять алгоритм;\n- умеют организовывать учебное сотрудничество совместную деятельность с учителем и сверстниками',

            "Сформировать навык разработки проектов на  Python": "\n- знают правила самостоятельного разбора и решение задач программирования;\n- умеют решать задачи;\n- знают терминологию программирования;\n- знают основные, базовые алгоритмические конструкции  и могут их применять;\n-знают принципы, получат навыки создания проектов в Python. (составление планов работ, создание схем взаимодействия объектов, разбиение задач на подзадачи, распределение ролей объектов и т.д.);\n-знают основные структуры данных и типовые методы обработки этих структур;\n- умеют искать и обрабатывать ошибки в коде;\n-умеют составлять план проекта;\n- смогут самостоятельно искать и обрабатывать информацию, в том числе в сети интернет для решения задач программирования;\n- будут уметь работать в группе, в паре над совместным проектом;\n-умеют публично презентовать результат своей работы.",

            "Совершенствовать ключевые компетенции   программирования на Python": "\n- знают принципы и методы функционального и объектно-ориентированного программирования;\n- владеют навыками разработки эффективных алгоритмов и программ; \n- сформируют логическое и алгоритмическое мышление;\n-умеют планировать свои действия с учётом фактора времени;\n-умеют работать в команде; \n-уметь анализировать как свой, так и чужой код;\n-имеют опыт участия в соревнованиях по программированию краевого/всероссийского уровня.",

            "Изучить основы музейного дела": "\n- владеют основными понятиями музееведения;\n- знают классификацию музеев, содержание деятельности в зависимости от типа;\n- знают, что такое экспозиция и принципы ее построения;\n- знают экспозиции своего школьного музея;\n- могут подобрать материал для мини- экспозиции на заданную тему\n- находить и обрабатывать информацию",

            "Познакомить с правилами комплектования и работы с музейными фондами": "\n- знают, что такое фонды музея и их классификацию;\n- принимают участие в сборе экспонатов на выезде;\n- знают правила определения музейной ценности предмета;\n- могут описать, оформлять и вести учет экспонатов;\n- знают принципы систематизации предметов, могут систематизировать материалы школьного музея;\n- могут сканировать и обрабатывать фотографии в специальных программах (на выбор)",

            "Научить основам экскурсионной работы": "\n- имеют представление о профессии и роде деятельности экскурсовода;\n- знают правила разработки экскурсии;\n- могут составить маршрут тематической экскурсии по достопримечательностям своего города\села\поселка;\n- могут составить текст и провести экскурсию по школьному музею по готовым экспозициям;\n- могут оформить экскурсию на конкурс.",

            "Организовать исследовательскую деятельность в школьном музее": "\n- знают формы и методы исследовательской краеведческой деятельности;\n- знают компоненты исследовательского проекта, могут оформить его на конкурс с помощью педагога;\n- знают технику поиска информации о музейном экспонате и могут ее собрать и проанализировать.",

            "Сформировать интерес к программированию": "\n- знают правила поведения в компьютерном классе, основные правила техники безопасности и гигиены при работе на ПК; \n- умеют работать с клавиатурой и мышью;\n- умеют работать с папками, ярлыками и файлами;\n- соблюдают правила техники безопасности при работе с компьютером;\n-осмысленно следуют инструкциям;\n- знают интерфейс среды программирования Scratch;\n- умеют создавать элементарные программы-скрипты, используя среду программирования Scratch (на основе образца).",

            "Научить основам алгоритмизации  и языка программирования Scratch": "\n- знают правила техники безопасности;\n- соблюдают правила техники безопасности;\n- умеют работать с основными инструментами персонального компьютера;\n-знают основы визуальных языков программирования;\n- знают среду Scratch и основные принципы создания программ на компьютере;\n- знают, как создавать и использовать блок-схемы;\n- умеют составлять блок-схемы задач;\n- знают принципы организации проектной деятельности (составление планов работ, создание схем взаимодействия объектов, разбиение задач на подзадачи, распределение ролей объектов и т.д.);\n-умеют составлять план проекта;\n-умеют публично презентовать результат своей работы;\n- умеют организовывать учебное сотрудничество совместную деятельность с учителем и сверстниками;\n- формирование и развитие компетентности в области использования информационно-коммуникационных технологий.",

            "Сформировать навык разработки проектов в среде Scratch": "\n- знают правила самостоятельного разбора и решение задач программирования;\n- знают терминологию программирования;\n- знают основные, базовые алгоритмические конструкции «цикл», «цикл с условием», «повторяющееся действие» и смогут их применить;\n- научатся создавать проекты разного уровня сложности в среде программирования Scratch.\n- получат навыки ведения проектной деятельности;\n- смогут самостоятельно искать и обрабатывать информацию, в том числе в сети интернет;\n- будут уметь работать в группе, в паре над совместным проектом; \n- может создавать интерактивные игры, обучающие программы, мультфильмы, и интерактивные презентации",

            "Совершенствовать ключевые компетенции программирования в Scratch": "\n- владеют навыками работы в среде Scratch и создания в ней программ; \n- умеют анализировать результаты проекта и на основе выводов находить и исправлять ошибки и намечать пути его развития;\n- умеют готовить отчеты и публично их презентовать;\n- знают правила техники безопасности;\n- соблюдают правила техники безопасности на учебно- тренировочных занятиях;\n-умеют работать в команде; \n-имеют опыт участия в соревнованиях по Scratch краевого/всероссийского уровня.",

            "Сформировать общее представление о журналистике и особенностях профессии «журналист»": "\n- получат представление о работе средств массовой информации;\n- понимают суть деятельности журналиста;\n- познакомятся с ключевыми понятиями и жанрами;\n- будут знать специфику работы журналиста в разных отделах СМИ;\n- понимают суть деятельности в разных профессиях в сфере медиа;\n- будут знать основы профессиональной культуры и этики журналиста;\n- определят и проанализируют свои профессиональные наклонности в сфере журналистики.",

            "Познакомить с направлением журналистики «периодическая печать»": "\n- будут знать жанры печатной журналистики и смогут создавать тексты в некоторых из них;\n- знают правила и умеют вести соцопрос, брать интервью;\n- понимают роль заголовка статьи;\n- научатся собирать и обрабатывать информацию; \n- будут знать программное обеспечение для верстки газеты.",

            "Научить основам фотожурналистики": "\n- будут знать специфику фотожурналистики;\n- будут уметь работать с профессиональным фотоаппаратом и видеокамерой мобильного телефона;\n- будут знать приемы фотосъемки в различных внешних условиях;\n- будут знать основы работы в различных фоторедакторах и смогут сделать обработку фотоматериалов в программах Adobe Photoshop, Adobe Lightroom;\n- смогут сделать анализ готовых фоторабот.",

            "Научить основам тележурналистики": "\n- будут знать виды сюжетов;\n- будут знать механизм подготовки телевизионного сюжета;\n- научатся писать сценарный план сюжета и текста, выстраивать сюжет в соответствии со сценарием;\n- смогут подобрать тему музыкального сопровождения;\n- научатся писать «подводки» ведущего к видеосюжетам;\n- смогут провести телерепортаж с места события;\n- смогут подготовить и взять интервью.",

            "Научить основам операторского мастерства и видеомонтажа": "\n- будут знать правила видеосъемки;\n- могут снимать видео разными видами камер;\n- будут отличать типы форматов видео (mp4, avi, mkv, mov, mpeg);\n- будут знать правила работы в программах по обработке видеофайлов;\n- смогут провести монтаж видео в одной из них;",

            "Научить основам радиожурналистики": "\n-  имеют представление о жанрах радиожурналистики;\n- понимают специфику работы радиоредакции и журналиста на радио;\n- будут знать принципы построения информационного сообщения на радио, характерные черты информации, распространяемой по радио;\n- будут знать принципы построения радиоэфира;\n- смогут подготовить новостное сообщение/адаптировать для радиоэфира;	\n- будут знать правила эксплуатации профессионального оборудования и компьютерной техники;\n- приобретут навыки работы в профессиональных программах Adobe Audition; ",

            "Познакомить с формами интернет-журналистики": "\n- будут знать формы интернет-журналистики и их специфику;\n- смогут составить и провести соцопрос через различные интернет-инструменты;\n- смогут вести контент в социальных сетях;\n- смогут создать и вестиTelegram-канал; \n- знают принципы работы чат-бота;",

            "Познакомить с основами организации работы медиацентра в школе": "\n- умеют планировать и координировать работу по созданию\разработке контент-плана\медиапроекта;\n- критически работают с интернетом, как источником информации; \n- знают и применяют правила размещения и продвижения информации в социальных сетях;\n- знают правила грамотного оформления контента и создания медиа-проектов;\n- могут работать с общественностью, составлять контент на разные целевые аудитории",

            'Сформировать общее представление о театре': '\n- будут знать особенности театра как вида искусства; \n- будут знать элементарные понятия и профессиональную терминологию театрального искусства;\n- будут знать правила поведения в театре (на сцене, в зрительном зале); \n- будет сформирован интерес к театральной деятельности;\n- будут знать основные театральные профессии.',

            'Научить основам актерского мастерства': '\n- будут знать составляющие компоненты актерского мастерства;\n- будут владеть приемами актерской выразительности;\n- приобретут опыт творческой деятельности (исполнительского мастерства);\n- смогут передать характер роли, героя пьесы; \n- будут знать правила при работе с партнером;\n- будут знать базовые упражнения для развития актерских способностей.',

            'Научить практическим навыкам сценической речи и работы с художественным текстом': '\n- будут уметь использовать речевое дыхание, правильной артикулировать,\n- выработают правильную дикцию, \n- будут знать и выполнять артикуляционные упражнения;\n- смогут применить техники самостоятельной подготовки психофизического аппарата к сценическому действию;\n- смогут грамотно использовать интонации, выражающие основные чувства в жизни и в роли;\n- научатся владеть голосом, речью для отражения своего мировосприятия, передавать характер персонажа голосом и действием; \n- будут выразительно декламировать литературные произведения;\n- смогут придумывать сюжет, сочинять небольшие рассказы, подбирать рифмы; \n- будут знать правила разбора прозаического и поэтического текста;\n- приобретут умения последовательной работы с художественным текстом,\n- приобретут опыт публичных выступлений.',

            'Обучить основам сценического движения': '\n- будут знать законы сценического действия; \n- смогут выполнять этюды на заданную тему, упражнения на память физических действий, задания на действие в предлагаемых обстоятельствах;\n- научатся создавать и «оживлять» образы предметов и живых существ, передавать образы с помощью вербальных и невербальных выразительных средств; \n- смогут изобразить действие с воображаемыми предметами;\n- научатся двигаться в заданном ритме;\n- смогут ориентироваться в сценическом пространстве, чувствовать себя на сцене свободно, действовать на сценической площадке естественно;- будут уметь взаимодействовать с партнерами на сценической площадке.',

            'Сформировать навыки театрально-исполнительской деятельности': '\n- будут знать элементарные законы режиссуры («сквозное действие», «монтировка спектакля», «аллегория», «метафора», «гипербола», «сверхзадача», «словесное действие», «факты жизни», «пластический образ»);\n- будут владеть логикой и последовательностью в сценическом действии;\n- смогут определять сквозное действие роли;\n- будут уметь раскладывать сквозное действие на простые физические действия;\n- приобретут навыки сценического воплощения через процесс создания сценического образа.',

            'Научить основам сценографии': '\n- знают, что такое сценография, декорации, их роль в воплощении идеи театральной постановки;\n- знают особенности сценического костюма, соответствующего театральной постановке;\n- знают приемы сценического поведения при использовании различных костюмов;\n- умеют изготавливать и подбирать элементы театральных костюмов, реквизита и декораций;\n- знают разные техники нанесения и виды грима разнохарактерных персонажей;\n- умеют выбрать соответствующий музыкальный материал для оформления театральной постановки.',

            'Научить основам кукловождения и способам изготовления кукол': '\n- будут знать историю возникновения и развития театра кукол; \n- будут владеть техниками управления куклой различных… систем;\n- будут уметь самостоятельно подбирать, выучивать и обыгрывать роль с театральной куклой, говорить за нее с нужной интонацией;\n- будут знать приемы работы с ширмой;\n- научатся самостоятельно изготавливать театральных кукол из разных материалов, предметы бутафории и декораций для спектакля разной сложности.',

            'Вовлечь в социально-значимую деятельность': "\n- смогут принимать участие в волонтерских социально-значимых мероприятиях различного уровня;\n- приобретут навыки организаторской деятельности;\n- будут уметь планировать социально-значимую деятельность за пределами школы.",

            'Научить основам вольной борьбы': "\n- знают историю возникновения вольной борьбы;"
                                            "\n- имеют представления о правилах и премах;"
                                            "\n- знают правила техники безопасности во время занятий; "
                                            "\n- знают элементы формы;"
                                            "\n- соблюдают гигиену спортсмена;"
                                            "\n- мотивированы на здоровый образ жизни.",

            'Способствовать развитию общей физической подготовки': "\n- будут знать специфические термин ОФП вольной"
                                                                " борьбы;"
                                                                "\n- будут выполнять контрольные нормативы по "
                                                                "общей физической подготовке согласно возрасту;"
                                                                "\n- будут выполнять разминку; упражнения на развитие"
                                                                " гибкости и выносливости самостоятельно;"
                                                                "\n- овладеют начальными навыками применения"
                                                                " приемов вольной борьбы;"
                                                                "\n- учащиеся самостоятельно будут выполнять"
                                                                " упражнения для развития опорно-двигательного"
                                                                " аппарата.",

            'Обучить основам специальной физической подготовки': "\n- будут знать специфические термин СФП вольной борьбы; "
                                                                "\n- будут знать основные виды стоек и схваток единоборств;"
                                                                "\n- будут выполнять контрольные нормативы по СФП;"
                                                                "\n- будут выполнять упражнения на развитие гибкости"
                                                                " и выносливости самостоятельно;"
                                                                "\n- овладеют начальными приемами вольной борьбы;"
                                                                "\n- приобретут опыт участия в схватках внутри объединения;"
                                                                "\n- будут придерживаться безопасного поведения в схватках.",

            'Обучить навыкам техники и тактики ведения схватки на соревнованиях': "\n- Знают технику безопасности во время"
                                                                                " тренировки, схваток и соревнований;"
                                                                                "\n- знают и выполняют основные виды"
                                                                                " стоек и схваток единоборств;"
                                                                                "\n- основные правила проведения"
                                                                                " соревнований;"
                                                                                "\n- выполняют запланированные"
                                                                                " тренировочные и соревновательные"
                                                                                " нагрузки;"
                                                                                "\n- взаимодействуют со сверстниками"
                                                                                " в образовательной"
                                                                                " и игровой деятельности;"
                                                                                "\n- владеют умениями и навыками"
                                                                                " волевой саморегуляции"
                                                                                " (самоконтроль, концентрировать"
                                                                                " внимание на исполнении движения"
                                                                                " (упражнения, приемы) и запоминать"
                                                                                " правила борьбы, запоминать движения"
                                                                                " (упражнения, приемы), будут выполнять"
                                                                                " задания до достижения результата).",


            'Познакомить учащихся с видом спорта «Баскетбол», правилами'
            ' игры, техникой, тактикой, правилами судейства и организацией проведения'
            ' соревнований, мерами безопасности на занятиях': "\n- Знают историю развития вида спорта «баскетбол»"
                                                            " в школе, городе, стране;"
                                                            "\n- Знают правила игры в баскетбол;"
                                                            "\n- понимают зависимость работы сердечно-сосудистой"
                                                            " системы, от физических нагрузок во время игры; "
                                                            "\n- Знают разметку баскетбольной площадки; "
                                                            "\n- Знают основные правила игры в баскетбол, нарушения,"
                                                            " жесты судей; "
                                                            "\n- Знают гигиенические требования к одежде и обуви для"
                                                            " занятий физическими упражнениями; "
                                                            "\n- Знают способы подсчета пульса, способы регулирования"
                                                            " и контроля физических нагрузок во время занятий"
                                                            " физическими упражнениями.",

            'Способствовать развитию физических качеств,'
            ' необходимых для успешной игры в баскетбол': "\n- знают основные технические приемы баскетболиста;"
                                                        "\n- могут провести разминку баскетболиста,"
                                                        " организовать проведение подвижных игр;"
                                                        "\n- повысится выносливость обучающихся;"
                                                        "\n- улучшится общая и специальная физическая подготовка.",

            'Познакомить с техническими и тактическими'
            ' приемами баскетбола': "\n- Знают тактические приемы в баскетболе;"
                                    "\n- Умеют выполнять передачу мяча одной рукой снизу. Передачу мяча одной рукой сбоку;"
                                    "\n- Выполняют приемы обыгрывания защитника: вышагивание, скрестный шаг, поворот,"
                                    " перевод мяча перед собой."
                                    "броски одной и двумя руками в прыжке. Броски мяча после двух шагов"
                                    " и в прыжке с близкого расстояния и среднего. Броски мяча в корзину со"
                                    " средних и дальних дистанций одной и двумя руками от головы."
                                    " Штрафной бросок одной и двумя руками от головы."
                                    "вырывание и выбивание. Перехват. Накрывание."
                                    "применять в игре командное нападение. "
                                    "\nВзаимодействуют с заслоном, а также применяют индивидуальные, "
                                    "групповые и командные действия в защите в игре баскетбол.",

            'Способствовать формированию соревновательного опыта': "\n- участвовал не менее чем 5 соревнований;"
                                                                "\n- приобретен соревновательный опыт;"
                                                                "\n- повышена самооценка учащегося как баскетболиста;"
                                                                "\n- повышена устойчивость к стрессам, связанной с"
                                                                " участием в соревнованиях;"
                                                                "\n- объединение и повышение командного духа учащихся.",


            'Обучить необходимым понятиям и теоретическим сведениям по'
            ' физической культуре и спорту': "\n- знают терминологию, применяемую в данном виде спорта; "
                                            "\n- знают основные правила по легкой атлетики;"
                                            "\n- умеют работать индивидуально и в команде во время занятий,"
                                            " соревновательной деятельности; "
                                            "\n- будут соблюдать правила поведения и техники безопасности во время занятий."
                                            "\n- знают разновидность ходьбы, поворотов, упражнения на осанку, технику бега.",

            'Развивать основные физические качества': "\n- знают значение физических упражнений в жизни человека;"
                                                    "\n- знают правила техники безопасности на"
                                                    " учебно-тренировочных занятиях;"
                                                    "\n- соблюдают правила техники безопасности на"
                                                    " учебно-тренировочных занятиях;"
                                                    "\n- выполняют подводящие и специальные упражнения бегуна;"
                                                    "\n- выполняют общие развивающие упражнения; "
                                                    "\n- выполняют технику бега по прямой, повороту,"
                                                    " стартовый разгон, бег по дистанции.",

            'Развивать физические качества,'
            ' специальные двигательные навыки': "\n- понимают и знают значение физических упражнений в жизни человека;"
                                                "\n- знают правила техники безопасности на учебно-тренировочных занятиях;"
                                                "\n- знают правила поведения на старте, прохождения дистанции;"
                                                "\n- умеют правильно выполнять команды на старте;"
                                                "\n- соблюдают правила техники безопасности на "
                                                "учебно-тренировочных занятиях;"
                                                "\n- выполняют прыжки в длину, с разбега, с места,"
                                                " через гимнастические скамейки и т.д.",

            'Повысить техническую подготовленность'
            ' в данном виде спорта': "\n- знают значение физических упражнений в жизни человека;"
                                    "\n- знают правила техники безопасности на учебно-тренировочных занятиях;"
                                    "\n- знают и понимают результаты выступлений российских "
                                    "легкоатлетов на соревнованиях различного уровня;"
                                    "\n- знают и выполняют задачи и порядок прохождения медицинского контроля;"
                                    "\n- знают технику прыжков и метания предмета;"
                                    "\n- знают и выполняют правила поведения на старте, прохождения дистанции."
                                    "\n- умеют правильно выполнять команды на старте;"
                                    "\n- соблюдают правила техники безопасности на учебно-тренировочных занятиях;"
                                    "\n- выполняют подводящие и специальные упражнения бегуна;"
                                    "\n- участвуют в соревновании.",


            'Познакомить с терминами, общими понятиями, техникой безопасности,'
            ' историей, основными направлениями и техниками киокусинкай': "\n- Знают правила поведения и технику "
                                                                        "безопасности на занятиях каратэ;"
                                                                        "\n- знают названия и устройство оборудования"
                                                                        " и инвентаря для занятий каратэ; "
                                                                        "\n- знают историю развития в России;"
                                                                        "\n- знают названия технических приемов и стоек"
                                                                        " каратэ, основные приветствия, счет до 10, "
                                                                        "строевые команды, команды при проведении"
                                                                        " спарринга, общетехнические термины.",

            'Способствовать развитию общей физической подготовки (ОФП)': "\n- Демонстрируют выполнение нормативов по ОФП"
                                                                        " всоответствии с возрастом; "
                                                                        "\n- Владеют техникой упражнений"
                                                                        " сопутствующей подготовки.",

            'Научить основам специальной физической подготовки (СФП).': "\n- Знают принципы спортивной тренировки; "
                                                                        "\n- знают виды, средства и методы спортивной "
                                                                        "подготовки;"
                                                                        "\n- выполняют средства восстановления, "
                                                                        "применяемые в киокусинкай; "
                                                                        "\n- используют методику подготовки к "
                                                                        "соревнованиям;"
                                                                        "\n- применяют методы психической саморегуляции;"
                                                                        "\n- демонстрируют выполнение упражнения СФП.",

            'Научить базовым техникам киокусинкай.': "\n- Знают содержание и биомеханические основы базовой (кихон) "
                                                    "и адаптированной для спарринга техники каратэ; "
                                                    "\n- основы тактики единоборств; "
                                                    "\n- базовые положения правил соревнований по кумитэ и ката,"
                                                    " запрещенные действия при проведении кумитэ;"
                                                    "\n- умеют технически правильно, в устойчивой сбалансированной"
                                                    " позиции (стойке), с высокой скоростно-силовой концентрацией, "
                                                    "с акцентировкой в конце движения, с корректным обозначением уровня"
                                                    " (по высоте), с соблюдением биомеханических требований, с правильным"
                                                    " распределением мышечных тонусов выполнять базовую технику каратэ"
                                                    " (кихон) в пределах 10-9 кю и ее комбинации на месте и в перемещении,"
                                                    " формальные комплексы (ката), базовые комбинации в низкой"
                                                    " боевой стойке (рэнраку);"
                                                    "\n- демонстрируют выполнение базовой техники на месте и в"
                                                    " перемещении, рэнраку и ката; "
                                                    "\n- применение защитно-атакующей техники при перемещении"
                                                    " вперед и назад, а также в виде самбон-кумитэ и иппон-кумитэ; "
                                                    "\n- точные удары по болевым точкам на теле противника на"
                                                    " месте и в перемещении (обозначить).",
            'Изучить историю Хабаровского края':
                "\n- будут знать название края, региона, в котором они проживают,"
                " города и населенные пункты Хабаровского края;"
                "\n- будут знать главные"
                " вехи в истории Хабаровского края, роль его в годы ВОВ;"
                "\n- будут знать и"
                " находить на карте первые поселения на территории своего района."
            ,
            'Познакомить с этнографией коренных малых народов севера, проживающих в Хабаровском крае':
                "\n- будут знать традиционные занятия КМНС, места проживания, особенности быта и"
                " культуры коренных народов Хабаровского края"
            ,
            'Познакомить с флорой и фауной Хабаровского края':
                "\n- будут знать основных представителей флоры и фауны;"
                "\n- будут знать и отличать эндемики и редкие и охраняемые растения и животные ХК"
                "\n- будут знать и соблюдать правила поведения в природе, осуществлять природоохранную деятельность."
            ,
            'Изучить географию Хабаровского края':  "\n- знают размеры Хабаровского края, его природные особенности,"
                " географическое положение. основных представителей флоры и фауны, полезные ископаемые;"
                "\n- Могут показать на карте Хабаровский край, реку Амур, города Хабаровского края,"
                " муниципальные районы и их административные центры. "
            ,
            'Научить основам туристской подготовки':
                "\n- будут уметь использовать личное и групповое туристское снаряжение по назначению, "
                "разводить костер, ставить палатку, готовить на костре;"
                "\n- научатся преодолевать туристские препятствия;"
                "\n- получат опыт участия в походах выходного дня;"
                "\n- будут соблюдать правила поведения и техники безопасности во время занятий,"
                " походов, соревнований; "
            ,
            'Научить основам гигиены и первой доврачебной помощи':
                "\n- будут знать и соблюдать гигиенические требования в полевых условиях;"
                "\n- будут правильно одеваться для занятий в спортзале и на открытом воздухе;"
                "\n- будут соблюдать режим тренировок и отдыха"
                "\n- смогут осуществлять первичный самоконтроль физического состояния"
                "\n- смогут оказать первую помощь при закрытых переломах, ссадинах,"
                " наложить повязку, обработать рану, транспортировать пострадавщего;"
                "\n- будут знать правила сердечно-лёгочной реанимации"
            ,
            'Научить основам топографии и ориентирования':
                "\n- знают назначение спортивных карт и умеют ими пользоваться;"
                "\n- знают значение условных знаков и умеют их читать;"
                "\n- понимают что такое масштаб;"
                "\n- умеют ориентироваться по спортивной карте на местности;"
                "\n- могут составить план местности;"
                "\n- правильно определяют стороны света по компасу;"
            ,
            'Научить основам краеведения':
                "\n- знают историю образования края, его природные особенности, географическое положение."
                " основных представителей флоры и фауны, эндемики Дальнего Востока,"
                " полезные ископаемые;"
                "\n- знают памятники природы и истории Хабаровского края, "
                "могут пользоваться интерактивной картой памятников Хабаровского края."
            ,
            'Научить основам безопасности жизнедеятельности':
                "\n- знает причины пожаров и способы их предотвращения;"
                "\n- знает и соблюдает правила обращения с огнѐм;"
                "\n- знает порядок действий при возникновении загораний и пожара;"
                "\n- знает особенности горения синтетических материалов и способы прекращения горения;"
                "\n- знает и может применять первичные средства пожаротушения;"
                "\n- знает ядовитые растения, опасных животных и насекомых обитающих на территории Дальнего Востока"
                "\n- знает правила безопасного поведения на воде, при грозе."
            ,
            'Научить правильному поведению в чрезвычайных ситуациях':
                "\n- знает правила оптимального поведения при различных видах ЧС;"
                "\n- может обеспечить эвакуацию пострадавших в ЧС;"
                "\n- знает и может применить навыки выживания в ЧС;"
                "\n- знает и может подать сигналы бедствия различным путем."
            ,
            'Сформировать первичные умения по оказанию первой доврачебной помощи':
                "\n- будет знать правила оказания помощи при различных травмах."
                "\n- сможет наложить повязку, шину на перелом, остановить кровотечение;"
                "\n- может изготовить носилки разным способом;"
                "\n- будет знать необходимый минимальный состав аптечки;"
                "\n- будет знать правила применения лекарственных средств первой необходимости."
            ,
            'Научить основам пожарно-прикладного и спасательного спорта (ППС)':
                "\n- частие в конкурсах по по ППС и конкурсу WSR"
            ,
            'Сформировать начальные умения в проектной деятельности':
                "\n- знает, что такое проект, его структурные элементы;"
                "\n- соблюдает план и сроки выполнения проекта;"
                "\n- может сделать 6-8 слайдов к тексту защиты проекта;"
                "\n- может ответить на вопросы по сути созданного им проекта."
            ,
            'Научить основам исследовательской деятельности':
                "\n- знает и умеет применять методы исследования;"
                "\n- может составить диаграмму, график;"
                "\n- может провести эксперимент в рамках своей темы;"
                "\n- может представить результаты исследования."
            ,
            'Научить основам кооперации':
                "\n- умеют слушать и слышать друг друга;"
                "\n- принимает и выполняет возложенные обязанности, поручения при"
                " участии в разных формах групповой работы;"
                "\n- понимает свою ответственность за общий результат;"
                "\n- работает на результат, не смотря на межличностные отношения в группе."
            ,
            'Развить коммуникативные навыки':
                "\n- общается с большинством обучающихся в группе;"
                "\n- проявляет уважение к другим обучающимся, к педагогу;"
                "\n- может вербализовать свои вопросы, пожелания, задает"
                " вопросы и просит помощи в затруднительных ситуциях;"
                "\n- способен делиться (материалами, инструментами, знаниями, и т.д.);"
                "\n- проявляет эмпатию по отношению к другим обучающимся в группе;",

            'Научить основам пилотирования БПЛА': '\n- знают историю и применение БПЛА; \n- знают строение БПЛА;\n- знают технику безопасности полётов;\n- знают название фигур пилотажа;\n- умеют подключать и настраивать оборудование симулятора;\n-умеют работать индивидуально и в команде во время занятий\n-осмысленно следуют инструкциям;\n-преодолеют страх полёта.',

            'Научить основам FPV пилотирования и обслуживания БПЛА на практике': '\n- знают основные компоненты и устройство БПЛА;\n- знают технологическую последовательность сборки моделей;\n- знают принципы управления БПЛА;\n- знать принцип работы элементов управления;\n- знают правила техники безопасности на учебно-тренировочных занятиях;\n- соблюдают правила техники безопасности на учебно- тренировочных занятиях;\n- умеют работать с зарядным устройством;\n- умеют совершать полёт на симуляторе;',

            'Научить основам аэрофотосъёмки и фотограмметрии': '\n-знают основы аэродинамики летательного аппарата;\n- умеют собирать мультикоптер и подбирать к нему комплектующие;\n- умеют устанавливать FRL оборудование и летать с его использованием;\n- умеют применять полученные знания для ремонта и диагностики БПЛА;\n- владеет навыками ручного управления БПЛА в помещении, на улице и аэрофотосъемкой;\n- знают правила техники безопасности на учебно-тренировочных занятиях;\n- соблюдают правила техники безопасности на учебно- тренировочных занятиях.',

            'Научить основам автономного пилотирования БПЛА': '\n- умеют реализовывать сценические представления в среде программирования; \n- умеют создавать блочные программы для решения арифметических и логических задач (преодоление маршрутов, карты полетов);\n- умеют планировать и прописывать полезные задания и миссии; \n- умеют программировать и осуществлять автономные полеты; \n- умеют проводить предполетную подготовку;\n- знают правила техники безопасности на учебно-тренировочных занятиях;\n- соблюдают правила техники безопасности на учебно- тренировочных занятиях;\n-умеют работать в команде; \n-имеют опыт участия в соревнованиях по БПЛА краевого/всероссийского уровня.',

            'Развивать навык  пилотирования  и эксплуатации БПЛА': '\n- владеет профессиональной терминологией;\n- умеет разбираться в сборочных чертежах и системах БПЛА;\n- владеет навыком пилотирования в любых погодных условиях;\n- умеет искать и устранять неисправность БПЛА;\n- умеет применять технические средства и оборудование, используемое для управления полетом БПЛА;\n- умеет искать информацию в свободных источниках и структурировать ее;\n- умеет разрабатывать цифровую модель высокого разрешения;\n- владеет навыком коллективной работы и публичных выступлений по тематике.',

            "Сформировать интерес к робототехнике": '\n- знают правила техники безопасности и гигиены при работе с конструктором и компьютером;\n- соблюдают правила техники безопасности при работе с конструктором и компьютером;\n- осмысленно следуют инструкциям;\n- знают интерфейс среды программирования Lego WeDo 2.0;\n- умеют создавать элементарные программы, используя среду программирования Lego WeDo 2.0 (на основе образца);\n- знают, что такое повышающая/понижающая/ремённая передача;\n- знают, что такое датчик и принцип его функционирования;\n- знают простые механизмы (рычаг, наклонная плоскость ).',
            "Научить основам алгоритмизации и программирования робототехнических устройств": '\n- знают и соблюдают правила техники безопасности;\n- знают основы блочного языка программирования;\n- знают среду Lego WeDo 2.0 и основные принципы создания программ на компьютере;\n- знают, как создавать и использовать блок-схемы;\n- умеют составлять блок-схемы задач;\n- умеют составлять программы и модифицировать их;\n- знают терминологию (робот; программа; датчик; название элементов конструктора; название блоков программирования; простые механизмы; виды передач; виды зубчатых колес, шестерен и т.д.);\n- могут публично презентовать результат своей работы;',
            "Научить проектировать и создавать робототехнические устройства": '- умеют составлять технологические карты и технический паспорта модели;\n- знают основные, базовые алгоритмические конструкции «цикл», «цикл с условием», «повторяющееся действие» и смогут их применить;\n- могут создать робототехнические проекты разного уровня сложности;\n- знают принципы организации проектной разработки и  создания робототехнических устройств;\n- знают, что такое проектная деятельность, смогут разработать под руководством наставникам\n- будут уметь работать в группе, в паре, над совместным проектом; ',
            "Совершенствовать ключевые компетенции по созданию робототехнических проектов": '\n- могут находить нестандартные пути решения поставленной задачи;\n- умеют создавать робототехнический проект под конкретную задачу;\n- более развито логическое мышление;\n- умеют публично их презентовать проект;\n- умеют работать в команде; \n- имеют опыт участия в соревнованиях по робототехнике краевого/всероссийского уровня.',

            "Сформировать интерес  к робототехнике": "- знают и соблюдают правила техники безопасности и гигиены при работе с конструктором и компьютером; \n- осмысленно следуют инструкциям;\n- знают, что такое повышающая/понижающая/ремённая передача;\n- умеют составлять программы на внутреннем языке контроллера;\n- знают, что такое датчик и принцип его функционирования;\n- знают простые механизмы (рычаг, наклонная плоскость ).",
            "Научить основам алгоритмизации  и программирования робототехнических устройств": "- знают и соблюдают правила техники безопасности;\n- знают основы блочного языка программирования;\n- знают среду Lego Mindstorms EV3 и основные принципы создания программ на компьютере;\n- знают, как создавать и использовать блок-схемы;\n- умеют составлять блок-схемы задач;\n- умеют составлять программы и модифицировать их;\n- знают терминологию (робот; программа; датчик; название элементов конструктора; название блоков программирования; простые механизмы; виды передач; виды зубчатых колес, шестерен и т.д.).",
            "Сформировать навык разработки робототехнических проектов": "- умеют составлять технологические карты и технический паспорта модели;\n- знают основные, базовые алгоритмические конструкции «цикл», «цикл с условием», «повторяющееся действие» и могут их применять;\n- могут создать робототехнические проекты разного уровня сложности;\n- знают принципы организации проектной по разработке созданию робототехнических устройств;\n-знают, что такое проектная деятельность смогут работать под руководством наставника;\n- умеют работать в группе, в паре над совместным проектом;\n- могут публично презентовать результат своей работы.",
            "Совершенствовать ключевые компетенции  по созданию робототехнических проектов": "- могутнайти нестандартные пути решения поставленных задач;\n- умеют создавать робототехнический проект под конкретную задачу;\n- развитие логического мышления;\n- умеют готовить отчеты и публично их презентовать;\n- умеют работать в команде; \n- имеют опыт участия в соревнованиях по робототехнике краевого/регионального/всероссийского уровня.",
        }
        quest_data_dict = {
            'Сформировать интерес к 3D моделированию.': {
                "module_name": "Знакомство с 3D-технологиями",
                "teori": "ТБ и правила поведения в объединении. Разнообразии технологий 3D-печати: об истории возникновения 3D-печати, о видах 3D-печати – SLA, FDM, порошковой печати, 3D-печати из бумаги, еды и других материалов. О перспективе использования 3D-печати в производстве, сфере услуг, тяжёлой промышленности, ракетостроении, машиностроении, аэрокосмической инженерии.\n3D-ручки, их виды. Сферы применения 3D-ручек от сферы услуг до реверс-инжиниринга, об успешном применении 3D-ручек в сфере развлечений – фильмы, игры, прикладное творчество. Краткий обзор принципа работы 3D-ручек. О том, что можно сделать с помощью 3D-ручки, от художественных элементов до настоящих технических изделий.\nТехника безопасности при работе с 3D-ручкой. Инструменты, принадлежности и материалы. Простое моделирование: отработка рисования на трафаретах.  Понятия: эскиз, чертеж. Создание сложных 3 D моделей. Понятия: «развертка», каркас.",
                "practic": "Организация рабочего места. Эскизная графика и шаблоны при работе с 3D-ручкой. Создание эскиза или чертежа к каждой работе. Простое моделирование: отработка рисования на трафаретах. Способы заполнения межлинейного пространства «Орнаментальная композиция». Создание плоской фигуры по трафарету «Брелочки, магнитики». Создание объёмной фигуры, состоящей из плоских деталей. Создание витражной картины. Создание сложных 3 D моделей. Создание сложносоставного трехмерного объекта. Создание объемной модели животного мира. Создание объемной модели архитектурного объекта. Создание объемной модели человека, герои сказок, мультфильмов. Создание объемной модели бытового предмета: конфетница, карандашница, и т. п.». Ремонт сломанных 3D изделий-действие по принципу «дефект в эффект». Создание авторской модели (Моделирование трехмерного объекта на свободную тему по выбору обучающегося). Подготовка и участие в выставках и соревнованиях.\nСсылки на интернет ресурсы:\n	Трафареты для 3D ручек. URL:  https://eccmarket.ru/trafarety-dlya-3d-ruchek/ (дата обращения 16.01. 2023 г.);\n	Шаблоны для 3д ручки. URL:https://abspla.ru/skachat-trafarety  (дата обращения 16.01. 2023 г.);\n	 Уроки рисования 3D-ручкой для начинающих: бесплатные видео с идеями трехмерных поделок.  Электронный ресурс . URL:https://vse-kursy.com/read/1331-uroki-trehmernogo-risovaniya-video-s-ideyami-dlya-3d-ruchki.html (дата обращения 16.01. 2023 г.).\n	Уроки рисования 3d ручкой.  Электронный ресурс . URL: https://3d-pen-in.ru/%D1%83%D1%80%D0%BE%D0%BA%D0%B8_3d/ дата обращения 16.01. 2023 г.)."
            },

            'Научить основам 3D моделирования.': {
                "module_name": "Введение в 3D-моделирование. Tinkercad.",
                "teori": "Виды 3D-редакторов, сферы применения того, или иного редактора 3D-графики. Введение в программу Tinkercad. Способы создания дизайнов в Tinkercad. Рабочая плоскость, навигация и горячие клавиши в Tinkercad. Действия с фигурами на рабочей плоскости. Инструменты Линейка и Рабочая плоскость.",
                "practic": "Регистрация учетной записи Tinkercad. Знакомство с элементами окна среды. Использование горячих клавиш для работы с объектами (дублирование, передвижение по осям, поворот, выделение объектов, маштабирование и др.). Настройка рабочей сетки.  Редактирование созданных фигур, применение шага деления сторон к некоторым фигурам. Создание отверстие в фигурах, применение разноцветного режима. Создание фигур и их расположение относительно друг друга с применением линейки. Проект. Подготовка и участие в выставках и соревнованиях.\nСсылки на интернет ресурсы:\n	Обучение Tinkercad для чайников. URL: https://www.qbed.space/knowledge/blog/tinkercad-for-beginners-part-1 \n	Tinkercad. Бесплатные уроки (Готовые уроки для учащихся). URL:https://www.tinkercad.com/lessonplans \n	Курс по 3D моделированию в Autodesk TinkerCAD и Fusion360 (Уроки для школьников). URL:https://www.youtube.com/playlist?list=PLdxkNzRNCUZNSVpbP7bfaCnZPbrYdwSyQ \n	3D-моделирование для школьников (Уроки для школьников). URL: http://3dkjsp.blogspot.com/p/tinkercad.html  "
            },

            'Сформировать базовые знания и умения в трехмерной графике.': {
                "module_name": "Основы трехмерной графики. Blender.",
                "teori": "Возможности и область применения трехмерной графики. Виды трехмерной графики: полигональная, фрактальная и аналитическая. Программы трехмерной графики. Интерфейс программы трехмерной графики (на примере программы Blender). Главное меню. Моделирование. Создание и редактирование объектов. Материалы и текстуры.",
                "practic": "Ознакомление на практике с интерфейсом программы. Освоение на практике работы с окнами видов. Работа с mesh-формами и редактирование объектов. Режим редактирования. Опции «выделения». Экструдирование формы объекта. Редактирование вершин, ребер и граней объектов. Режим пропорционального редактирования. Использование модификаторов. Булевы операции. Участие в конкурсах и олимпиадах по 3D моделированию муниципальных/краевых/всероссийских уровней.\nСсылки на интернет ресурсы:\n	Введение в Blender. Курс для начинающих.  Электронный ресурс . URL:  https://younglinux.info/blender/course (дата обращения 16.01. 2023 г.);\n	 172+ бесплатных уроков в Blender: обучение 3d с нуля.\nURL: https://videoinfographica.com/blender-tutorials/ (дата обращения 16.01. 2023 г.);\n	Видеокурс по Blender 3D.  Электронный ресурс . URL: https://4creates.com/training/104-uroki-blender-3d-rus.html (дата обращения 16.01. 2023 г.).\nЛитература: \n	Кронистер Дж. - Основы Blender. Учебное пособие (3-е издание) v. 2.49 – 2010 (PDF, RUS)."
            },

            'Сформировать начальные умения в трехмерной печати.': {
                "module_name": "Введение в 3D-печать.",
                "teori": "Виды принтеров 3D. Особенности принтеров в различных областях. Используемый материал для 3D печати. Минусы и плюсы при  использование 3D принтера. Проектирование в программе Slic3.",
                "practic": "Настройка принтера 3D. Калибровка рабочего столика. Используем «Stl» файлы настраиваем и создаѐм файл для печати «Gcode». Настройка слайсера, заправка принтера. Практическое занятие по запуску слайсера, импорт подготовленной модели, её правильное размещению в рабочей области слайсера и анализ необходимого времени на печать. Требования к условиям печати во время эксплуатации принтера. Участие в конкурсах и олимпиадах по 3D моделированию и 3D печати муниципальных/краевых/всероссийских уровней.\nСсылки на интернет ресурсы:\n	сервис Thingiverse (большая коллекция 3D моделей для печати) URL: https://www.thingiverse.com/ (дата обращения 16.01. 2023 г.);\n	Как создать модель для печати на 3D-принтере: 30 видеоуроков.  Электронный ресурс . URL:  https://top3dshop.ru/blog/3d-projects-cad-explained.html#anchor7 (дата обращения 16.01. 2023 г.);\n	 Как создавать 3D-модели для печати в Blender\nURL:  https://www.dz-techs.com/ru/3d-printables-blender-how-to (дата обращения 16.01. 2023 г.);\n	Инструкция Slic3r URL: https://losprinters.ru/files/uploads/Witbox/Manual_Slic3r_RUS.pdf  (дата обращения 16.01. 2023 г.);\n	3D печать. Коротко и максимально ясно в ритме минимализма. (LittleTinyH Books), 2016 год. URL: https://3dtoday.ru/upload/files/books/3Dprintbook.pdf  (дата обращения 16.01. 2023 г.);\n	Доступная 3D печать для науки, образования и устойчивого развития. (Э. Кэнесс, К. Фонда, М. Дзеннаро) 2013 год. URL: https://vk.com/doc96700101_477180911?hash=pioepMqpTf8xH6gFPTL0Sij9yKtISnqKGBrlVMjQGKD&dl=nEpy7GSgGjndtzqoBueuDTZZfIRCqwz7BiD2PXCg4bH ( дата обращения 16.01. 2023 г.);\n	3D печать с нуля. Подробное руководство по обучению работы на 3D-принтере (Д.Горьков) 2015 год. URL: https://himfaq.ru/books/3d-pechat/3D-pechat-s-nulia-kniga-Gorkov-skachat.pdf  ( дата обращения 16.01. 2023 г.)."
            },

            "Сформировать интерес  к робототехнике": {
                "module_name": "Основы робототехники. История робототехники.",
                "teori": "ТБ и правила поведения в объединении. История развития робототехники. Происхождение термина «робот», три закона робототехники Азимова. Знакомство с конструктором LEGO, правилами организации рабочего места. Передовые направления робототехники. Знакомство с основными структурными элементами робота на примере робототехнических конструкторов. Понятие механической передачи, виды передач, передаточное отношение. Понятие конструкции и силы. Способы соединения деталей. Зубчатые и ременные передачи. Кулачковый механизм, червячная передача, зубчатая рейка, редуктор. Программирование на внутреннем языке контроллера. Органы управления, дисплей, меню контроллера.  Подключение периферийных устройств. Виды датчиков – датчик касания, ультразвуковой датчик, инфракрасный датчик, датчик освещенности, гироскопический датчик. Назначение и область применения каждого из датчиков.",
                "practic": "\tКонструирование моделей с использованием зубчатых и ременных передач. Конструирование моделей с использованием кулачкового механизма, зубчатой рейки, червячной передачи. Программирование движения на языке контроллера (движение по прямой, угол 90 градусов, квадрат; движение по окружности, «восьмеркой» и «крестом»; движение змейкой и по спирали).  Конструирование мобильного робота с датчиком (-ми). Программирование с датчиками на языке контроллера (Датчик касания. Программа «тычки», «челнок»; Датчик расстояния. Программа «тычки», «восьмёрка» с управлением от руки; Датчик звука. Программа «хлопки»; Датчик освещённости. Программа «тычки» в чёрную линию, «тычки» в белую линию, «челнок»; Движение по линии с датчиком освещенности.).  Сборка робота для выбранной задачи. Самостоятельное написание программы. Соревнования на скорость сборки моделей роботов по инструкциям и по образцу.\nСписок литературы:\n	Филиппов С.А. Уроки робототехники. Конструкция. Движение. Управление / С.А. Филиппов; сост. А.Я.Щелкунова. -М.: Лаборатория знаний, 2017. -176с.: ил;\n	Лоренс Валк Большая книга Lego Mindstorms EV3/ С. В. Черников – М.: Эксмо, 2017.- 397 с.:ил.;\n	Добриборщ Д.Э., Артемов К.А., Чепинский С.А., Бобцов А.А. Основы робототехники на Lego Mindstorms EV3/ -М.: 2018. - 108 с. \nСсылки на интернет ресурсы:\n	Некоммерческий информационный сайт ПРОРОБОТ.РУ URL: https://www.prorobot.ru/ (дата обращения 01.12. 2022 г.);\n	Уроки программирования (начинающий) URL: https://ev3lessons.com/ru/Lessons.html?tab=beginner (дата обращения 01.12. 2022 г.); \n	Сайт техподдержки продуктов LEGO ( методические рекомендации, интерактивные уроки, программное обеспечение ) URL:   https://www.lego.com/ru-ru/service (дата обращения 24.11. 2022 г.);\n	Техническая поддержка по сериям решений. Инструкции по сборке моделей. Уроки и занятия. Программное обеспечение. URL: https://educube.ru/support/ (дата обращения 24.11. 2022 г.);\n	Помощь начинающим робототехника.(уроки) URL:https://robot-help.ru/lessons.html дата обращения 01.12. 2022 г.);\n	Строим вместе с Карандашем и Самоделкиным ( схемы сборки, интересные проекты, разбор робототехнических задач) URL: http://karandashsamodelkin.blogspot.com/ (дата обращения 24.11. 2022 г.)."
            },
            "Научить основам алгоритмизации  и программирования робототехнических устройств": {
                "module_name": "Основы алгоритмизации и программирования. ",
                "teori": "Знакомство с понятием алгоритма, изучение основных свойств алгоритма. Знакомство с понятием исполнителя. Изучение блок-схемы как способа записи алгоритма. Интерфейс программы Lego Mindstorms EV3. Основы блочного программирования. Программные блоки EV3(Блоки «экран», «ожидание» и «звук»; Блоки «цикл» и «переключатель»; Блоки «движение» и «мотор»). Линейный алгоритм, понятие команда. Знакомство с понятием цикла. Варианты организации цикла в среде программирования. ",
                "practic": "\tСборка и программирование робототехнических устройств под конкретные задачи: движение по прямой, угол 90, 30  и 180 градусов, квадрат; движение вперёд и назад 2 метра, окружность заданного радиуса, восьмёрка, многоугольник; поворот вокруг оси, спираль, движение с ускорением; движения с датчиком касания: «парковка в гараж», «челнок» с двумя датчиками; движения с датчиком расстояния: остановка 1 см, объезд препятствия, лабиринт; движение с датчиком освещенности: «тычки» в чёрную линию; движение с датчиком освещенности: движение по линии с одним датчиком, с двумя датчиками. Участие в соревнованиях: «Кегельринг», «Сумо», «Чертежник».  Участие в тематических мероприятиях (городского, муниципального, регионального уровней).\nСписок литературы:\n	М.М. Киселев Робототехника в примерах и задачах. Курс программирования механизмов и роботов М.: - СОЛОН-Пресс, 2017-136 с.;\nСсылки на интернет ресурсы:\n	Уроки программирования (базовый/продвинутый) URL:https://ev3lessons.com/ru/Lessons.html?tab=beginner  (дата обращения 01.12. 2022 г.)."
            },
            "Сформировать навык разработки робототехнических проектов": {
                "module_name": "Проектирование и создание собственного робототехнического устройства.",
                "teori": "Роботехническое устройство, как проект. Этапы подготовки проекта: проблематизация – проектирование - планирование – поиск информации – изготовление продукта – презентация устройства. Элементы робототехнической модели. Инженерная книга. ",
                "practic": "Обсуждение элементов модели. Конструирование, разработка и запись управляющего алгоритма. Составление собственной модели, составление инженерной книги. Разработка одного или нескольких вариантов управляющего алгоритма. Демонстрация и защита модели.  Варианты проектов с открытым решением по выбору: робот в жизни человека; робот – исследователь; человекоподобный робот; шагающий робот; робот – эколог; Робот – спасатель;  Робот – шахматист ; Робот – художник; робот – принтер; лимоноид – робот, подающий напитки; робот – пожарный; робот – сортировщик; робот – погрузчик; робот – экскурсовод; робот – щенок; робот – кормушка; робот – часы; робот – газонокосилка; робот – трансформер; танцующий робот; гоночный робот; робот – марсоход; автономный робот, объезжающий препятствия; робот, который едет по черной линии; робо-рука. Участие в конкурсных мероприятиях городского, муниципального, регионального уровней."
            },
            "Совершенствовать ключевые компетенции  по созданию робототехнических проектов": {
                "module_name": "Соревновательная робототехника.",
                "teori": "Сложные виды движения. Задача «Заезд в гараж». Задача «Лабиринт». Регуляторы. Виды регуляторов, их использование (пропорциональный, интегральный, дифференциальный регуляторы). Виды соревнований. Разработка проекта под конкретную задачу. Изучение регламентов конкурсов / мероприятий/соревнований по робототехнике.",
                "practic": "\tПодготовка робототехнического проекта согласно выбранного регламента. Участие в соревнованиях и конкурсах различных уровней.\nРекомендуемые к участию конкурсы / мероприятия/соревнования по робототехнике:\n	Всероссийская Конференция «Юные техники и изобретатели» в Государственной Думе Федерального Собрания Российской Федерации URL: http://xn----itbbmalqd7b5a5d8a.xn--p1ai/konkurs/usloviya/  (дата обращения 24.11. 2022 г.);\n	Олимпиада  школьников «Робофест» URL: http://www.russianrobofest.ru/olimpiada/ (дата обращения 05.12. 2022 г.);\n	Российская робототехническая олимпиада URL: Серия соревновательных и образовательных мероприятий «ИКаР» (Инженерные кадры России) URL: https://www.xn--80a2aec.xn--p1ai/inzhenernye-kadry-rossii/about/ (дата обращения 24.11. 2022 г.)."
            },

            'Научить основам вольной борьбы': {
                "module_name": "Основы вольной борьбыОсновы вольной борьбы",
                "teori": "Вольная борьба, как вид спорта. История, развитие вольной борьбы в России и мире."
                        " Национальные виды борьбы народов России как основа, на которой сформировалась вольная борьба."
                        " Крупнейшие соревнования по вольной борьбе. Правила техники безопасности. Требования к форме."
                        " Гигиенические нормы и требования тренировочного процесса в вольной борьбе."
                        " Вредные привычки и их влияние на результативность занятий борьбой.",
                "practic": "Знакомство детей со спортивным залом, его оборудованием и правилами поведения на занятиях,"
                        " в раздевалках и в Центре. Построение, разминка, игровой тренинг на знакомство."
                        " Подготовка спортивной формы. Просмотр соревнований по борьбе (ТВ, реально)"
            },

            'Способствовать развитию общей физической подготовки': {
                "module_name": "Общефизическая подготовка(ОФП), техника выполнения упражнений на укрепление"
                            " опорно-двигательного аппарата, развитие выносливости с помощью кроссов и подвижных игр.",
                "teori": "Теоретические понятия ОФП, гимнастика, акробатика, легкая атлетика, дыхательные упражнения,"
                        " правила игр и кросса.",
                "practic": "Развитие координации движений, пластики, произвольного внимания."
                        "\n\t-техника безопасности при разминке;"
                        "\n\t- дыхательные и восстановительные упражнения;"
                        "\n\t- техника выполнения упражнений на укрепление опорно-двигательного аппарата. "
                        "\nУпражнения акробатические, из легкой атлетики, на дыхание"
                        "\nПодвижные игры, кроссы"
            },

            'Обучить основам специальной физической подготовки': {
                "module_name": "Специальная физическая подготовка (СФП), учебные схватки",
                "teori": "Основы техники и тактики вольной борьбы. Понятие о технике и тактики."
                        " Основы положения в борьбе (стойки, партер, мат). Приемы борьбы в портере (перевороты, броски)."
                        " Сущность и значение тактики в борьбе, взаимодействуют в технике и тактике при обучении."
                        " Виды тактики (наступательная, активно-оборонительная), умение отдыхать в процессе схватки."
                        " Типы схватки и тактические установки на борьбу с определенным противником."
                        " Технические действия. Техника падения и самостраховки.",
                "practic": "Перевороты с места через голову. Упражнения на мосту с партнером, с гирями, мячом, чучелом. "
                        "Упражнения для укрепления мышц шеи. Упражнения с партнером, уходы с места. "
                        "Подводящие упражнения для бросков через спину. Подводящие упражнения для бросков назад в стойке."
                        " Подводящие упражнения для подсидки, зацепов, подхватов, отхватов. Удары по набивному мячу."
                        " Перетягивание из положения стоя, перетягивание из упора лежа. "
                        "Выталкивание из круга: «Петушиный бой», «Борьба за захват туловища», «Борьба за предмет»."
            },

            'Обучить навыкам техники и тактики ведения схватки на соревнованиях': {
                "module_name": "Основы организации и проведения соревнований",
                "teori": "Виды соревнований: личные, лично-командные, командные. Способы проведения соревнований: "
                        "круговой, с выбыванием. Определения мест в соревнованиях. Возрастные группы учеников."
                        " Оценки приемов борьбы. Запрещенные приемы и неправильная борьба. "
                        "Состав судейской комиссии, основные документы, оборудование мест соревнований.",
                "practic": "Борьба в партере. Борьба на краю ковра."
            },

            'Познакомить учащихся с видом спорта «Баскетбол», правилами'
            ' игры, техникой, тактикой, правилами судейства и организацией проведения'
            ' соревнований, мерами безопасности на занятиях': {
                "module_name": "Основы игры в баскетбол.",
                "teori": "История баскетбола. Правила игры, техника, тактика, правилами судейства и организацией"
                        " проведения соревнований, мерами безопасности на занятиях. Влияние физических упражнений "
                        "на организм человека. Работа сердечно-сосудистой системы. Врачебный контроль и самоконтроль."
                        " Гигиенические требования к одежде и обуви для занятий физическими упражнениями. "
                        "Самоконтроль, из чего он состоит. Способы измерения пульса. "
                        "Способы регулирования и контроля физических нагрузок во время занятий физическими"
                        " упражнениями.История баскетбола. Правила игры, техника, тактика, правилами судейства "
                        "и организацией проведения соревнований, мерами безопасности на занятиях. "
                        "Влияние физических упражнений на организм человека."
                        " Работа сердечно-сосудистой системы. Врачебный контроль и самоконтроль. "
                        "Гигиенические требования к одежде и обуви для занятий физическими"
                        " упражнениями. Самоконтроль, из чего он состоит. Способы измерения пульса."
                        " Способы регулирования и контроля физических нагрузок во время занятий физическими упражнениями.",
                "practic": "Овладение и совершенствование двигательными действиями: перемещением, изменением направления"
                        " движения, передвижением парами в нападении и защите, бегом баскетболиста, передачами,"
                        " ведением и бросками. Сочетание рывков с финтами."
            },

            'Способствовать развитию физических качеств, необходимых для успешной игры в баскетбол': {
                "module_name": "Общая и специальная физическая подготовка",
                "teori": "Основные строевые и прикладные упражнения",
                "practic": "Специальные упражнения для развития силы, ловкости, быстроты, прочности. "
                        "\nУпражнения для развития физических качеств, необходимых для успешной игры в баскетбол."
                        " Строевые и прикладные упражнения. Упражнения в метании и ловли мяча. "
                        "Общеразвивающие упражнения в движении, в парах, в тройках, в группах. "
                        "Специальные упражнения для развития силы, ловкости, быстроты, прыгучести. "
                        "Эстафеты и подвижные игры для развития специальных качеств баскетбола. "
            },

            'Познакомить с техническими и тактическими приемами баскетбола': {
                "module_name": "Основы техники и тактики игры",
                "teori": "Техника перемещений, техника владения мячом, техника защиты, техника перемещений и"
                        " овладения шагом, индивидуальные действия в нападении, групповые и командные действия в"
                        " нападении, индивидуальные действия в защите, групповые и командные действия в защите.",
                "practic": "Техника перемещений."
                        "\n- знать стойку баскетболиста, остановки, шагам и прыжком;"
                        "\n- поворот вперед, назад."
                        "\n- правильно передвигаться в стойке баскетболиста;"
                        "\n- владеть навыками остановок, поворотов, прыжков. "
                        "Стойка без мяча и с мячом. Бег по прямой, с изменением направления."
                        " Рывки на короткие (2-4 м) и средние (5-15 м) расстояния по сигналам. "
                        "Прыжки: толчком обеими ногами с места и после движения. Остановки двумя шагами, прыжком. "
                        "Сочетание остановок с бегом. Повороты назад и вперед на месте, после бега и остановки."
                        " Упражнения для совершенствования работы ног без шага и с мячом."
                        " Эстафета, подвижные игры с использованием перемещений различными способами."
                        "\nТехника владения мячом."
                        "\n- знать основные передачи и способы ловли мяча;"
                        "\n- броски в корзину, ведение мяча."
                        "\n-  владеть различными способами передачи мяча и ловли, бросков в корзину;"
                        "\n- водить мяч без зрительного контроля. Ловля мяча: двумя руками на месте, на уровне"
                        " груди высоко летающего, низко летающего, ловля в движении и в прыжке."
                        " Передача мяча одной рукой снизу, одной рукой сверху и скрытые передачи."
                        " Броски в корзину: двумя руками от груди, одной от плеча, в движении и в прыжке."
                        " Добивание мяча. Ведение мяча: с высоким отскоком по прямой, по дугам, с изменением"
                        " направления, без зрительного контроля. Перевода шага за спину, под ногой, перед собой, "
                        "ведение разворотом. Комбинированные упражнения в сочетании с различными приемами с мячом"
                        " в движении. Эстафеты и игры с выполнением обусловленных приемов."
                        "\nТехника защиты. Техника перемещений и овладения шагом."
                        "\n-  обегать игрока без мяча и с мячом;"
                        "\n-  передвижение в баскетбольной стойке. Стойка при опоре противника без мяча и с мячом."
                        " Перемещение противника шагами в стороны, вперед, назад. Бег спиной вперед."
                        " Ускорение в различных направлениях в состоянии готовности и по сигналу. "
                        "Сочетание различных приемов и способов перемещений. Эстафеты и игры с использованием"
                        " перемещений приставными шагами и спиной вперед. Техника владения шагом. Выравнивание шага."
                        " Выбивание мяча из рук противника. Накрывание и перехватывание мяча."
                        "\nИндивидуальные действия в нападении."
                        "\n-  знать действия противника без мяча;"
                        "\n- способы владения мячом при организации атаки - использование передачи, ведения, бросков."
                        "\n-  определить согласно игровой обстановке;"
                        "\n-  место расположения и дальнейших действий. Действие игрока без мяча: выбор места для"
                        " получения мяча – выход навстречу партнеру и в направлении от партнера. Освобождение от "
                        "опеки защитника. Применение приемов техники перемещений, для ухода от защитника и овладения"
                        " мячом. действия игрока с мячом: применение приемов техники владения шагом при организации"
                        " атаки - использование передач мяча, ведения, бросков в корзину. Выбор способа в зависимости"
                        " от игровой ситуации. Применение рациональных сочетаний приемов."
                        "\nГрупповые и командные действия в нападении."
                        "\n-  знать при групповых и командных взаимодействиях свое место расположение на площадке."
                        " Определять по сигналу или иное взаимодействие при групповых и командных действиях. "
                        "Взаимодействие двух и трех игроков с быстрым передвижением по всей площадке."
                        " С короткими передачами с применением владения. Взаимодействие 2-3 игроков против ровного числа"
                        " защитников. Командные действия: Быстрый прорыв. Организация прорыва после ловли мяча от щита"
                        " центровали игроками - расположение и действия в начальной фазе, в фазах развития и завершения"
                        " атаки. Позиционное нападение. Система нападения через центрового игрока. Расстановка игроков"
                        " с центровыми. Взаимодействие игроков задней линии и находящих с центровым. "
                        "Окрестный выход двух игроков."
                        "\nИндивидуальные действия в защите."
                        "\n-  действия против игрока без мяча;"
                        "\n-  действия против игрока с мячом."
                        "\n- выбирать места при держании игрока с мячом и без него;"
                        "\n-  применять приемы овладения мячом. Действия против игрока без мяча. Выбор места при"
                        " держании игрока без мяча. Выбор места при держании игрока без мяча - изменение расположения"
                        " в зависимости от положения подопечного и мяча, применение приемов перемещения для опеки "
                        "противника. Выбор места и овладения мячом от щита. действия против игрока с мячом. Выбор места"
                        " с использованием приемов перемещения при держании игрока с мячом, в зависимости от позиции"
                        " подопечного, до и после ведения. Применение приемов овладения мячом - вырывание, выбивание,"
                        " перехватывание."
                        "\nГрупповые и командные действия в защите."
                        "\n-знать основные классические взаимодействия двух, трех игроков;"
                        "\n-взаимодействия двух, трех игроков при численном превосходстве нападающих;"
                        "\n-командные действия при личной и законной защите."
                        "\n-владеть навыками за короткий промежуток времени определять свое месторасположение"
                        " на площадке при групповых и командных действиях. Взаимодействие двух игроков: подстраховка"
                        " - центрального игрока, игрока, владеющего точным дальним броском и проходом; противодействие"
                        " заслоном - переключения, проскальзывание. Взаимодействие двух игроков при численном"
                        " превосходстве нападающих. Командные действия: Система личной защиты: на половине площадки"
                        " и в области штрафного броска - расположение игроков, перемещение, взаимопомощь."
                        " Личный прессинг - расположение, передвижение, действия для овладения мячом. Система зонной"
                        " защиты; в области штрафного броска – расположение игроков (2х1х2, 1хЗх1, 2х3, 3х2)."
                        " Зонный прессинг – расположение, передвижение."
            },

            'Способствовать формированию соревновательного опыта': {
                "module_name": "Контрольные игры и соревнования",
                "teori": "",
                "practic": "Проведение отдельных упражнений по плану преподавателей с последующим анализам действий "
                        "проводящего (выбор места, объяснение, показ, исправление ошибок). Разбор и запись упражнений"
                        " основной части урока. Организация группы для выполнения упражнений. Наблюдение за действиями"
                        " проводящих с последующим анализом. Судейство учебных игр. Участие в соревнованиях различного"
                        " уровня. Наблюдение и анализ ошибок, допущенных во время игры."
                        " Подготовка и участие в соревнованиях"
            },

            'Обучить необходимым понятиям и теоретическим сведениям по физической культуре и спорту': {
                "module_name": "Введение в  легкую атлетику",
                "teori": "\nИстория возникновения легкой атлетики. Развитие вида спорта. "
                        "\nПравила соревнований по легкой атлетики. Правила безопасного выполнения. "
                        "\nТехника безопасности. Влияние физических упражнений на организм юного спортсмена."
                        "\nТехника бега. Медленный бег, разновидность бега. ОРУ в парах, маховые движения рук, ног."
                        " Правильное положение рук, ног и туловища при выполнении легкоатлетических упражнений. "
                        "Правила безопасного выполнения."
                        "\nПравильное положение рук, ног и туловища при выполнении легкоатлетических упражнений."
                        " Правила безопасного выполнения.",
                "practic": "\nПовороты, разновидность ходьбы, упражнения на осанку. Бег с высоким подниманием бедра, "
                        "семенящий бег, с захлестыванием голени, ускорение."
                        "\nСпециальные беговые упражнения для развития выносливости. "
                        "Бег в среднем темпе до 6 минут. ОРУ в парах."
                        "Специальные беговые упражнения для развития выносливости. "
                        "\nБег в среднем темпе до 6 минут. ОРУ в парах."
            },

            'Развивать основные физические качества': {
                "module_name": "ОФП (общая физическая подготовка)",
                "teori": "Значение ОФП при занятиях легкой атлетикой. Правильное выполнение упражнений для развития силы,"
                        " быстроты, гибкости и координации. Упражнения для рук и плечевого пояса."
                        " Упражнения для мышц ног и туловища. Упражнения для развития силы, быстроты,"
                        " гибкости и координации",
                "practic": "Выполнение комплекса по ОФП:"
                        "\n- Упражнения для мышц рук."
                        "\n- Упражнения для мышц туловища."
                        "\n- Упражнения для мышц ног."
                        "\nТест на развитие силы-подтягивание (мальчики), отжимание (девочки). Тест на развитие "
                        "быстроты-бег 30м. Тест на развитие гибкости-наклон вперед из положения стоя."
                        "\nТест на развитие координации-челночный бег 3/10 метров."
            },

            'Развивать физические качества, специальные двигательные навыки': {
                "module_name": "СФП (специальная физическая подготовка)",
                "teori": "Значение специальной физической подготовки для развития юных легкоатлетов. "
                        "Упражнения для развития быстроты и стартовой выносливости. Совершенствование "
                        "скоростных качеств, старт, финиш. Упражнения для развития скоростно-силовой выносливости.",
                "practic": "Ускорения из различных исходных положений, челночный бег 3/10 и 10/10 метров. "
                        "Прыжки в длину с места и с разбега. Прыжки через гимнастические скамейки на двух ногах. "
                        "Разновидности прыжков через скакалку на одной и двух ногах на месте и в движении."
            },

            'Повысить техническую подготовленность в данном виде спорта': {
                "module_name": "Техническая подготовка легкоатлетов",
                "teori": "Техника прыжка с места, с разбега. Техника метания. Техника эстафетного бега. "
                        "Техника кроссовой подготовки. Правильная техника прыжков, метания. "
                        "Правила и техника передачи эстафетной палочки.",
                "practic": "ОРУ (общеразвивающие упражнения) с набивными мячами (2кг, 5кг). Метание теннисного мяча."
                        "\nСпециальные прыжковые упражнения. Эстафеты с эстафетной палочкой. "
                        "\nЛинейные эстафеты без предмета. Бег в медленном темпе до 8 минут. "
                        "\nУчастие в одних соревнованиях."
                        "\nОрганизация и проведение соревнований. Разбор и устранение ошибок после соревнований."
            },

            'Познакомить с терминами, общими понятиями, техникой безопасности,'
            ' историей, основными направлениями и техниками киокусинкай': {
                "module_name": "Введение в киокусинкай, как вид спорта ",
                "teori": "- изучение правил поведения в зале, техники безопасности;"
                        "\n- изучение правил обращения со спортивным инвентарем;"
                        "\n- спортивная форма и правила ее ношения;"
                        "\n- личная гигиена; "
                        "\n- история развития киокусинкай в России;"
                        "\n- возникновение киокусинкай."
                        "\n- изучение правил поведения в зале, техники безопасности;"
                        "\n- изучение правил обращения со спортивным инвентарем;"
                        "\n- спортивная форма и правила ее ношения;"
                        "\n- личная гигиена; "
                        "\n- история развития киокусинкай в России;"
                        "\n- возникновение киокусинкай.",
                "practic": "- Традиционные и спортивные направления киокусинкай;"
                        "\n- этикет киокусинкай, клятва каратиста."
            },

            'Способствовать развитию общей физической подготовки (ОФП)': {
                "module_name": "Общая физическая подготовка",
                "teori": "Освоение основ общеразвивающих упражнений по виду спорта киокусинкай.",
                "practic": "- Общеразвивающие упражнения;"
                        "\n- подвижные игры для развития ловкости, быстроты, выносливости"
            },

            'Научить основам специальной физической подготовки (СФП).': {
                "module_name": "Специальная физическая подготовка (СФП)",
                "teori": "Освоение основ техники упражнений по виду спорта киокусинкай",
                "practic": " Упражнения на развитие силовых качеств;"
                        "\n- упражнения на развитие скоростно-силовых способностей;"
                        "\n- упражнения на развитие гибкости, ловкости;"
                        "\n- упражнения на развитие координации, равновесия."
            },

            'Научить базовым техникам киокусинкай.': {
                "module_name": "Основы базовой техники киокусинкай",
                "teori": "Краткая характеристика техники киокусинкай, значение правильной техники.",
                "practic": "- изучение базовой ударной техники;"
                        "\n- изучение базовой техники перемещения;"
                        "\n- изучение ката начального уровня."
            },

            'Изучить историю Хабаровского края': {
                "module_name": "История Хабаровского края",
                "teori": "Первые появления русских землепроходцев."
                        "Экспедиции И.Ю. Москвитина, В.Д. Пояркова, Е.П. Хабарова."
                        " Амурские сплавы. Первые поселения казаков на территории ХК."
                        " Условия жизни казаков и крестьян, основные занятия.\n"
                        "\tХабаровский край в годы ВОВ. Жизнь людей, работа предприятий в годы войны."
                        " Вклад жителей в дело победы. Знакомство с виртуальной картой памятных мест ВОВ. "
                        "Символа хабаровского края. Герб, флаг, гимн края. Значения цветов флага."
                        "  Символизм фигур на гербе.",
                "practic": "Работа с к\к. Отметить пути освоения Приамурья."
                        " Отметить первые русские поселения в вашем районе Разгадывание кроссворда."
                        " Подготовка презентаций по теме «Мой город\поелок\село в годы ВОВ."
                        " Участие в краеведческих конкурсах."
            },
            'Познакомить с этнографией коренных малых народов севера, проживающих в Хабаровском крае': {
                "module_name": "Этнография.",
                "teori": "Коренные народы Хабаровского края – исконные жители Приамурья:"
                        " эвены, эвенки, нанайцы, нивхи, орочи, негидальцы, удыгейцы."
                        " Их расселение и занятия Культура и быт. Легенды, мифы, сказки, народные приметы."
                        " Народные ремесла. Шаманизм коренных народов. Роль шаманов."
                        " Верования, духи, защита от злых  сил.\n\tБыт и культура коренных народов своего района.",
                "practic": "Работа с к\к. Отметить на карте места компактного расселения разных национальностей,"
                        " национальные села вашего района. Разгадывание кроссворда, ребуса."
                        " Изготовление нанайской куклы по образцу из бумаги."
                        " Изготовление поделки «Оберег».\n"
                        " \tЭкскурсия в местный краеведческий музей (виртуальная экскурсия при отсутствии такового)."
            },
            'Познакомить с флорой и фауной Хабаровского края': {
                "module_name": "Флора и фауна Хабаровского края",
                "teori": "Особенности природы, связанные с протяженностью ХК с севера на юг. Разновидности лесов. Тайга."
                        "  Основные виды деревьев и кустарников. Животные, проживающие в Хабаровском крае."
                        " Эндемики ХК. Что такое эндемики?\n\t Красная книга ХК. "
                        "Исчезающие животные, обитающие на территории вашего района."
                        " Что такое заказник, заповедник, памятник природы. Заповедные места ХК.",
                "practic": "Определение по рисунку (гербарию) растений. Экскурсия в лес."
                        "  Игра-лото с названиями животных (10- 15 животных с названием и описанием)."
                        " Изготовление поделки «Лотос» из бумаги. "
                        "Изготовление листовок о защите редких и исчезающих животных и растениях (по выбору)."
                        " Участие в природоохранной акции. Разгадывание кроссворда по теме.\n\t"
                        " Экскурсия в заповедник, заказник, к памятнику природы виртуальная экскурсия."
            },
            'Изучить географию Хабаровского края': {
                "module_name": "География Хабаровского края ",
                "teori": "Хабаровский край, его природные особенности, географическое положение, климат,"
                        " его рельеф, крупнейшие реки, полезные ископаемые. Разнообразие растительного"
                        " и животного мира, обоснованное протяженностью Хабаровского края с севера на юг. "
                        "Административное деление, города и районные центры."
                        " Зависимость социально-экономического развития муниципалитетов от природных условий."
                        " Туристические возможности края (района). ",
                "practic": "Работа с атласом и контурной картой Хабаровского края: обозначение административной"
                        " и государственной границ, граничащих субъектов и государств; река Амур,"
                        " города Хабаровского края, муниципальные районы и их административные центры."
                        " Разработка туристической тропы по территории муниципального района. "
            },
            'Научить основам туристской подготовки': {
                "module_name": "Основы туристской подготовки",
                "teori": "Туристско-краеведческая деятельность учащихся. "
                        "Активные формы туристско-краеведческой деятельности."
                        " Туризм — средство познания своего края, физического и духовного развития,"
                        " оздоровления, воспитания самостоятельности. \n\t"
                        "«Туристские походы. Техника безопасности при проведении туристских походов»."
                        " Определение цели и района похода."
                        " Распределение обязанностей в группе. "
                        "Разработка маршрута, составление плана-графика движения.\n\tОрганизация туристского быта. "
                        "Привалы и ночлеги. Туристский бивак. Виды костров. Выбор места для привала и ночлега (бивака). "
                        "Основные требования к месту привала и бивака.\n\tПонятие о личном и групповом снаряжении. "
                        "Личное снаряжение для походов выходного дня (ПВД) и степенных походов, требования к нему."
                        " Групповое снаряжение, требования к нему."
                        " Типы палаток, их назначение.\n\tОрганизация питания в 2-3-дневном походе. Меню."
                        " Продуктовая раскладка (список продуктов и их количество). Рецепты походных блюд",
                "practic": "Подготовка и проведение похода. Составление плана подготовки похода. "
                        "Изучение маршрута похода. Подбор снаряжения для похода. Составление меню. "
                        "Фасовка, упаковка и переноска продуктов в рюкзаках. Приготовление пищи в полевых условиях."
                        "  Установка палаток различных видов. Разведение костра. Установка тента."
                        "Развёртывание и свёртывание лагеря (бивака)."
            },
            'Научить основам гигиены и первой доврачебной помощи': {
                "module_name": "Основы гигиены и первая доврачебная помощь",
                "teori": "Личная гигиена туриста, профилактика заболеваний."
                        " Применение средств личной гигиены в походах и во время тренировочного процесса."
                        " Подбор одежды и обуви для тренировок и походов, уход за одеждой и обувью. "
                        "Особенности соблюдения гигиенических правил в походных условиях. \n\t"
                        "Основные приёмы оказания первой доврачебной помощи. Походный травматизм. "
                        "Помощь при различных травмах. "
                        "Сердечно-лёгочная реанимация.\n\tВлияние систематических занятий"
                        " физической культурой и спортом на укрепление здоровья, развитие"
                        " физических качеств: силы, быстроты, ловкости, гибкости, выносливости."
                        " Формирование правильной осанки. Гармоническое телосложение как основа долголетия."
                        " Значение и содержание врачебного контроля, и формы работы по врачебному контролю."
                        " Значение и содержание самоконтроля спортсмена.\n\tПоходная медицинская аптечка, "
                        "ее назначение. Состав походной аптечки. Хранение и транспортировка аптечки в походных условиях.",
                "practic": "Наложение жгута, ватно-марлевой повязки, обработка ран. Виды повязок."
                        " Оказание первой помощи условно пострадавшему"
                        " (ссадины, порезы, потёртости, травма головы, перелом предплечья, перелом голени,"
                        " перелом пальца руки). Сердечно-лёгочная реанимация. Транспортировка пострадавшего.\n\t"
                        "Применение методов самоконтроля физического состояния: измерение пульса, частоты дыхания. \n\t"
                        "Сбор походной аптечки. Упаковка, хранение лекарственных средств."
            },
            'Научить основам топографии и ориентирования': {
                "module_name": "Топография и ориентирование",
                "teori": "План и карта. Понятие о топографической карте, спортивной карте."
                        " Условные знаки, их назначение. Масштаб. Виды масштабов.\n\t"
                        " Компас. Типы компасов. Правила обращения с компасом."
                        " Определение сторон горизонта по компасу, ориентирование карты по компасу.",
                "practic": "Составление плана помещения. Изучение условных знаков топографических карт."
                        " Знакомство с различными формами рельефа. Топографические диктанты,"
                        " упражнения на запоминание знаков. «Путешествия» по картам."
                        " Ориентирование карты по компасу."
                        " Практикум по ориентированию на местности в реальных условиях."
                        " Соревнования по ориентированию на местности."
            },
            'Научить основам краеведения': {
                "module_name": "Основы краеведения ",
                "teori": "Хабаровский край, его природные особенности, географическое положение."
                        " Климат, растительность и животный мир Хабаровского края, его рельеф, реки, озёра,"
                        " полезные ископаемые. Памятники истории и культуры."
                        " Малочисленные народы проживающие на территории Хабаровского края – коренные жители края."
                        " Их культура, быт, традиции. История города Хабаровска.\n\tТуристские возможности родного края,"
                        " обзор экскурсионных объектов, музеи. Наиболее интересные места для проведения походов."
                        " Памятники истории и культуры, музеи края.\n\t Общественно-полезная работа в путешествии,"
                        " охрана природы и памятников культуры»",
                "practic": "Экскурсия в краеведческий музей. Виртуальные экскурсии по достопримечательностям "
                        "Хабаровского края. Работа с контурной картой края. "
                        "Проведение уроков краеведения для учащихся школы.\n\tСанитарная уборка биваков"
                        " и троп во время проведения туристских путешествий. "
            },
            'Научить основам безопасности жизнедеятельности': {
                "module_name": "Окружающая среда и опасности повседневной жизни",
                "teori": "Понятия об опасных и вредных факторах окружающей среды. "
                        "Источники опасных и вредных факторов на улице, дома, в природе.\n\t"
                        " Пожары в жилых помещениях, причины их возникновения. Опасные факторы горения."
                        " Особенности горения синтетических материалов."
                        " Способы прекращения горения веществ и материалов. Подручные (первичные)"
                        " средства пожаротушения и порядок их применения."
                        " Правила поведения и действия при возникновении загораний и пожара."
                        " Меры предохранения от получения ожогов, отравлений газом и дымом."
                        " Оказание первой помощи пострадавшим при пожаре."
                        "  Электробезопасность при пользовании электроэнергией в бытовых помещениях."
                        " Средства бытовой химии и меры предосторожности при их использовании."
                        " Правила поведения в общении с природой и животным миром.."
                        " Меры предосторожности во время грозы. Ядовитые растения, опасные животные и насекомые."
                        " Правила безопасного поведения на воде. ",
                "practic": "Применение подручных средств пожаротушения, практика пользования техническими"
                        " средствами пожаротушения, профилактика и оказание помощи при поражении электротоком,"
                        " оказание помощи при отравлениях, оказание первой помощи утопающему"
            },
            'Научить правильному поведению в чрезвычайных ситуациях': {
                "module_name": "Чрезвычайные ситуации природного и техногенного характера.",
                "teori": "Краткая характеристика стихийных бедствий, наиболее опасных для Дальнего Востока,"
                        " их физическая сущность, причины возникновения, характер и стадии развития"
                        " Первичные и вторичные опасные факторы стихийных бедствий."
                        " Способы обеспечения безопасности человека, правила поведения и действия при"
                        " стихийных бедствиях.\n\t Аварии и катастрофы на промышленных предприятиях,"
                        " гидротехнических сооружениях, транспорте и их возможные последствия"
                        " (химическое заражение, затопление, массовые пожары). Потенциальные опасности"
                        " аварий и катастроф местных предприятий и других объектов народного хозяйства.\n\t"
                        " Система международных сигналов бедствия. Знаки-сигналы на местности для воздушных"
                        " поисковых спасательных служб.",
                "practic": "Отработка способов химической защиты. Очистка воды подручными средствами."
                        " Изготовление и применение плавсредств для эвакуации."
                        "  Отработка эвакуации пострадавших с различных видов объектов (многоэтажный дом,"
                        " колодец, машина после ДТП, с дерева и т.п.) "
            },
            'Сформировать первичные умения по оказанию первой доврачебной помощи': {
                "module_name": "Первая доврачебная помощь.",
                "teori": "Оказание первой помощи при кровотечениях, переломах, травмах головы, ушибах. Виды повязок."
                        " Наложение шин. Транспортировка пострадавшего, изготовление носилок из подручных средств."
                        " Транспортировка при травмах головы. Сердечно-легочная реанимация. Непрямой массаж сердца и"
                        " искусственное дыхание. Оказание помощи при: отравлениях и ожогах средствами бытовой химии;"
                        " при отравлении, укусе змеи, насекомого, утоплении, пострадавшему от электрического тока,"
                        " переохлаждении. Аптечка для похода: состав, назначение, применение.",
                "practic": "отработка правильного наложения повязок жгутов, шин;\n"
                        "отработка сердечно-легочной реанимации;\n"
                        "подготовка аптечки для похода;\n"
                        "отработка транспортировки пострадавшего с изготовлением носилок разным способом."
            },
            'Научить основам пожарно-прикладного и спасательного спорта (ППС)': {
                "module_name": "Пожарно-прикладные  и спасательные соревнования и конкурсы. ",
                "teori": "История ППС.  Виды ППС. Классификация по пожарно-прикладным упражнениям,"
                        " утвержденные нагрудные знаки, а также положения о порядке присвоения звания"
                        " «Мастера спорта СССР» и спортивных разрядах."
                        "  Включение пожарно-прикладного спорта в Единую Всесоюзную Спортивную Квалификацию."
                        " Правила проведения соревнований по видам ППС: общие положения, старт,"
                        " бег по дистанции, финиш. Пожарно-техническое вооружение. Виды соревнований."
                        " Последовательность проведения соревнований по видам предусматривается положением"
                        " о соревнованиях или устанавливается на месте судейской коллегией.\n\tСпасательные"
                        " работы, как компетенция конкурсного движения «Молодые профессионалы"
                        " (Ворлдскиллс Россия)» (далее WSR).\n\tСтандарты, которые предъявляются участникам"
                        " для возможности участия в соревнованиях, а также принципы, методы и процедуры,"
                        " которые регулируют соревнования.",
                "practic": "Отработка навыков работы с оборудованием. Подготовка к соревнованиям по ППС и  конкурсу WSR"
            },
            'Сформировать начальные умения в проектной деятельности': {
                "module_name": "Основы проектной деятельности",
                "teori": "Что такое проект, его структурные элементы. Сроки и планирование работы над проектом."
                        " Представление проекта и его результатов."
                        " Интерфейс и правила создания презентации в программе PowerPoint. Защита проекта."
                        " Культура речи при защите проекта.",
                "practic": "Работа над проектом. Подготовка защиты под руководством педагога, составление текста."
                        " Создание презентации в программе PowerPoint для защиты проекта."
            },
            'Научить основам исследовательской деятельности': {
                "module_name": "Основы исследовательской деятельности.",
                "teori": "Исследование и проект, отличия и сходства. Методы исследования. Эксперимент."
                        " Методы описания и представления результатов исследования. Диаграммы. Графики. Анализ результатов",
                "practic": "Исследовательская работа. Составление описания и защиты исследования."
                        " Составление графиков, диаграмм. "
            },
            'Научить основам кооперации': {
                "module_name": "",
                "teori": "",
                "practic": ""
            },
            'Развить коммуникативные навыки': {
                "module_name": "",
                "teori": "",
                "practic": ""
            },

            'Сформировать представление о технологии дополненной и виртуальной реальности.': {
                "module_name": "Введение в AR/VR",
                "teori": "ТБ и правила поведения в объединении. Понятие виртуальной, дополненной и смешанной реальности. Введение в историю развития VR/AR-технологий. Обзор оборудования для работы с виртуальной и дополненной реальностью. Знакомство с конструкцией и принципами работы очков виртуальной реальностью. Обзор проектов в сфере VR/AR и методов их создания. Знакомство с редактором Canva. Структура и содержание презентации.",
                "practic": "Обсуждение существующих VR/AR-приложений, выявление их плюсов и минусов, размышление над будущем индустрии. Тестирование VR/AR-устройств, калибровка межзрачкового расстояния, настройка контроллеров. Запуск и работа с тестовыми приложениями (Oculus, HTC, Dell). Создание и защита презентации «Применение VR/AR технологий».\nСсылки на интернет ресурсы:\n-	Астраханцева З. Е. Виртуальная реальность в помощь современному педагогу [электронный ресурс] / З. Е. Астраханцева // URL: http://platonsk.68edu.ru/wpcontent/uploads/2017/07/Doklad-Virtualnaya-realnost-v-pomoshh-sovremennomupedagogu.pdf (дата обращения: 16.02.2023);\n-	Гриншкун А. В. Технология дополненной реальности и подходы к их использованию при создании учебных заданий для школьников / А. В. Гриншкун // Вестник МГПУ. Серия информатика и информатизация образования. — М.: МГПУ. — 2017. — № 3 (41). — С. 99–105.;\n-	Раскраски с дополненной реальностью [электронный ресурс] // URL: http:// www.quivervision.com (дата обращения: 26.02.2023)."
            },
            'Научить основам 3D-моделирования.': {
                "module_name": "Введение в 3D-моделирование (Blender)",
                "teori": "Введение в теорию трехмерной графики. Обзор ПО для работы с 3D-графикой (Blender, 3Ds Max, Maya, Cinema4D, ZBrush и пр.). Этапы создания полигональной 3D-модели (моделирование, текстурирование, развертка, рендеринг и пр.). Обзор интерфейса и основных инструментов редактора Blende. Основы симуляции частиц. Особенности настройка рендера в движках Cycles и Eevee. Способы создания анимации.",
                "practic": "Обсуждение видов 3D-графики и способов их создания. Полигональное моделирование в трехмерном редакторе Blender. Работа с основными инструментами, настройка света и камеры, получение рендера. Текстурирование и развертка. Основные инструменты и способы создания анимация. Создание/доработка модели методом скульптинга. Симуляция частиц. Подключение очков виртуальной реальности к интерфейсу Blender. Поиск обучающих материалов по теме, а также самостоятельное изучение заданных видео-уроков на платформах YouTube, RuTube и др. Оптимизация графики.\nСсылки на интернет ресурсы:\n-	Введение в Blender. Курс для начинающих.  Электронный ресурс . URL:  https://younglinux.info/blender/course (дата обращения 16.01. 2023 г.);\n-	 172+ бесплатных уроков в Blender: обучение 3d с нуля. URL: https://videoinfographica.com/blender-tutorials/ (дата обращения 16.01. 2023 г.);\n-	Видеокурс по Blender 3D.  Электронный ресурс. URL: https://4creates.com/training/104-uroki-blender-3d-rus.html (дата обращения 16.01. 2023 г.).\nЛитература: \nКронистер Дж. - Основы Blender. Учебное пособие (3-е издание) v. 2.49 – 2010 (PDF, RUS)."
            },
            'Сформировать ключевые компетенции в разработке дополненной реальности': {
                "module_name": "Технология дополненной реальности",
                "teori": "Обзор профильного ПО. Маркерная и безмаркерная технологии. Примеры AR-приложений. Знакомство со средой разработки Unity. Особенности, основные проблемы и способы их решения. Сборка и тестирование AR-приложений в Unity.",
                "practic": "Интерфейс, основные инструменты. Особенности установки программы и работы с ней. Создание и настройка сцены для работы с дополненной реальностью. Работа с видео в Unity. Импорт объектов из 3D-редакторов в Unity. Создание простейшего AR-приложения в Unity. Публичная презентация своей разработки. \nСсылки на интернет ресурсы:\n-	Руководство Unity [электронный ресурс] // URL: https://docs.unity3d.com/ ru/530/Manual/UnityManual.html (дата обращения: 12.02.2023);\n-	Репозиторий 3D-моделей [электронный ресурс] // URL: https://free3d.com (дата обращения: 26.02.2023);\n-	Видеоуроки по Unity и программированию на C# Unity [электронный ресурс] // URL: https://www.youtube.com/user/4GameFree (дата обращения: 23.02.2023).\nЛитература: \n-	Хокинг Джозеф Unity в действии. Мультиплатформенная разработка на С #.2-е межд. изд. – СПб.: Питер,2019. -352 с.: ил.-(Серия «Для профессионалов»)."
            },
            'Совершенствовать ключевые компетенции в разработки виртуальной реальности': {
                "module_name": "Технология виртуальной реальности.",
                "teori": "Изучение принципов работы с VR. Свойства и классификация VR. Анализ приложений для VR, выявление их плюсов и минусов, возможности улучшения. VR-устройства, их конструктивные особенности, управление. Информация о видах 360°-оборудования, история появления и развития технологий. Создание 360°-историй с помощью различных ресурсов. Принцип работы с программой видеомонтажа панорамных роликов. Основы работы в среде разработки Unity. Обзор интерфейса и основных инструментов. Основы программирования на С#. Инструменты разработки интерфейса (UX/UI).",
                "practic": "Создание собственного VR-устройства. Работа с профильным оборудованием. Монтаж и обработка фото и видео 360. Изучение заданных видео-уроков по теме. Создание виртуальных туров. Добавление ассетов. Работа с примитивами. Настройка материалов и текстур. Работа с освещением и камерой. Настройка физических свойства объектов. Создание простых проектов на основе готовых ресурсов. Изучение заданных видеоуроков по теме. Создание собственных сцен. Основы программирование в Unity. Разработка 3-х мерных объектов для интеграции в Unity.\nСсылки на интернет ресурсы:\n-	Торн А. Искусство создания сценариев в Unity [электронный ресурс] / А. Торн // URL: https://3dgame-creator.ru/catalog/download/skachat-knigi/iskusstvo-sozdaniyascenariev-v-unity2016/ (дата обращения: 25.02.2023);\n-	Программирование на C# в Unity для начинающих [электронный ресурс] // URL: https://unity3d.com/ru/learning-c-sharp-in-unity-for-beginners (дата обращения: 22.02.2023).\nЛитература:\n-	Маров М. Н. Моделирование трёхмерных сцен / М. Н. Маров. — СПб.: Питер, 2015. — 560 с.;\n-	Линовес Дж. Виртуальная реальность в Unity / Дж. Линовес; пер. с англ. Р. Н. Рагимов. — М.: ДМК Пресс, 2016. — 316 с."
            },
            'Сформировать навык разработки проектов VR/AR': {
                "module_name": "Проектная деятельность",
                "teori": "История и методология проектной деятельности. Сущность и жизненный цикл проекта. Методы генерации идей (метод мозгового штурма, метод обратного мозгового штурма, метод фокальных объектов). Методология целеполагания SMART. Инструменты организации и управления проектной работой (методология SCRUM, дизайн-мышление, электронные ресурсы). Основы питч.",
                "practic": "Упражнения по генерации идей. Оформление цели проекта по SMART. Определение задач проекта. Создание предварительного плана проекта. Использование электронных ресурсов управления проектной работой. Тестирование и защита итогового проекта."
            },

            'Сформировать представление о семейном бюджете и основах его планирования': {
                "module_name": "Семейный бюджет",
                "teori": "\tЧто такое деньги и откуда они взялись? Функция денег. Виды. Семейный бюджет, понятие, его составляющие. Доходы семьи. Типичные виды доходов и расходов. Источники доходов: заработная плата, социальные выплаты, доход от аренды, дополнительный заработок и др. Влияние инфляции на доходы.\n\tРасходы семьи: обязательные платежи, из чего они складываются. Потребительская корзина, ее составляющие. Прожиточный минимум. Экономия, оптимизация расходов. Воздействие рекламы и промоакций на принятие решений о покупке. \n\tФормы контроля расходов: планирование, учет затрат, их фиксация. Инструменты планирования и учёта: банковские приложения, приложения на смартфон. Накопления. Цели. Правила постановки целей. Личный финансовый план.",
                "practic": "\tДеловая игра «Финансовое бинго». В ходе игры у участников формируется представление о том, зачем вести семейный бюджет, какие бывают источники доходов и виды расходов, какие риски угрожают финансовому благополучию. Игра включает как соревновательный момент – кто быстрее заполнит игровые бланки с финансовыми терминами, так и кооперативный – для выигрыша участникам необходимо обсуждать друг с другом вопросы, связанные с финансовой грамотностью. Покрываемые темы: семейный бюджет и личный финансовый план, банки, риски и страхование. Методические материалы к игре https://vbudushee.ru/library/igra-finansovoe-bingo/ \n\tДеловая игра «Как тратить семейные деньги». В игре у детей формируется представление об источниках доходов, личном финансовом плане, а также о том, как защитить сбережения от инфляции. В ходе игры участники совершают серию выборов за персонажа, который стремится накопить на финансовую цель. Покрываемые темы: личный финансовый план. Методические материалы к игре https://vbudushee.ru/library/igra-kak-tratit-karmannye-dengi/ \n\tДеловая игра «Финансовый театр». Участникам предстоит подготовить яркую театральную постановку с альтернативным сценарием сказки, в которой все персонажи ведут себя финансово грамотно. Покрываемые темы: деньги – их виды и функции, доходы и расходы, финансовое мошенничество. Методические материалы к игре. https://vbudushee.ru/library/delovaya-igra-finansovyy-teatr/ \n\tДеловая игра «Семейный бюджет». Деловая игра представляет собой имитацию ведения бюджета семьи на протяжении нескольких месяцев. Участникам предстоит распределять финансовые ресурсы, реагировать на непредвиденные негативные события или наоборот счастливые возможности, влияющие на различные категории бюджета. Покрываемые темы: семейный бюджет, сбережения, риски, основы инвестирования, основы финансового планирования. Методические материалы к игре https://vbudushee.ru/library/delovaya-igra-semeynyy-byudzhet/\n\tНавигатор по образовательным продуктам фонда «Вклад в будущее». Этот проект создан командой Благотворительного фонда Сбербанка «Вклад в будущее» для родителей и детей. Его цель – создать ресурс для развития навыков XXI века у детей. Все методические материалы\ссылки  размещенные в данной программе, - это разработки данного фонда."
            },
            'Сформировать представление о роли банков в финансовом благополучии человека': {
                "module_name": "Банковские услуги",
                "teori": "\tФинансовые накопления. Назначение, стратегия накопления. Различие между сбережениями и инвестициями. Банковский вклад. Виды банковских вкладов. Доход по вкладу. Процентная ставка. Выбор банка, сберегательного вклада.\t\nЧто такое депозит? Проценты по депозитам. Преимущества и недостатки депозита.\t\nБанковская карта. Польза и риски банковских карт. Хранение, обмен и перевод денег. Различные виды платежных средств. Формы дистанционного банковского обслуживания. Применение пластиковых карт в расчетах и платежах. Виды банковских карт (дебетовая и кредитная), различие между ними. Выбор банковской карты. Дисконтная карта. Товары потребительского назначения длительного пользования, краткосрочного пользования и бытовые услуги.\t\nБанковский кредит, его основные характеристики. Виды кредитов. Эффективная ставка процента по кредиту. Полная стоимость кредита. Выгода при выборе кредита, как ее осуществить. Вычисления по уменьшению стоимости кредита. Типичные ошибки при использовании кредита. Когда и как семья может позволить себе кредит? Виды кредитов для физических лиц, различие в процентной ставке. Микрозаймы. Ипотека. Договор. Рефинансирование кредита. Кредитная история.",
                "practic": "\tДеловая игра «Личный финансовый план». Игра знакомит участников с темой личного финансового планирования, учит обращать внимание на риски, принимать решения по расходам и накоплениям. Покрываемые темы: личный финансовый план, банковские инструменты (депозит), страхование (рисковое), инструменты фондового рынка (акции, облигации). Методические материалы к игре. https://vbudushee.ru/library/delovaya-igra-lichnyy-finansovyy-plan/\n\tПриложение «Вклад». Позволяет играя прокачать навыки финансовой грамотности. Игра симулирует 10 лет жизни, за которые необходимо заработать как можно больше с помощью различных финансовых инструментов. Игрок изучит новые финансовые инструменты, поймёт механизм работы банков, страховых компаний, брокерских компаний, биржи. В процессе игры придётся разрабатывать собственную финансовую стратегию, проявлять гибкость, меняя её при необходимости. Приложение можно скачать в Googl Play\App Store. Больше узнать об игре https://fingame.vbudushee.ru/ \n\tНавигатор по образовательным продуктам фонда «Вклад в будущее». Этот проект создан командой Благотворительного фонда Сбербанка «Вклад в будущее» для родителей и детей. Его цель – создать ресурс для развития навыков XXI века у детей. Все методические материалы\ссылки  размещенные в данной программе, - это разработки данного фонда."
            },
            'Сформировать знания в области налогообложения и социальных выплат для физических лиц': {
                "module_name": "Налогообложение и социальные выплаты",
                "teori": "\tЧто такое налоги и почему их нужно платить. История налогообложения в России. \n\tВиды налогов и сборов, установленных в Российской Федерации Налоговым кодексом. Прямые и косвенные налоги. Прямые налоги физических лиц: налог на доходы (НДФЛ), имущественный, транспортный, на землю. Косвенные налоги – НДС. Идентификационный номер налогоплательщика.\n\tДоходы, не подлежащие налогообложению: государственные пособия, пенсии, стипендии, вознаграждения донорам за сданную кровь, материальной помощи, оказываемой в связи со стихийным бедствием или другим чрезвычайным обстоятельством, компенсационные выплаты.\n\tНалоговые вычеты: стандартные, социальные, инвестиционные, имущественные, профессиональные.\n\tЧто такое государственные социальные выплаты. Социальные пособия, кому они предоставляются. Федеральные и региональные социальные выплаты. Условия назначения. Региональные выплаты. Пособие по безработице, по временной нетрудоспособности, детские пособия, по инвалидности, многодетным семьям, малоимущим. Прожиточный минимум. Минимальный размер оплаты труда (МРОТ). Что такое пенсия. Государственная пенсионная система, формирование личных пенсионных накоплений. Как сделать пенсию достойной.",
                "practic": "\tДеловая игра «Финансовые колонизаторы». Интерактивная викторина, в ходе которой участники становятся разведчиками-исследователями. Их цель - выяснить, как устроена жизнь в других крепостях. А важная часть жизни - это, конечно, финансы. Благодаря разведданным игроки узнают, какие источники доходов и расходов семьи существуют, и какие налоги необходимо платить семье. За каждый правильный ответ команда завоевывает часть карты. Покрываемые темы: семейный бюджет и личный финансовый план, банки, риски и страхование, налоги и социальные выплаты.  https://vbudushee.ru/library/igra-finansovye-kolonizatory/ \n\tДеловая игра «Блеф-клуб» Игра формирует представление о том, какие налоги необходимо выплачивать семье, каковы последствия невыплаты налогов. Механика игры построена по принципу «верю – не верю»: если игрок верит и правильно угадывает факт про налоги, на его счет начисляются баллы. Покрываемые темы: налоги и социальные выплаты. Методические материалы к игре https://vbudushee.ru/library/igra-blef-klub/\n\tНавигатор по образовательным продуктам фонда «Вклад в будущее». Этот проект создан командой Благотворительного фонда Сбербанка «Вклад в будущее» для родителей и детей. Его цель – создать ресурс для развития навыков XXI века у детей. Все методические материалы\ссылки  размещенные в данной программе, - это разработки данного фонда."
            },
            'Сформировать знания по основам финансовой безопасности': {
                "module_name": "Основы финансовой безопасности",
                "teori": "\tВиды финансовых рисков на жизненном пути человека. Опасности. Безопасность. Регулирование, саморегулирование на рынке финансовых услуг. \n\tФинансовое мошенничество. Виды финансового мошенничества.  Защита от мошеннических действий с банковскими картами. Правила поведения при первых признаках финансового мошенничества. Первые действия при утере банковской карты.\n\tСпособы сокращения финансовых рисков. Договор – основной документ на рынке финансовых услуг. Права и обязанности клиента банков. Страховой рынок. Чем поможет страхование. Финансовая система обязательного социального страхования. Задачи и принципы страхования. Страховой случай, страховая премия, страховая выплата, договор страхования. Страховая компания. Виды страхования: страхование гражданской ответственности, страхование имущества, обязательное страхование, добровольное страхование, ОСАГО, КАСКО, франшиза, личное страхование, обязательное медицинское страхование (ОМС), добровольное медицинское страхование, страхование жизни.",
                "practic": "\tДеловая игра «СтрахOFF или как защититься от рисков». В игре живого действия участники знакомятся с принципами работы страховой компании и видами страхования. Игра формирует понимание существующих рисков потери денег и защиты от них при помощи страхования. Покрываемые темы: риски и страхование. Методические материалы к игре https://vbudushee.ru/library/igra-strakhoff-ili-kak-zashchititsya-ot-riskov/ \n\tДеловая игра «Защита прав потребителей». Участники играют за юридическую компанию, к которой обратился клиент с жалобой на нарушение своих прав как потребителя финансовых услуг. В первой части участники выслушивают запросы потенциальных клиентов, считывают их эмоции и определяют потребности, а во второй - после того, как команда привлекла клиента - проводят разбор ситуации с точки зрения защиты прав потребителя и представляют решение. Покрываемые темы: защита прав потребителей финансовых услуг, защита от мошенничества на финансовом рынке. Методические материалы к игре https://vbudushee.ru/library/delovaya-igra-zashchita-prav-potrebiteley/\n\tНавигатор по образовательным продуктам фонда «Вклад в будущее». Этот проект создан командой Благотворительного фонда Сбербанка «Вклад в будущее» для родителей и детей. Его цель – создать ресурс для развития навыков XXI века у детей. Все методические материалы\ссылки  размещенные в данной программе, - это разработки данного фонда."
            },

            "Сформировать интерес к программированию.": {
                "module_name": "Введение в программирование",
                "teori": "Правила работы в сети Интернет. Краткая история языков программирования. Понятие «программа», «программирование», «язык программирования». Применение программирования в различных сферах жизни человека, значение информационных технологий в жизни современного человека. Демонстрация примеров проектов, сделанных на языке Python. Основные понятия программирования: исполнитель, система команд, алгоритм, программа, среда разработки, интерпретатор, код программы и редактор кода. Ввод-вывод в программе, условный оператор, оператор цикла с предусловием. Простейшие программы с использованием условного оператора if, оператора циклов while и операторов ввода-вывода. Технология разработки программы.",
                "practic": "\nРешение задач. \nСсылки на интернет ресурсы:\n\t	Сборник задач с решениями по программированию на языке Python.  Электронный ресурс . URL:  https://smartiqa.ru/python-workbook (дата обращения 08.11. 2022 г.);\n\t	 Задачи на Python.  Электронный ресурс . URL: https://pythonworld.ru/osnovy/tasks.html  (дата обращения 08.11. 2022 г.);\n\t	 Python :: Задачи .  Электронный ресурс . URL: https://okpython.net/python/python_zadachnik/python_zadachnik.html (дата обращения 08.11. 2022 г.).\nЛитература: \n\t	Зед А. Шоу Легкий способ выучить Python / 2017 , стр.354\n\t	Ричардсон, Крэйг Программируем с Minecraft. Создай свой мир с помощью Python / пер. с англ. Станислава Ломакина — М.: Манн, Иванов и Фербер, 2017, стр.368;\n\t	Стивенсон Б. Python. Сборник упражнений / пер. с англ. А. Ю. Гинько. – М.: дмк. Пресс, 2021, стр. 238. "
            },

            "Научить основам программирования на Python.": {
                "module_name": "Базовые конструкции языка Python",
                "teori": "Понятие о языке высокого уровня Python. Структура программы, переменные и константы, работа с числовыми переменными, арифметические операторы в Python. Основные управляющие конструкции алгоритмов с ветвлением в Python. Устройство циклов for. Основные управляющие конструкции циклического алгоритма в Python. Простейшие циклы и циклы с переменными. Работа со списками, строками, множествами и кортежами в Python. Понятие итератора. Понятие подпрограммы, процедуры, функции. Функции в Python.",
                "practic": "\nРешение задач.\nСсылки на интернет ресурсы:\n\t	Сборник задач с решениями по программированию на языке Python.  Электронный ресурс . URL:  https://smartiqa.ru/python-workbook (дата обращения 08.11. 2022 г.);\n\t	 Задачи на Python.  Электронный ресурс . URL: https://pythonworld.ru/osnovy/tasks.html  (дата обращения 08.11. 2022 г.);\n\t	 Python :: Задачи .  Электронный ресурс . URL: https://okpython.net/python/python_zadachnik/python_zadachnik.html (дата обращения 08.11. 2022 г.).\nЛитература: \n\t	Зед А. Шоу Легкий способ выучить Python / 2017 , стр.354\n\t	Ричардсон, Крэйг Программируем с Minecraft. Создай свой мир с помощью Python / пер. с англ. Станислава Ломакина — М.: Манн, Иванов и Фербер, 2017, стр.368;\n\t	Стивенсон Б. Python. Сборник упражнений / пер. с англ. А. Ю. Гинько. – М.: дмк. Пресс, 2021, стр. 238. "
            },

            "Сформировать навык разработки проектов на  Python": {
                "module_name": "Решение прикладных задач в Python",
                "teori": "Основные этапы разработки проекта. Понятие ассоциативного массива. Словари в Python. Модули в Python. Подключение и использование модулей стандартной библиотеки. Модульный принцип компоновки программы. Работа с документацией в стандартной библиотеке. Понятие репозитория различных пакетов Python. Работа с внешними библиотеками Python и утилитой pip. Основы объектно-ориентированного программирования. ",
                "practic": "\nРешение задач.\nСсылки на интернет ресурсы:\n	Сборник задач с решениями по программированию на языке Python.  Электронный ресурс . URL:  https://smartiqa.ru/python-workbook (дата обращения 08.11. 2022 г.);\n	 Задачи на Python.  Электронный ресурс . URL: https://pythonworld.ru/osnovy/tasks.html  (дата обращения 08.11. 2022 г.);\n	 Python :: Задачи .  Электронный ресурс . URL: https://okpython.net/python/python_zadachnik/python_zadachnik.html (дата обращения 08.11. 2022 г.).\nЛитература: \n	Зед А. Шоу Легкий способ выучить Python / 2017 , стр.354\n	Ричардсон, Крэйг Программируем с Minecraft. Создай свой мир с помощью Python / пер. с англ. Станислава Ломакина — М.: Манн, Иванов и Фербер, 2017, стр.368;\n	Стивенсон Б. Python. Сборник упражнений / пер. с англ. А. Ю. Гинько. – М.: дмк. Пресс, 2021, стр. 238. \nРазработка проекта по индивидуальному заданию, составление отчёта о выполнении индивидуальной или совместной работы. Тематика самостоятельных работ: \n• задачи, в которых по заданному алгоритму необходимо написать программу;\n• задачи, в которых необходимо составить алгоритм решения и написать по нему программу; \n• задачи, для решения которых необходимо найти некоторую информацию в Интернете.\nУчастие в конкурсах и олимпиадах по программированию муниципальных/краевых уровней."
            },

            "Совершенствовать ключевые компетенции   программирования на Python": {
                "module_name": "Олимпиадное программирование. ",
                "teori": "Что такое олимпиадное программирование. Виды соревнований по программированию. Техника программирования. Эффективность. Сортировка и поиск. Структуры данных. Динамическое программирование. Алгоритмы на графах. Избранные вопросы проектирования алгоритмов. Запросы по диапазону. Алгоритмы на деревьях. Математика для программистов (теория чисел, комбинаторика, матрицы, теория вероятности, теория игр). Дополнительные алгоритмы на графах. Алгоритмы работы со строками.",
                "practic": "\nРешение задач.\nРазбор задач с олимпиад.  Электронный ресурс .URL:  http://olymp-programming.blogspot.com/p/blog-page_16.html (дата обращения 08.11.2022 г.);\nОткрытая олимпиада по программированию.  Электронный ресурс .URL:  https://olympiads.ru/zaoch/ (дата обращения 08.11.2022 г.);\nРесурсы по информатике хабаровской краевой заочной физико-математической школы.  Электронный ресурс .URL:  http://school-collection.edu.ru/catalog/rubr/7d5f9dcd-3c0e-c52c-0181-ed064bbfa22d/86787/  (дата обращения 08.11.2022 г.) "
            },

            "Изучить основы музейного дела":  {
                "module_name": "Введение в музейное дело",
                "teori": "\tИстория появления и развития музеев. Музей как феномен культуры. Известные музеи мира. Основные понятия и термины музееведения: экспонаты, коллекции, фонды, экспозиция, экскурсия, и т.д. Классификация музеев по масштабам деятельности, по форме собственности, по административно-территориальному признаку, по профилю. Типы музеев. Основные направления научных исследований. Школьный музей – тип, вид, функции, история возникновения, экспозиции. Принципы построения экспозиции, ее отличие от выставки.  Теоретические основы построения экспозиции музея Мероприятия и направления исследовательской работы школьного музея.",
                "practic": "\tВиртуальная экскурсия в мировой музей. Экскурсия в местный музей (по возможности). Изучение экспозиций школьного музея, их классификация. Разработка перспективных направлений исследовательской работы музея. Планирование новых экспозиций на основе календаря исторических знаменательных дат. Сбор материалов для экспозиций (поисковая работа).\n\tОформлении экспозиции школьного музея."
            },

            "Познакомить с правилами комплектования и работы с музейными фондами":  {
                "module_name": "Музейные фонды",
                "teori": "\tПонятие фонды музея. Комплектование фондов. Вещь музейного значения — музейный предмет — экспонат. Принципы отбора мзейных предметов. Коллекции: характеристика и описание. Фондовый учет музейных предметов. Учетная документация. Условия сохранности музейных предметов. Режим хранения. Фотография, как экспонат.\n\tУчёт и хранение – деление на фонд музейных предметов и фонд научно-вспомогательных материалов. Этапы учёта музейных фондов. Требования к температурному, влажностному, световому, биологическому и другим режимам хранения.",
                "practic": "\tПрактическая работа: знакомство с фондами краеведческого музея. Сбор материалов с выездом на местность их оформление. Составление летописи села\поселка. Полевой дневник. \n\tСбор объективной информации о предмете: форма, цвет, размер, структура, материал. Создание карточки учета музейного предмета\экспоната. Заполнение журналов учёта и хранения музейных предметов. Создание и оформление мини-экспозиций (5-6 экспонатов)\n\tВикторины и кроссворды на музейную тематику. на основе анализа музейного экспоната. Обработка исторических фотографий в компьютерных программах."
            },

            "Научить основам экскурсионной работы":  {
                "module_name": "Музейная экскурсия",
                "teori": "\tМесто экскурсии в работе музея. Классификация экскурсий. Постановка цели определяющая ее содержание. Тема - стержень, объединяющий объекты экскурсии в единое целое. Изучение литературы и составление библиографии. Работа над содержанием экскурсии. Выбор объектов и составление маршрута. Содержание экскурсии. Методические приемы показа и рассказа в экскурсии.\n\tРабота над текстом экскурсии с применением различных источников.\n\tОсновные приемы ведения экскурсии. Использование технических средств во время экскурсии.\n\tПроведение экскурсии по стендам. Проведение экскурсии по экспонатам",
                "practic": "Разработка экскурсии по школьному музею\ по местным достопримечательностям в соответствии с требованиями. Составление маршрута экскурсии и текста экскурсовода.  Проведение экскурсий. Участие в конкурсе экскурсий."
            },

            "Организовать исследовательскую деятельность в школьном музее":  {
                "module_name": "Исследовательская деятельность в школьном музее",
                "teori": "Основные формы, методы исследовательской деятельности применимые в рамках музейной\краеведческой работы. Полевой дневник, как форма оформления исследования. Музейный артефакт как основа исследования. Основные компоненты исследования: проблема, тема, актуальность, объект, предмет, гипотеза, цель, задачи. Методы исследования. Алгоритм работы над исследованием: выбор темы исследования, процесс исследования объекта, оформление.",
                "practic": "Исследовательская работа по теме: «Летопись школы». От исследования к проекту. Подготовка исследовательских и проектных работ на конкурсы. Выставка исследовательских работ. Участие в краеведческой конференции."
            },

            "Сформировать общее представление о журналистике и особенностях профессии «журналист»":  {
                "module_name": "Введение в журналистику и профессию «журналист»",
                "teori": "\nПонятие журналистика и СМИ. История журналистики. Роль масс-медиа в формировании общественного мнения. Виды журналистики: периодическая печать, фотожурналистика, радиожурналистика, тележурналистика и Интернет-журналистика. Характеристика групп СМИ.\nТрадиционные и новые виды медиа, их преимущества и недостатки. \nТребования к информации, представляемой в СМИ: достоверность, актуальность. Способы подачи информации. Этика и культура журналиста.\nРедакция – сердце СМИ. Профессии в журналистике.  Профессия «журналист». Качества, необходимые журналисту. Залог успеха в журналистской профессии. Журналистское образование: ВУЗы, требования при поступлении, перспективы.",
                "practic": "\nИгры на знакомство и снятие коммуникативных барьеров.\nДеловая игра «Трансформация информации» («испорченный телефон»).\nЭкскурсия в редакцию любого СМИ. \nДеловая игра «Редакция» на погружение в особенности разных профессий, связанных с журналистикой: ведущий программ и новостей, диктор, режиссер, оператор, дизайнер, инженер видеомонтажа, звукорежиссёр, корреспондент, монтажер.  \nСоставление иерархии профессиональных качеств журналиста. Диагностика профессиональных наклонностей в профессии журналист."
            },

            "Познакомить с направлением журналистики «периодическая печать»":  {
                "module_name": "Основы направления журналистики «периодическая печать»",
                "teori": "\nВиды периодической печати: газеты, журналы, издания научных сообществ, ежегодники, информационные бюллетени и другое. Ее функции.\nТекст – основа печатных изданий. Основные понятия, которыми оперируют журналисты, пишущие статьи (лид, чердак, деза и др.).\nЖанры печатной журналистики. Информационные жанры в газете и их краткая характеристика: информация и заметка, интервью, беседа, репортаж, отчет, соцопрос. Аналитические жанры: статья, рецензия. Художественно-публицистические жанры: очерк, фельетон, эссе.\nРазновидность стилей написания. Как выбрать и сформулировать тему. Как сделать любой текст увлекательным, живым и понятным. «Сильные» и «слабые» тексты.\nЗачем структурировать текст? Последовательное и параллельное повествование, прием от «простого к сложному». Заголовки.\nЭффект присутствия: свидетельство очевидцев, прямая речь, диалоги, обращение к деталям описания, эмоциональное состояние автора.  Фото в газете, как подобрать и сделать. \nРабота редакции «Печатного издания». Планирование и подготовка номера. Функции редактуры. Программы для верстки газеты и разработки дизайна печатного издания. Верстка и макетирование газеты.",
                "practic": "\nВстреча с журналистом местной газеты (можно онлайн). \nЭкскурсия в редакцию газеты (по возможности) \nПрактикум «Социальные опросы».  Практикум «Интервью»\nПрактикум по написанию новостных заметок. Работа над информационным сюжетом: выбор идеи, определение жанра, определение технологии сбора информации.\nВыпуск школьной газеты: от создания статьи до дизайна номера.  Работа в программах для верстки газеты \nПроба пера в местных печатных изданиях."
            },

            "Научить основам фотожурналистики":  {
                "module_name": "Основы фотожурналистики",
                "teori": "\nВведение в фотожурналистику.\nЖанры фотографии. Основы фотосъемки. Профессиональное оборудование и работа с ним. Правила фотосъемки. Фокусировка, экспозиция, выдержка, диафрагма. \nПостроение кадра, ракурсы. Золотое сечение (правило третей), композиционные приёмы, кадрирование, планы (ближний, дальний, деталь). Глубина изображения.\nЗначение света для фотографии. Фотографирование при сильном освещении, избавление от пересвета. Использование вспышки. «Золотой час». \nПрограммы обработки фотографий.  Ретушь фотографий с помощью программы Adobe Photoshop, Adobe Lightroom. \nОсновы композиции. Секреты выразительности фотопортрета. Работа с фотографией. Основы позирования во время фотосессии. \nМобильная фотография. Правила мобильной фотографии. Настройка камеры телефона. Фокус/фиксация фокуса. «Цвет» на фотографии. ",
                "practic": "\nЭкскурсия в фото студию (по возможности). \nПредметная фотосъемка. Фотосъемка на улице. Портретная фотосъемка. Сюжетное фото. Редактирование с помощью компьютерных программ Adobe Photoshop, Adobe Lightroom. \nПодготовка фотовыставки. Конкурс фотографий."
            },

            "Научить основам тележурналистики":  {
                "module_name": "Основы тележурналистики ",
                "teori": "\nТележурналистика как самый массовый способ распространения информации. Форматы тележурналистики.\nТелевизионный язык: умение рассказывать «картинками». Основные понятия в тележурналистике. Классификация видеосюжетов по тематике и жанрам. \nРепортаж – ведущий жанр тележурналистики. Определение, виды. Структура новостного сюжета. Порядок работы над сюжетом: выбор темы (инфоповод), первичный сбор информации, синопсис. Текст, принципы его подготовки. Структура и композиция репортажа.  Stand-up и синхрон в репортаже. Взаимодействие корреспондента и оператора. \nИнтервью, подготовка вопросов, требования к вопросу. Этика журналиста: поведение вовремя и после интервью. ",
                "practic": "\nРабота над новостным сюжетом. Составление сценария видеосюжета, закадрового текста, подбор музыкального оформления. Выбор плана при съемке человека. Запись «подводки» для ведущего выпуска новостей. Расчёт хронометража видеосюжета выпуска новостей. Съемка новостного сюжета и его озвучание. Создание титров и заставок. \nОрганизация, подготовка вопросов, сьемка и проведение интервью.\n«Мобильный репортёр» - съемка и монтаж видео с помощью смартфона. Подготовка сюжета о событиях, происходящих в школьной жизни. Запись и монтирование видеосюжетов. "
            },

            "Научить основам операторского мастерства и видеомонтажа":  {
                "module_name": "Основы операторского мастерства и видеомонтажа",
                "teori": "\nВзаимодействие оператора и журналиста при съемке репортажа. \nПравила работы с видеокамерой. Алгоритм работы оператора при съемке телесюжета. Съемки в особых условиях освещенности. Композиция кадра. Свет и цвет в кадре. Техника операторского освещения. Съемка подвижной камерой. Съемка движущихся объектов. Съемка одиночных объектов и людей. \nТехнология монтажа видеосюжетов для выпуска новостей и телепередач. Основные правила и меры безопасности при обращении с компьютером. Программы для обработки и просмотра видеофайлов. Технология нелинейного видеомонтажа. Основы работы в программах монтажа видео. Работа с программами Windows Movie Maker, Sony Vegas Pro, Adobe Premiere Pro. Популярные приемы монтажа. Типы склеек. Популярные типы переходов в программе. Цветокоррекция. Кодеки и форматы видео. Экспорт и хранение видео.",
                "practic": "Съемка разных типов объектов на видеокамеру. Панорамная сьемка. Переход фокуса. Движение камеры. Сьемка видеосюжетов. Работа в программах по обработке видеофайлов: обрезка, монтаж. "
            },

            "Научить основам радиожурналистики":  {
                "module_name": "Основы радиожурналистики",
                "teori": "\nОсобенности журналистской деятельности на радио. Жанры радиожурналистики. Способы установления контакта с радиослушателями. Особенности составления контента для радио. Требования, предъявляемые к тексту радионовостей и составных элементов радиопередач. \nПонятие «Джингл». Реклама на радио. Техническое оснащение радиоэфира.\nРабота звукорежисера. Запись радиопередач на диктофон. Ведение прямого радиоэфира. Создание подкастов. Установка логической взаимосвязи между элементами радиопередачи.\nЗнакомство с программой «Adobe Audition». Основы работы с компьютерной техникой, правилами ее эксплуатации. Монтирование радиовыпуска.",
                "practic": "\nПрактикум «Создание радиоэфира» - составление плана радиоэфира; выбор тем (рубрик); распределение обязанностей; подготовка материала для радиоэфира; поиск участников, проведение интервью; запись радиоведущих и рекламных сообщений; запись «связок» для соединения отрывков из синхронов. \nРазработка и запись джинглов.\nВыпуск подкаста.\nПрактикум «Монтирование радиопередачи в профессиональных программах Adobe Audition»."
            },

            "Познакомить с формами интернет-журналистики":  {
                "module_name": "Интернет-журналистика",
                "teori": "\nИнтернет как наиболее эффективный канал передачи информации, и конкурент традиционным печатным изданиям.  Интернет-журналистика и ее формы: \n- сайты, мобильные приложения, \n- блоги (авторские и коллективные);\n- каналы в мессенджерах (в частности Телеграм-каналы);\n- подкасты;\n- каналы, аккаунты и группы в социальных сетях;\nСайт как СМИ. Особенности и специфика интернет-изданий. Понятие WEB 2.0.   Коллективное взаимодействие в современных информационных системах. Инструменты создания информационных объектов для Интернета.\nТренды и возможности Telegram, VK, как источника информации. Возможности Интернета для проведения соцопросов.\nПрофессия – блоггер. Кто это? Оригинальность и полезность. Видеоблогинг. Что такое «видеоблог». Виды и тематика видеоблога. Выбор платформы и их особенности. Выбор контента для видеоблога. Социальные блоги. ",
                "practic": "Анализ интернет-изданий. Поиск информации на заданную тему. Её использование при подготовке статьи, сюжета.  Факты или слухи. Критический подход и способы проверки фактов на подлинность. \nПодготовка и проведение соцопроса в Интернете на актуальную тему. \nРазработка и ведение страницы своего объединения (медиацентра) в VK. Определение целевой аудитории и тематики\направления. Создание контента для страницы.\nTelegram, как СМИ. Создание телеграмм-канала. Разработка чат-бота."
            },

            "Познакомить с основами организации работы медиацентра в школе":  {
                "module_name": "Организация работы медиацентра школы",
                "teori": "\nСтруктура и схема работы центра. Его место и роль в жизни школы. Критический подход к источникам информации. Фактчекинг, принципы: независимость, объективность, беспристрастность, точность. Правила медиабезопасности. \nРабота с сайтом, регистрация на сайте, навигация по проектам. Контент-план. Информационные цифровые ресурсы по распространению контента.\nТехническое оснащение информационно-медийной работы.\nСоздание и продвижение медиапроектов.",
                "practic": "\nВедение информационной\новостной  страницы на сайте. \nКоординация деятельности всех направлений медиацентра.\nСоставление контент-плана по решению определенной задачи.\nРабота с оборудованием медиацентра (исходя из его наличия).\nРазработка и реализация медиапроекта."
            },

            "Сформировать интерес к программированию": {
                "module_name": "Введение в мир компьютеров и программирования",
                "teori": "ТБ и правила поведения в объединении. История возникновения компьютеров, зачем нужен ПК. Простейшие понятия о Материнской плате, Процессоре, Винчестере. Простейшие понятия о дополнительных устройствах ПК. Знакомство с исполнителем и средой программирования. Элементы окна среды программирования. Спрайты. Хранилище спрайтов. Понятие команды. Разновидности команд. Структура и составляющие скриптов - программ, записанных языком Scratch. Система команд исполнителя Scratch. Структура и составляющие скриптов - программ, записанных языком Scratch. Понятие анимации. Основные принципы движения. Звуки и сообщения. Хранилище проектов. Демонстрация примеров проектов, сделанных в среде Scratch. Правила работы в сети Интернет.",
                "practic": "Игры на знакомство, сплочение и командообразование. Ориентирование на плоскости монитора. Изучение состава клавиатуры. Клавиатурный тренажер. Создание файлов и папок, копирование, перемещение объектов файловой системы. Поиск файлов. Знакомство со средой Scratch. Понятие спрайта и объекта. Создание и редактирование спрайтов и фонов для сцены. Поиск, импорт и редакция спрайтов и фонов из Интернет. Управление спрайтами: команды Идти, Повернуться на угол, Опустить перо, Поднять перо, Очистить. Представление об условиях («если нажать на...») и десятичных долях (минуты, секунды, доли). Составление первой элементарной программы и сохранение ее на жестком диске компьютера. Доработка сохраненной программы добавление звуков и сообщений. Создание проектов в среде Scratch:«Аквариум с рыбками», «Играем на пианино и других музыкальных инструментах», «Анимированная открытка в среде Scratch». Регистрация на сайте сообщества Scratch по адресу: http://scratch.mit.edu/signup ."
            },

            "Научить основам алгоритмизации  и языка программирования Scratch": {
                "module_name": "Основы алгоритмизации. Линейный и условные алгоритмы",
                "teori": "Правила работы в сети Интернет. Тренды развития IT отрасли. Обзор языков программирования. Знакомство с понятиями «информация» и «команда». Алгоритмизация в жизни человека. Понятие исполнителя, алгоритма и программы, их назначение, виды и использование. Понятие «алгоритм», его свойства, способы записи. Блок-схемы. Виды алгоритмов. Линейный алгоритм. Работа с переменными. Условные алгоритмы. Координатная плоскость. Точка отсчета, оси координат, единица измерения расстояния, абсцисса и ордината. Анимация, как создается движение в кино. Основные этапы разработки проекта.",
                "practic": "\nСоздание простой игры с использованием переменных. Решение математических задач (линейный алгоритм). Решение математических задач (условный алгоритм). Создание презентации в Scratch.  Организация диалога между спрайтами. Работа со звуком. Навигация в среде Scratch. Определение координат спрайта. Решение практические задачи на положение в пространстве. Проект «Координатный кот». Проект «Бег по кругу». Анимация в среде Scratch с помощью смены костюмов.\nСообщения. Синхронизация событий через сообщения. Синхронизация событий с помощью таймингов и сообщений. Запуск нескольких скриптов по одному событию. Дизайн проекта. Свободное проектирование. Планируем и делаем мультфильмы и комиксы."
            },

            "Сформировать навык разработки проектов в среде Scratch": {
                "module_name": "Алгоритмизация и циклические алгоритмы",
                "teori": "Циклические алгоритмы. Знакомство с понятием «цикл». Когда применять циклы. Какими бывают циклы. Чем отличается цикл от повторяющегося действия. Вложенные циклы. Ветвления программ, альтернативные действия. Конструкции «если то» и «пока не». Списки. Понятие «список» в среде Scratch. Подпрограммы. Раздел «Другие блоки», создание блока, параметры блока",
                "practic": "Выполнение проектов с циклами в Scratch. Выделение повторяющихся действий в специальные блоки. Работа со списками. Создание подпрограмм. Разработка индивидуального или группового проекта в среде Scratch. Типы проектов, выполняемых в среде Scratch: музыкальный проект; анимация; комикс; интерактивная игра; графика; с элементами искусственного интеллекта; учебная презентация; учебная модель, демонстрационный эксперимент; обучающая программа. Участие в конкурсах и олимпиадах по программированию в среде Scratch муниципальных/краевых уровней."
            },

            "Совершенствовать ключевые компетенции программирования в Scratch": {
                "module_name": "Программирование в Scratch. Продвинутый уровень",
                "teori": "Повторение основных команд в среде программирования Scratch. Использование переменных и эффектов, случайных чисел для автоматической генерации процесса игры и проверки результата. Программирование движения тела, брошенного под углом, операции над числами и работа с формулами в среде Scratch. Изучение последовательности чисел Фибоначчи, работа с изменениями переменных в цикле. Создание счетчика правильных и неправильных ответов. Списки для записи ответов и вопросов. Оптимизация программного кода. Методы сортировки списка чисел. Формирование/хранение/редактирование рейтинга в играх. Разделение текста на слова, анализ введенного текста с клавиатуры. Использование команд в среде программирования Scratch для обработки текстовых данных в цикле. Блок Scratch, как функция. Добавление и изменение аргументов функции. Понятие скроллинг и его применение в играх Scratch. Применение собственных блоков для оптимизации программного кода. Облачные переменные и их преимущества. Создание 3D-эффекта с помощью пера и рисования. Создание эффекта 3D-движения героя, изменяя окружающие предметы. Сбор и запоминание данных о предметах в игре, их редактирование. Программирование столкновений со стенками. Использование видеодвижения на нескольких спрайтах. Параллельная проверка событий нажатия клавиш. Выбор случайного костюма с помощью чисел.",
                "practic": "Рассмотрение различных способов программирования навигации. Использование спрайта, как датчика. Проект «Робот-пылесос». Решение и визуализация задачи Фибоначчи. Создание программы для сортировки пузырьком. Создание джойстика для игр на Android. Решение задач (тренажер печати, шифратор и другие). Рисование фракталов. Разработка 2D-платформера. Создание игры для нескольких пользователей. Игра «3D-лабиринт». Игра «Гонки». Игра «Квест». Разделение каждого нажатия мышки, подсчет количества кликов. Случайное появление объектов с течением времени и их изменение во время игры. Использование изученных команд для создания игры «Секретный подарок». Создание «эффекта корзины» в игре. Участие в международной Scratch-олимпиаде по креативному программированию."
            },

            'Сформировать общее представление о театре':  {
                "module_name": "Знакомство с театром",
                "teori": "\nВведение в программу.\nИстория возникновения и создания театра. Театр как вид искусства. Виды и жанры театрального искусства.\nПравила поведения в театре. Театральный этикет.\nСтруктура театра. Театральные профессии, их специфика: актер, режиссер, сценарист, художник, декоратор, гример, оператор, звукорежиссер, бутафор.",
                "practic": "\nИгры на знакомство. Заполнение анкеты участника театральной студии. Игра «Что я знаю о театре», «Мы идем в театр». Тест «Какой я зритель». Посвящение в «театральные зрители». \nЭкскурсия «Театральное закулисье» (реальная или виртуальная, интерактивно в диалоге). Сценический этюд «Профессии театра».\nСовместный просмотр спектакля в профессиональном театре или телеспектакля с дальнейшим его обсуждением. "
            },

            'Научить основам актерского мастерства':  {
                "module_name": "Основы актерского мастерства",
                "teori": "Особенности актерской профессии: мышечная свобода, сценическое внимание, память, наблюдение, воображение, фантазия, придумка. Сценическое внимание как способность видеть, слышать, воспринимать, ориентироваться и координироваться в сценическом пространстве.\nПеремена отношения (к предмету, месту действия, партнеру).\nСценическое действие. Сценическая задача и чувство. \nФизическое самочувствие. Коллективная согласованность действий. Правила и принципы партнерского взаимодействия. Техника безопасности в игровом взаимодействии. Оценки факта, сценического общения. \nЭлементы сценического действия. Бессловесные элементы действия. «Вес», «оценка», «пристройка».  \nСловесные действия. Способы словесного действия. Логика действий и предлагаемые обстоятельства. Связь словесных элементов действий с бессловесными действиями. \nСоставные образа роли. Драматургический материал как канва для выбора логики поведения.",
                "practic": "\nУпражнения на раскрепощение и развитие актерских навыков. \nУпражнения на развитие "
                           "сценического внимания, внутреннее и внешнее внимание. Упражнения на развитие зрительного "
                           "внимания «Повтори позу», «Кто во что одет», «Сколько фонарей от школы до дома?» и др. "
                           "Упражнения на развитие слухового внимания и других сенсорных умений. \nУпражнения на "
                           "развитие фантазии на основе реальных образов природы, переноса в нереальные миры, "
                           "через овладение динамикой развития сюжета. Этюды на тему, фантазии на тему "
                           "картин.\nУпражнения на подражание голоса. Этюд «Птичий переполох». Упражнения на "
                           "звукоподражание. Выполнение упражнений «Угадай шумы», «Радио» и т.д.\nИгры на развитие "
                           "чувства пространства и партнерского взаимодействия, коллективные коммуникативные игры. "
                           "Упражнения на коллективные действия «Повтори позу», «Опаздывающее зеркало» и др. Этюды на "
                           "взаимодействие с партнером. Индивидуальные и коллективные этюды на выполнение одного и "
                           "того же действия, но с разными задачами; одной и той же задачей, но в разных "
                           "обстоятельствах.\nУпражнения и этюды на практическое освоение словесного и бессловесного "
                           "действия.\nПостановка сценок, этюдов. "
            },
            'Научить практическим навыкам сценической речи и работы с художественным текстом':  {
                "module_name": "Сценическая речь и художественное чтение",
                "teori": "\nОсновы практической работы над голосом. Дыхательная гимнастика. Развитие артикуляционного аппарата. Работа с дикцией на скороговорках и чистоговорках. Алгоритм выполнения упражнений по сценической речи, поэтапный индивидуальный контроль. \nВыразительное чтение. Художественное чтение как вид исполнительского искусства. Основные законы художественного чтения. Темп речи. Интонация. Понятие текста и подтекста произносимой фразы.\nОсобенности работы над прозаическим и художественным текстом. Выбор произведения. Сверхзадача. Логико-интонационная структура текста. Особенности композиционного построения пьесы: экспозиция, завязка, кульминация и развязка. Время в пьесе. Персонажи - действующие лица спектакля.",
                "practic": "\nУпражнения на развитие дыхания через образ и фантазию. Упражнения на развитие артикуляции и дикции, на развитие речевого аппарата с подключением пластики тела, в определенном ритмическом рисунке.\nМизансцены на включение внимания. Чтение вслух литературных произведений и его разбор. Сочинение сказок, былин, колыбельных, стихов, рассказов по схеме: завязка, развитие действия, кульминация, развязка. Придумывание своих сказочных сюжетов, объединяющих известных героев в одну литературную композицию. Восстановление хода сказки по одному из эпизодов.\nРабота над материалом текста в связке с предметом «Актерское мастерство».\nИтоговое мероприятие \n- младший/ средний возраст – конкурс чтецов; \n- средний/ старший возраст – постановка поэтической композиция на заданную тему."
            },
            'Обучить основам сценического движения':  {
                "module_name": "Сценическое движение. Предлагаемые обстоятельства",
                "teori": "\nПонятие о предлагаемых обстоятельствах. Понятие «Я» в предлагаемых обстоятельствах. Понятия «игра», «театральная игра». Общеразвивающие игры и специальные театральные игры. Значение игры в театральном искусстве. Воображение и вера в вымысел. Язык жестов, движений и чувств.\nМышечная свобода. Снятие зажимов рук, ног и шейного отдела. Тренировка суставно-мышечного аппарата. Универсальная разминка. \nЖесты. Пластика. Тело человека: физические качества, двигательные возможности, проблемы и ограничения. Правильная постановка корпуса как основа всякого движения. Развитие пластической выразительности. Разминка, настройка, релаксация, расслабление/ напряжение. Приемы пластической выразительности.\nПонятия «точки зала (сцены)»; «круг, колонна, линия (шеренга)»; «темпы: быстро, медленно, умеренно».\nТакт, музыкальная фраза, акценты, сильная и слабая доля. Музыка и пластический образ (влияние музыки на возникновение пластических образов, попытки создания образа, внутреннее созерцание образа в движении под музыку). ",
                "practic": "\nУпражнения на предлагаемые обстоятельства «Если бы…», «Я в предлагаемые "
                           "обстоятельствах». Участие в играх-инсценировках, играх-превращениях, сюжетных играх. "
                           "\nЭтюды-превращения (младший возраст): «Я – дерево, цветок, травинка, листик, шишка, "
                           "раковина и т.д.», «Я – ветер, облако, водопад, морская волна, гром, вьюга, "
                           "солнечный свет», «Я – арбуз, яблоко, лимон, авокадо, морковь, лук, семечко и т.д.». "
                           "\nИгры-перевёртыши: собака – кошка, лиса – заяц, волк – медведь, ворона – воробей и т.д. "
                           "Игра в теневой театр – создание с помощью рук образов зверей, птиц, сказочных существ. "
                           "\nУпражнения: заблудился в лесу, хочу выбраться; попал в незнакомый дом/город, "
                           "хочу понять, кто здесь живёт и т.д. Упражнения на смену предлагаемых обстоятельств ("
                           "жарко, вдруг пошёл дождь, подул ветер, стало холодно, налетела вьюга и т.д.). "
                           "\nУпражнения на развитие двигательных способностей (ловкости, гибкости, подвижности, "
                           "выносливости), на освобождение мышц, равновесие, координацию в пространстве: приседание с "
                           "мячом, бег с произношением цифр, ритмические игры (например, удар теннисного мяча в пол "
                           "или бросок в руки другого ребенка, бег по залу в сочетании с активными выдохами на «пф», "
                           "счет с приседаниями (присел – встал – сказал РАЗ, присел – встал – сказал ДВА и т.д.)). "
                           "\nПроизношение текста в движении. Упражнения на выработку правильной техники дыхания. "
                           "Упражнения на развитие пластичности и выразительности рук: «Волна», «Деревья», "
                           "«Подводные растения», «Плавники». Работа над жестами (уместность, выразительность). "
                           "Участие в играх на жестикуляцию (плач, прощание, встреча). \nУпражнения на развитие "
                           "умения двигаться в соответствии с заданным музыкой темпо-ритмом: «Ускоряй-замедляй», "
                           "«Шагаем под музыку, как великаны, как гномы, как лиса, как заяц, как медведь». "
            },
            'Сформировать навыки театрально-исполнительской деятельности':  {
                "module_name": "Знакомство с драматургией. Постановочная репетиционная работа",
                "teori": "\nВыбор произведения. Работа за столом. Чтение литературного произведения. Обсуждение и анализ пьесы. \nОпределение главной темы пьесы, рассказа и идеи автора, раскрывающиеся через основной конфликт. Осмысление сюжета, выделение основных событий/ анализ сюжетной линии. Главные события, являющиеся поворотными моментами в развитии действия, событийный ряд. «Роман жизни героя». Разбор. \nАнализ пьесы по событиям. Выделение в событии линии действий. Определение мотивов поведения, целей героев. Выстраивание логической цепочки. \nОпределение жанра будущей театральной постановки. Читка по ролям. \nЗаконы режиссуры",
                "practic": "\nВыразительное чтение по ролям, расстановка ударений в тексте.  \nРабота над отдельными эпизодами: творческие пробы; показ и обсуждение; распределение ролей; работа над созданием образа, выразительностью и характером персонажа. \nРабота над характером персонажей; поиск выразительных средств и приемов. Разбор и закрепление мизансцен. Репетиции.\nИтоговая работа – показ театральной постановки. \nРефлексия. Подведение итогов. "
            },
            'Научить основам сценографии':  {
                "module_name": "Художественно-визуальное оформление спектакля",
                "teori": "\nСценография как художественное оформление спектакля. Роль художника в театре: художник – постановщик, художник – создатель костюмов, художник – гример. \nТеатральные декорации и бутафория. Сценические эффекты.\nГрим и сценический образ. Профессиональная деятельность гримера. Техника грима. Характерные гримы. Гигиена грима и технических средств в гриме. Правила и техники нанесения грима под образ художественного персонажа. \nКостюм как средство характеристики образа, его значение в создании сценического образа героя.\nПастиж: прически, бороды, усы и парики. \nТехника сцены (свет, звук). Светотень. \nАфиша. Программка. Анонс.",
                "practic": "\nТворческая мастерская «Грим сказочных персонажей», «Придумываем и рисуем маски».\nСоздание элементов декораций, подбор и изготовление реквизита и бутафории. Установка, оформление декоративных деталей, подача бутафории. Монтажные репетиции.\nСоздание эскиза театрального костюма и его элементов для своего персонажа в определенной тематике. \nРазработка партитуры музыкального и шумового оформления. Подбор музыки и шумовых эффектов для музыкального оформления постановки. Запись фонограммы спектакля. \nРазработка светового оформления спектакля.\nСоздание афиши, анонса."
            },
            'Научить основам кукловождения и способам изготовления кукол':  {
                "module_name": "Кукловождение. Мастерская кукол",
                "teori": "\nИстория возникновения и развития театра кукол. Виды кукольного театра. Разновидности кукол и их конструкции: перчаточные, паркетные и тростевые куклы, марионетки. Особенности устройства кукольного театра. Настольный и настольно-плоскостной, предметный и верховой театр кукол.\nТехника кукловождения (в зависимости от выбранной системы). Походка, жест, поворот головы, корпуса. Основное положение куклы. Пластические возможности.  Движение актера с куклой. \nМетодика изготовления театральной куклы из разных материалов. Техника изготовления реквизита и декорации для кукольного спектакля. \nСоздание сценического образа с помощью куклы. Оценка факта. Физическое и психологическое самочувствие актера в роли через куклу. Общение через куклу. Музыка и движение куклы. Речь актера и движения куклы, жест, характеризующий отношение к происходящему.\nТехника работы с куклой: над ширмой, за ширмой, без ширмы.\nОрганизация кукольного театра. Этапы подготовки театрального спектакля. Первый, второй, третий план сценической площадки. Приспособление к реквизиту, декорации в кукольном театре. ",
                "practic": "\nИзготовление простейшей театральной куклы из разных видов материалов. Создание эскиза куклы, изготовление деталей корпуса в соответствии с конструкцией, одежды и аксессуаров для кукол. Сценки с изготовленными куклами.\nЭтюды для укрепления и подвижности рук. Гимнастика рук, пальцев. Упражнения «Волна», «Восьмерка», «Веер», «Миксер», «Кнопочки», «Лепка», «Замочки», «Игра на разных музыкальных инструментах». Этюды кукловодов на выразительность жестов. \nИгры-импровизации в куклами и без них. Упражнения на координацию речи с движением. Упражнения на приобретение навыков управления театральной куклой -  возможные движения головы, рук, корпуса, походки театральной куклы Помощь друг другу в управлении куклами.\nУпражнения на обработку навыков разговора куклы. Диалог героев. "
            },
            'Вовлечь в социально-значимую деятельность':  {
                "module_name": "Организация социальных постановок",
                "teori": "\nПонятие «социальный театр». Особенности жанра. Значение социального театра, его социально-значимая функция. Социальный театр, как технология. Основные правила и принципы социальных постановок. \nСоциальный театр и добровольчество. Роль социального театра в добровольческой деятельности.\nСоциальные спектакли, театрализованные дискуссии, социальные коммуникативные игры. Понятие «Праздник». Виды праздников, их особенности и характеристики. Профессии, которые «делают» праздник. \nМетодика проведения и организации социальных постановок. Понятие «сценарий», правила работы с ним, этапы работы над созданием социального спектакля. Особенности создания сценария социального спектакля. Работа со средствами массовой информации. \nСоциальная реклама как часть социального спектакля. Социальная реклама: особенности и значение. Социальная реклама, как элемент спектакля.",
                "practic": "\nПросмотр и разбор видео отрывков социальных спектаклей.\nВстреча с активистами муниципального или регионального движения добровольцев-волонтеров. \nРазработка/составление сценария социальной постановки/видеоролика на заданную тему. Составление партитуры музыкального, художественного и технического оформления социальной постановки. Постановка по сценарию\создание социального видеоролика.\nУчастие в подготовке социально-значимых мероприятий.\nРефлексия – оценка эффективности социальной постановки."
            },
            'Научить основам пилотирования БПЛА': {
                "module_name": "Введение в пилотирование БПЛА",
                "teori": "\nЗнакомство с историей создания БПЛА. \nПреимущества и минусы использования, перспективы развития БПЛА. Действующие законодательные нормы, проект законов о беспилотниках.\nОбщие характеристики БПЛА. Строение мультикоптера. \nОсновы электричества. Литий-полимерные аккумуляторы. Устройство и принцип работы универсальной системы радиоуправления. Основы полета. Принципы управления. Техника безопасности полётов. Места, где нельзя или нежелательно летать. Потенциально опасные маневры. Теоретические основы маневрирования.",
                "practic": "\nИзготовление моделей планера из бумаги.\nПолёты на симуляторе: обучение полётам на компьютере, проведение учебных полётов на симуляторе.\nПрактическое занятия с литий- полимерными аккумуляторами (зарядка/разрядка/балансировка/хранение).\nРучное управление полётом мультикоптера. Полетные режимы. Быстрый спуск. Учебные полеты: «взлет», посадка», «полеты вперед-назад», «полёт по линии», «полёт с ускорением», «полёт волна», «полёт наоборот», «полёт с комбинацией стиков». "
            },
            'Научить основам FPV пилотирования и обслуживания БПЛА на практике': {
                "module_name": "FPV пилотирование мультикоптера. Пилотирование и обслуживание БПЛА на практике",
                "teori": "Основные компоненты и устройство БПЛА. Принципы управления БПЛА. Основы видеотрансляции: принципы передачи видеосигнала, устройство и характеристики применяемого оборудования для FPV. ТБ при сборке и настройке коптеров, при подготовке к вылету.",
                "practic": "Сборка мультикоптера из конструктора без пайки. Настройка мультикоптера. Настройки полётного контроллера. Техника безопасности при сборке и настройке мультикоптера, при подготовке к вылету. Поиск и устранение неисправностей. Заполнение дефектной ведомости. Предполетная подготовка. Установка, подключение и настройка видеооборудования мультикоптера. Управление полетом с видом от первого лица (режим FPV). Полёты на FPV- симуляторе: обучение полётам на компьютере, проведение учебных полётов на симуляторе. Учебные полеты: «кружение вокруг столба/дерева», «точная посадка на удаленную точку», «коробочка», «челнок», «восьмерка», «облет по кругу», «резкие повороты», пролет через «игольное ушко» (ворота). Учебные полёты с препятствиями. Отработка возможных действий для предотвращения поломки или потери мультикоптера. Разбор аварийных ситуаций."
            },
            'Научить основам аэрофотосъёмки и фотограмметрии': {
                "module_name": "Аэродинамика полета. Геотехнологии. Аэрофотосъёмка и фотограмметрия. ",
                "teori": "Основы аэродинамики летательного аппарата. Полеты на большой высоте, полеты в дождь и при низкой температуре. Полеты с неисправной батареей, вблизи препятствий, вне визуального контакта. История и развитие ГИС. Основы работы с пространственными данными. Что такое карта сегодня? Теоретические основы съемки с воздуха с записью на карту памяти. История фотографии. Фотография как способ изучения окружающего мира. История аэрофотосъемки. Фотограмметрия, как наука. Программы для фотограмметрии.",
                "practic": "Пропеллер и его характеристики, подъёмная сила и аэродинамика. Практические основы сложного маневрирования. Google-карты, Яндекс карты. Найди себя на карте. Работа с навигационными системами ГЛООНАС\ГПС. Практические основы съемки с воздуха. Настройка камеры мультикоптера, подключение карты памяти, подключение и настройка принимающего устройства. Полет с использованием функции удержания высоты и курса. Произведение аэрофотосъемки. Разбор снимков со спутника. Распознавания объектов на снимке. Интерфейс фотограмметрических программ (например, Colmap, Meshroom и т.д.) Создания 3D моделей существующего объекта с помощью камеры и сделанных на неё фотоснимках.   Организация и проведение соревнований по управлению мультикоптером.  Участие в соревнованиях муниципального/краевого уровня. Разбор и устранение ошибок после соревнований."
            },
            'Научить основам автономного пилотирования БПЛА': {
                "module_name": "Программирование БПЛА. Автономный полет БПЛА.",
                "teori": "Основы микроэлектроники и программирования микроконтроллеров. Теоретические основы управления мультикоптером автономно. Основы блочного программирования. Изучение языков программирования.   Разбор автономных систем и микроконтроллеров.",
                "practic": "\nОсновы блочного программирования. Знакомство со средами Scratch или Blockly. Интерфейс среды. Работа с блоками. Построение линейных алгоритмов. Условный оператор. Логическая ИСТИНА, ЛОЖЬ. Циклы. Бесконечные циклы, циклы с условием. Переменные. Сенсоры. Программа для мультикоптера в среде Scratch или Blockly. Тестовый автономный полет с использованием написанной программы. Планирование маршрутов и программирование летательного аппарата для полета по маршруту. Язык программирования Python. Программирование в Python IDE. Построение линейных алгоритмов. Условный оператор. Логическая ИСТИНА, ЛОЖЬ. Циклы. Бесконечные циклы, циклы с условием. Переменные. Сенсоры. Программа для мультикоптера на Python. Тестовый автономный полет с использованием написанной программы. Планирование маршрутов и программирование летательного аппарата для полета по маршруту.\nИспользование меток и сенсоров для различных комбинаций траекторий полета. Отладка параметров полета с учетом погрешностей. Выполнение определенных задач с помощью автономного летательного аппарата (точный пролёт через контрольные точки, облёт препятствий, посадка на ограниченную площадку по метке и т.д.).\nОрганизация и проведение соревнований. Разбор и устранение ошибок после соревнований. Участие в соревнованиях краевого /всероссийского уровня."
            },
            'Развивать навык  пилотирования  и эксплуатации БПЛА': {
                "module_name": "Подготовка к чемпионату «Молодые профессионалы» по компетенции «Эксплуатация беспилотных авиационных систем».",
                "teori": "Работа над инженерным проектом: основы планирования проектной работы, работа над проектом в составе команды. Технология пайки. Техника безопасности. Правила оформления презентации и доклада. Согласование полетов.",
                "practic": "Работа в группах над инженерным проектом «Беспилотная авиационная система». Пайка бортового оборудования БПЛА. Основы 3D-печати и 3D-моделирования: применяемое оборудование и программное обеспечение. Изготовление прототипа, специализированного БПЛА. Изготовление новых узлов, оборудования, ПО. Составление пакета разрешительной документации. Проведение учебных полетов, проверка работоспособности новых узлов и проектных решений. Доработка прототипа, устранение недостатков. Ортофотосъемка 3D – макета. Подготовка итоговой презентации по проделанной работе. Доклад о проделанной работе."
            },

            "Сформировать интерес к робототехнике": {
                "module_name": "Введение в робототехнику",
                "teori": "\tТБ и правила поведения в объединении. Знакомство с конструктором LEGO, правилами организации рабочего места. История робототехники. Интерфейс среды программирования Lego WeDo 2.0. и основные этапы разработки модели Конструкции. Создание элементов конструкций. Рычаг: определение и применение. Создание моделей рычагов 1,2,3 рода. Мотор и ось. Технологическая карта и технический паспорт модели. Зубчатые колеса, ведущее и ведомое, виды соединения мотора и зубчатых колес. Промежуточное зубчатое колесо, понижающая зубчатая передача и повышающая зубчатая передача, коронное зубчатое колесо. Изучение понятий ведущий шкив и ведомый шкив. Перекрестная переменная передача. Сравнение ременной передачи и зубчатых колес, сравнений простой ременной передачи и перекрестной передачи. Червячная зубчатая передача, исследование механизма, выявление функций. Знакомство с элементом модели кулачок (кулачковый механизм), выявление особенностей кулачкового механизма.  Датчик наклона, датчик расстояния. ",
                "practic": "\tВыработка навыка поворота изображений на планшетном компьютере и подключение СмартХаба. Сборка моделей робототехнических устройств по пошаговым инструкциям.  Заполнение технического паспорта собранной модели. Работа в среде программирования Lego WeDo 2.0. Создание программы управления роботом по образцу. Соревнования на скорость сборки моделей роботов по инструкциям и по образцу.\n\tСсылки на интернет ресурсы:\n\t\tLEGO  Education WeDo 2.0 Комплект учебных проектов.  Электронный ресурс . URL: https://education.lego.com/v3/assets/blt293eea581807678a/blteb267366ce34fc6b/5f880486f4f4cf0fa39d304d/teacherguide-ru-ru-v1.pdf   (дата обращения 24.11. 2022 г.);\n\t\tСайт техподдержки продуктов LEGO ( методические рекомендации, интерактивные уроки, программное обеспечение ) URL:   https://www.lego.com/ru-ru/service (дата обращения 24.11. 2022 г.);\n\t\tИнструкции к конструктору Lego WeDo 2.0 URL:    https://www.prorobot.ru/lego/wedo2.php (дата обращения 24.11. 2022 г.);\n\t\tРобототехника Lego WeDo 2 (различные инструкции по сборке моделей) URL: https://zakharkiv-travel.ru/category/smart-kid/programming-for-children/%d1%80%d0%be%d0%b1%d0%be%d1%82%d0%be%d1%82%d0%b5%d1%85%d0%bd%d0%b8%d0%ba%d0%b0-lego-wedo-2/ (дата обращения 24.11. 2022 г.);\n\t\tТехническая поддержка по сериям решений. Инструкции по сборке моделей. Уроки и занятия. Программное обеспечение. URL: https://educube.ru/support/ (дата обращения 24.11. 2022 г.)."
            },
            "Научить основам алгоритмизации и программирования робототехнических устройств": {
                "module_name": "Основы алгоритмизации и программирования",
                "teori": "Знакомство с понятием алгоритма, изучение основных свойств алгоритма. Знакомство с понятием исполнителя. Изучение блок-схемы как способа записи алгоритма. Изучение программного обеспечения Lego Education WeDo 2.0. Изучение блоков-операторов. Линейный алгоритм, понятие команда. Знакомство с понятием цикла. Варианты организации цикла в среде программирования LEGO. Изображение команд в программе и на схеме.",
                "practic": "Сборка робототехнических устройств по пошаговым инструкциям («Улитка-фонарик», «Вентилятор», «Движущийся спутник», «Робот шпион», «А. Майло, научный вездеход», «В. Датчик перемещения Майло», «С. Датчик наклона Майло», «D. Совместная работа». Заполнение технического паспорта собранных моделей."
            },
            "Научить проектировать и создавать робототехнические устройства": {
                "module_name": "Робототехническое устройств: от идеи до воплощения",
                "teori": "Основы проектной деятельности. Этапы: Проблема – Проектирование (планирование) – Поиск информации – Продукт – Презентация. Элементы робототехнической модели. Технологическая карта и технический паспорт модели.",
                "practic": "Обсуждение элементов модели. Конструирование, разработка и запись управляющего алгоритма, заполнение технического паспорта модели. Составление собственной модели, составление технологической карты и технического паспорта модели. Разработка одного или нескольких вариантов управляющего алгоритма. Демонстрация и защита модели.  Варианты проектов с открытым решением по выбору: «Робот-тягач», «Гоночный автомобиль», «Робот-Рыба», «Робот-Лягушка», «Робот-Гусеница», «Пчела и цветок», «Робот-Змея», «Вертолет», «Вилочный подъемник», «Подметально-уборочная машина», «Луноход»."
            },
            "Совершенствовать ключевые компетенции по созданию робототехнических проектов": {
                "module_name": "Соревновательная робототехника",
                "teori": "Виды соревнований. Разработка проекта под конкретную задачу. Изучение регламентов конкурсов / мероприятий/соревнований по робототехнике.",
                "practic": "\tПодготовка робототехнического проекта согласно выбранного регламента. Участие в соревнованиях и конкурсах.\n\tРекомендуемые к участию конкурсы / мероприятия/соревнования по робототехнике:\n\t\tВсероссийская Конференция «Юные техники и изобретатели» в Государственной Думе Федерального Собрания Российской Федерации URL: http://xn----itbbmalqd7b5a5d8a.xn--p1ai/konkurs/usloviya/  (дата обращения 24.11. 2022 г.);\n\t\tРоссийская робототехническая олимпиада URL: https://dm-centre.ru/pf/wro/ (дата обращения 24.11. 2022 г.);\n\t\tЧемпионат по робототехнике FIRST ROBOTICS CHAMPIONSHIP URL: http://ncrobo.ru/  (дата обращения 24.11. 2022 г.);\n\t\tСерия соревновательных и образовательных мероприятий «ИКаР» (Инженерные кадры России) URL: https://www.xn--80a2aec.xn--p1ai/inzhenernye-kadry-rossii/about/ (дата обращения 24.11. 2022 г.)."
            }

        }
        dop_list = ['en_form_edu', 'en_subject_taskss', 'en_metasubject_tasks', 'en_personal_tasks', 'en_metasubject_tasks_no']
        data_dict = {}
        for key, item in request.values.lists():
            if key in dop_list:
                data_dict[key] = item
            else:
                data_dict[key] = item[0]
        report_dict = data_dict.copy()
        modules_dict = []
        subj_data_dict = []
        data_dict["cop_meta_result"] = []
        data_dict["cop_sub_result"] = []
        if data_dict["en_training_periodn"] == "36":
            if data_dict["en_duration_lesson_choice"] == "1":
                data_dict["en_duration_lesson"] = "1"
                data_dict["en_number_classes"] = "2"
            if data_dict["en_duration_lesson_choice"] == "2":
                data_dict["en_duration_lesson"] = "2"
                data_dict["en_number_classes"] = "1"
            if data_dict["en_duration_lesson_choice"] == "3":
                data_dict["en_duration_lesson"] = "1"
                data_dict["en_number_classes"] = "1"
        dop_dict = {
            "tech": "Развитие технических способностей ",
            "sci": "Формирование устойчивого интереса к исследовательской деятельности",
            "art": "Развитие творческих способностей",
            "adv": "Духовно-нравственное воспитание средствами туристско-краеведческой деятельности",
            'sport': 'Развитие физических показателей и улучшение спортивных результатов',
            'soc': 'Развитие социально-гуманитарных навыков'
        }
        data_dict['cop_meta_result'] = ''
        data_dict['cop_sub_result'] = ''
        data_dict['cop_person_result'] = ''
        # data_dict["en_program_objectives"] = dop_dict[data_dict["en_orientation"]]
        all_time = int(data_dict["en_training_periodn"]) * int(data_dict["en_duration_lesson"]) * int(data_dict["en_number_classes"]) // 18
        if len(data_dict['en_subject_taskss']) > 0:
            for item in data_dict['en_subject_taskss']:
                modules_dict.append({"name": item, "time": time_limit_dict[item]})
                subj_data_dict.append(quest_data_dict[item])
                data_dict["cop_sub_result"] += result_dict[item]
        if len(data_dict['en_metasubject_tasks']) > 0:
            for item in data_dict['en_metasubject_tasks']:
                if all_time >= len(data_dict['en_subject_taskss']) + 1:
                    modules_dict.append({"name": item, "time": time_limit_dict[item]})
                subj_data_dict.append(quest_data_dict[item])
                data_dict["cop_meta_result"] += result_dict[item]
        if len(data_dict['en_metasubject_tasks_no']) > 0:
            for item in data_dict['en_metasubject_tasks_no']:
                if item in result_dict.keys():
                    data_dict["cop_meta_result"] += result_dict[item]
        if len(data_dict['en_personal_tasks']) > 0:
            for item in data_dict['en_personal_tasks']:
                if item in dict_person.keys():
                    data_dict['cop_person_result'] += dict_person[item]
        data_dict['modules'] = modules_dict
        data_dict['plan_list'] = subj_data_dict
        data_dict['en_orientation'] = dict_params[data_dict['en_orientation']]
        data_dict['en_type_activity'] = dict_params[data_dict['en_type_activity']] if data_dict['en_type_activity'] in dict_params.keys() else data_dict['en_type_activity']
        name = f"program {count}.docx"
        doc1 = DocxTemplate("5.docx")
        doc1.render(data_dict)
        doc1.save(name)
        count += 1
        return send_file(name)
    except BaseException as e:
        count += 1
        with open(f"program_error_log_{count}.json", 'w') as log_f:
            json.dump(report_dict, log_f)
        return jsonify({"error":"ошибка сервера"})
    return jsonify({})


@app.route('/constructor')
def home():
    return jsonify({"text": 'hi'})


@app.errorhandler(404)
def page_not_found(err):
    return redirect("https://obr-khv.ru{}".format(request.path))
